[Survived] LogicalOperator
complex.js:40:14
-     var cosh = Math.cosh || function(x) {
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
-     };
+     var cosh = Math.cosh && function (x) {
+     return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+   };

[Survived] BlockStatement
complex.js:40:39
-     var cosh = Math.cosh || function(x) {
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
-     };
+     var cosh = Math.cosh || function(x) {};

[Survived] ConditionalExpression
complex.js:41:12
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return true ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] ConditionalExpression
complex.js:41:12
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return false ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] EqualityOperator
complex.js:41:12
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) <= 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] EqualityOperator
complex.js:41:12
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) >= 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] ArithmeticOperator
complex.js:41:33
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? 1 + x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] ArithmeticOperator
complex.js:41:41
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) / 0.5;

[Survived] ArithmeticOperator
complex.js:41:42
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) - Math.exp(-x)) * 0.5;

[Survived] UnaryOperator
complex.js:41:65
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(+x)) * 0.5;

[Survived] LogicalOperator
complex.js:44:14
-     var sinh = Math.sinh || function(x) {
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
-     };
+     var sinh = Math.sinh && function (x) {
+     return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+   };

[Survived] BlockStatement
complex.js:44:39
-     var sinh = Math.sinh || function(x) {
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
-     };
+     var sinh = Math.sinh || function(x) {};

[Survived] ConditionalExpression
complex.js:45:12
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return true ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;

[Survived] ConditionalExpression
complex.js:45:12
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return false ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;

[Survived] EqualityOperator
complex.js:45:12
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) <= 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;

[Survived] EqualityOperator
complex.js:45:12
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) >= 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;

[Survived] ArithmeticOperator
complex.js:45:37
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) / 0.5;

[Survived] ArithmeticOperator
complex.js:45:38
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] UnaryOperator
complex.js:45:61
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(+x)) * 0.5;

[Survived] EqualityOperator
complex.js:57:9
-       if (-b > x || x > b) {
+       if (-b >= x || x > b) {

[Survived] EqualityOperator
complex.js:57:19
-       if (-b > x || x > b) {
+       if (-b > x || x >= b) {

[Survived] ArithmeticOperator
complex.js:76:9
-           xx * (
-             xx * (
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
-               + 1 / 40320)
-             - 1 / 720)
-           + 1 / 24)
+           xx * (xx * (xx * (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800) + 1 / 40320) - 1 / 720) - 1 / 24)

[Survived] ArithmeticOperator
complex.js:76:9
-           xx * (
-             xx * (
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
-               + 1 / 40320)
-             - 1 / 720)
+           xx / (xx * (xx * (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800) + 1 / 40320) - 1 / 720)

[Survived] ArithmeticOperator
complex.js:77:11
-             xx * (
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
-               + 1 / 40320)
-             - 1 / 720)
+             xx * (xx * (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800) + 1 / 40320) + 1 / 720)

[Survived] ArithmeticOperator
complex.js:77:11
-             xx * (
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
-               + 1 / 40320)
+             xx / (xx * (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800) + 1 / 40320)

[Survived] ArithmeticOperator
complex.js:78:13
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
-               + 1 / 40320)
+               xx * (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800) - 1 / 40320)

[Survived] ArithmeticOperator
complex.js:78:13
-               xx * (
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
+               xx / (xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) - 1 / 3628800)

[Survived] ArithmeticOperator
complex.js:79:15
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
-                 - 1 / 3628800)
+                 xx * (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600) + 1 / 3628800)

[Survived] ArithmeticOperator
complex.js:79:15
-                 xx * (
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
+                 xx / (xx * (xx / 20922789888000 - 1 / 87178291200) + 1 / 479001600)

[Survived] ArithmeticOperator
complex.js:80:17
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
-                   + 1 / 479001600)
+                   xx * (xx / 20922789888000 - 1 / 87178291200) - 1 / 479001600)

[Survived] ArithmeticOperator
complex.js:80:17
-                   xx * (
-                     xx / 20922789888000
-                     - 1 / 87178291200)
+                   xx / (xx / 20922789888000 - 1 / 87178291200)

[Survived] ArithmeticOperator
complex.js:81:19
-                     xx / 20922789888000
-                     - 1 / 87178291200)
+                     xx / 20922789888000 + 1 / 87178291200)

[Survived] ArithmeticOperator
complex.js:81:19
-                     xx / 20922789888000
+                     xx * 20922789888000

[Survived] ArithmeticOperator
complex.js:82:21
-                     - 1 / 87178291200)
+                     - 1 * 87178291200)

[Survived] ArithmeticOperator
complex.js:83:19
-                   + 1 / 479001600)
+                   + 1 * 479001600)

[Survived] ArithmeticOperator
complex.js:84:17
-                 - 1 / 3628800)
+                 - 1 * 3628800)

[Survived] ArithmeticOperator
complex.js:85:15
-               + 1 / 40320)
+               + 1 * 40320)

[Survived] ArithmeticOperator
complex.js:86:13
-             - 1 / 720)
+             - 1 * 720)

[Survived] ConditionalExpression
complex.js:96:9
-       if (a < 3000 && b < 3000) {
+       if (true) {

[Survived] ConditionalExpression
complex.js:96:9
-       if (a < 3000 && b < 3000) {
+       if (true && b < 3000) {

[Survived] EqualityOperator
complex.js:96:9
-       if (a < 3000 && b < 3000) {
+       if (a <= 3000 && b < 3000) {

[Survived] ConditionalExpression
complex.js:96:21
-       if (a < 3000 && b < 3000) {
+       if (a < 3000 && true) {

[Survived] EqualityOperator
complex.js:96:21
-       if (a < 3000 && b < 3000) {
+       if (a < 3000 && b <= 3000) {

[Survived] ConditionalExpression
complex.js:100:9
-       if (a < b) {
+       if (true) {

[Survived] ConditionalExpression
complex.js:100:9
-       if (a < b) {
+       if (false) {

[Survived] BlockStatement
complex.js:100:16
-       if (a < b) {
-         a = b;
-         b = x / y;
-       } else {
+       if (a < b) {} else {

[Survived] ArithmeticOperator
complex.js:102:11
-         b = x / y;
+         b = x * y;

[Survived] BlockStatement
complex.js:103:12
-       } else {
-         b = y / x;
-       }
+       } else {}

[Survived] ArithmeticOperator
complex.js:104:11
-         b = y / x;
+         b = y * x;

[Survived] ArithmeticOperator
complex.js:106:12
-       return a * Math.sqrt(1 + b * b);
+       return a / Math.sqrt(1 + b * b);

[Survived] ArithmeticOperator
complex.js:106:30
-       return a * Math.sqrt(1 + b * b);
+       return a * Math.sqrt(1 + b / b);

[Survived] BlockStatement
complex.js:109:32
-     var parser_exit = function() {
-       throw SyntaxError('Invalid Param');
-     };
+     var parser_exit = function() {};

[Survived] ConditionalExpression
complex.js:133:9
-       if (_a < 3000 && _b < 3000) {
+       if (true && _b < 3000) {

[Survived] EqualityOperator
complex.js:133:9
-       if (_a < 3000 && _b < 3000) {
+       if (_a <= 3000 && _b < 3000) {

[Survived] EqualityOperator
complex.js:133:22
-       if (_a < 3000 && _b < 3000) {
+       if (_a < 3000 && _b <= 3000) {

[Survived] ArithmeticOperator
complex.js:169:10
-        a = a / 2;
+        a = a * 2;

[Survived] ArithmeticOperator
complex.js:172:27
-       return 0.5 * Math.log(a * a + b * b) + Math.LN2;
+       return 0.5 * Math.log(a / a + b * b) + Math.LN2;

[Survived] ObjectLiteral
complex.js:177:13
-       var z = { 're': 0, 'im': 0 };
+       var z = {};

[Survived] BlockStatement
complex.js:179:40
-       if (a === undefined || a === null) {
-         z['re'] =
-         z['im'] = 0;
-       } else if (b !== undefined) {
+       if (a === undefined || a === null) {} else if (b !== undefined) {

[Survived] StringLiteral
complex.js:180:9
-         z['re'] =
+         z[""] =

[Survived] StringLiteral
complex.js:181:9
-         z['im'] = 0;
+         z[""] = 0;

[Survived] ConditionalExpression
complex.js:205:22
-             } else if (a.length === 2) { // Quick array check
+             } else if (true) { // Quick array check

[Survived] BlockStatement
complex.js:208:18
-             } else {
-               parser_exit();
-             }
+             } else {}

[Survived] StringLiteral
complex.js:215:13
-             z['im'] = /* void */
+             z[""] = /* void */

[Survived] StringLiteral
complex.js:216:13
-             z['re'] = 0;
+             z[""] = 0;

[Survived] Regex
complex.js:218:32
-             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);
+             var tokens = a.match(/\d\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);

[Survived] Regex
complex.js:218:32
-             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);
+             var tokens = a.match(/\d+\.?\d*e[+-]?\d|\d+\.?\d*|\.\d+|./g);

[Survived] Regex
complex.js:218:32
-             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);
+             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d\.?\d*|\.\d+|./g);

[Survived] Regex
complex.js:218:32
-             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);
+             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d|./g);

[Survived] Regex
complex.js:218:32
-             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\d+|./g);
+             var tokens = a.match(/\d+\.?\d*e[+-]?\d+|\d+\.?\d*|\.\D+|./g);

[Survived] ConditionalExpression
complex.js:222:15
-             if (tokens === null) {
+             if (false) {

[Survived] BlockStatement
complex.js:222:32
-             if (tokens === null) {
-               parser_exit();
-             }
+             if (tokens === null) {}

[Survived] ConditionalExpression
complex.js:230:44
-               if (c === ' ' || c === '\t' || c === '\n') {
+               if (c === ' ' || c === '\t' || false) {

[Survived] StringLiteral
complex.js:230:50
-               if (c === ' ' || c === '\t' || c === '\n') {
+               if (c === ' ' || c === '\t' || c === "") {

[Survived] ConditionalExpression
complex.js:236:37
-               } else if (c === 'i' || c === 'I') {
+               } else if (c === 'i' || false) {

[Survived] StringLiteral
complex.js:236:43
-               } else if (c === 'i' || c === 'I') {
+               } else if (c === 'i' || c === "") {

[Survived] ConditionalExpression
complex.js:238:19
-                 if (plus + minus === 0) {
+                 if (false) {

[Survived] BlockStatement
complex.js:238:39
-                 if (plus + minus === 0) {
-                   parser_exit();
-                 }
+                 if (plus + minus === 0) {}

[Survived] ArithmeticOperator
complex.js:243:40
-                   z['im'] += parseFloat((minus % 2 ? '-' : '') + tokens[i + 1]);
+                   z['im'] += parseFloat((minus * 2 ? '-' : '') + tokens[i + 1]);

[Survived] StringLiteral
complex.js:243:58
-                   z['im'] += parseFloat((minus % 2 ? '-' : '') + tokens[i + 1]);
+                   z['im'] += parseFloat((minus % 2 ? '-' : "Stryker was here!") + tokens[i + 1]);

[Survived] ArithmeticOperator
complex.js:246:40
-                   z['im'] += parseFloat((minus % 2 ? '-' : '') + '1');
+                   z['im'] += parseFloat((minus * 2 ? '-' : '') + '1');

[Survived] ConditionalExpression
complex.js:252:19
-                 if (plus + minus === 0 || isNaN(c)) {
+                 if (false) {

[Survived] LogicalOperator
complex.js:252:19
-                 if (plus + minus === 0 || isNaN(c)) {
+                 if (plus + minus === 0 && isNaN(c)) {

[Survived] ConditionalExpression
complex.js:252:19
-                 if (plus + minus === 0 || isNaN(c)) {
+                 if (false || isNaN(c)) {

[Survived] BlockStatement
complex.js:252:51
-                 if (plus + minus === 0 || isNaN(c)) {
-                   parser_exit();
-                 }
+                 if (plus + minus === 0 || isNaN(c)) {}

[Survived] ConditionalExpression
complex.js:256:44
-                 if (tokens[i + 1] === 'i' || tokens[i + 1] === 'I') {
+                 if (tokens[i + 1] === 'i' || false) {

[Survived] ArithmeticOperator
complex.js:256:51
-                 if (tokens[i + 1] === 'i' || tokens[i + 1] === 'I') {
+                 if (tokens[i + 1] === 'i' || tokens[i - 1] === 'I') {

[Survived] StringLiteral
complex.js:256:62
-                 if (tokens[i + 1] === 'i' || tokens[i + 1] === 'I') {
+                 if (tokens[i + 1] === 'i' || tokens[i + 1] === "") {

[Survived] ArithmeticOperator
complex.js:257:40
-                   z['im'] += parseFloat((minus % 2 ? '-' : '') + c);
+                   z['im'] += parseFloat((minus * 2 ? '-' : '') + c);

[Survived] ConditionalExpression
complex.js:267:15
-             if (plus + minus > 0) {
+             if (false) {

[Survived] BlockStatement
complex.js:267:33
-             if (plus + minus > 0) {
-               parser_exit();
-             }
+             if (plus + minus > 0) {}

[Survived] StringLiteral
complex.js:273:13
-             z['im'] = 0;
+             z[""] = 0;

[Survived] ConditionalExpression
complex.js:277:9
-           default:
-             parser_exit();
+           default:

[Survived] ConditionalExpression
complex.js:281:9
-       if (isNaN(z['re']) || isNaN(z['im'])) {
+       if (true) {

[Survived] LogicalOperator
complex.js:281:9
-       if (isNaN(z['re']) || isNaN(z['im'])) {
+       if (isNaN(z['re']) && isNaN(z['im'])) {

[Survived] StringLiteral
complex.js:281:17
-       if (isNaN(z['re']) || isNaN(z['im'])) {
+       if (isNaN(z[""]) || isNaN(z['im'])) {

[Survived] StringLiteral
complex.js:281:35
-       if (isNaN(z['re']) || isNaN(z['im'])) {
+       if (isNaN(z['re']) || isNaN(z[""])) {

[Survived] ConditionalExpression
complex.js:339:11
-         if (this['isInfinite']() || z['isInfinite']()) {
+         if (false) {

[Survived] BlockStatement
complex.js:339:54
-         if (this['isInfinite']() || z['isInfinite']()) {
-           return Complex['INFINITY'];
-         }
+         if (this['isInfinite']() || z['isInfinite']()) {}

[Survived] StringLiteral
complex.js:340:24
-           return Complex['INFINITY'];
+           return Complex[""];

[Survived] BlockStatement
complex.js:363:54
-         if (this['isInfinite']() || z['isInfinite']()) {
-           return Complex['INFINITY'];
-         }
+         if (this['isInfinite']() || z['isInfinite']()) {}

[Survived] StringLiteral
complex.js:364:24
-           return Complex['INFINITY'];
+           return Complex[""];

[Survived] ConditionalExpression
complex.js:382:55
-         if ((this['isInfinite']() && z['isZero']()) || (this['isZero']() && z['isInfinite']())) {
+         if ((this['isInfinite']() && z['isZero']()) || (false)) {

[Survived] LogicalOperator
complex.js:382:55
-         if ((this['isInfinite']() && z['isZero']()) || (this['isZero']() && z['isInfinite']())) {
+         if ((this['isInfinite']() && z['isZero']()) || (this['isZero']() || z['isInfinite']())) {

[Survived] StringLiteral
complex.js:382:77
-         if ((this['isInfinite']() && z['isZero']()) || (this['isZero']() && z['isInfinite']())) {
+         if ((this['isInfinite']() && z['isZero']()) || (this['isZero']() && z[""]())) {

[Survived] ConditionalExpression
complex.js:392:11
-         if (z['im'] === 0 && this['im'] === 0) {
+         if (false) {

[Survived] StringLiteral
complex.js:392:13
-         if (z['im'] === 0 && this['im'] === 0) {
+         if (z[""] === 0 && this['im'] === 0) {

[Survived] StringLiteral
complex.js:392:33
-         if (z['im'] === 0 && this['im'] === 0) {
+         if (z['im'] === 0 && this[""] === 0) {

[Survived] BlockStatement
complex.js:392:46
-         if (z['im'] === 0 && this['im'] === 0) {
-           return new Complex(this['re'] * z['re'], 0);
-         }
+         if (z['im'] === 0 && this['im'] === 0) {}

[Survived] ArithmeticOperator
complex.js:393:28
-           return new Complex(this['re'] * z['re'], 0);
+           return new Complex(this['re'] / z['re'], 0);

[Survived] StringLiteral
complex.js:393:33
-           return new Complex(this['re'] * z['re'], 0);
+           return new Complex(this[""] * z['re'], 0);

[Survived] StringLiteral
complex.js:393:43
-           return new Complex(this['re'] * z['re'], 0);
+           return new Complex(this['re'] * z[""], 0);

[Survived] ConditionalExpression
complex.js:421:11
-         if (this['isZero']() || z['isInfinite']()) {
+         if (false) {

[Survived] BlockStatement
complex.js:421:50
-         if (this['isZero']() || z['isInfinite']()) {
-           return Complex['ZERO'];
-         }
+         if (this['isZero']() || z['isInfinite']()) {}

[Survived] BlockStatement
complex.js:432:20
-         if (0 === d) {
-           // Divisor is real
-           return new Complex(a / c, b / c);
-         }
+         if (0 === d) {}

[Survived] ConditionalExpression
complex.js:437:11
-         if (Math.abs(c) < Math.abs(d)) {
+         if (true) {

[Survived] ArithmeticOperator
complex.js:448:13
-           x = d / c;
+           x = d * c;

[Survived] ArithmeticOperator
complex.js:449:13
-           t = d * x + c;
+           t = d / x + c;

[Survived] ArithmeticOperator
complex.js:452:16
-             (a + b * x) / t,
+             (a + b / x) / t,

[Survived] ArithmeticOperator
complex.js:453:16
-             (b - a * x) / t);
+             (b - a / x) / t);

[Survived] ConditionalExpression
complex.js:469:11
-         if (z['isZero']()) {
+         if (false) {

[Survived] BlockStatement
complex.js:469:26
-         if (z['isZero']()) {
-           return Complex['ONE'];
-         }
+         if (z['isZero']()) {}

[Survived] EqualityOperator
complex.js:476:24
-           if (b === 0 && a > 0) {
+           if (b === 0 && a >= 0) {

[Survived] ConditionalExpression
complex.js:480:20
-           } else if (a === 0) { // If base is fully imaginary
+           } else if (false) { // If base is fully imaginary

[Survived] BlockStatement
complex.js:480:29
-           } else if (a === 0) { // If base is fully imaginary
-             switch ((z['re'] % 4 + 4) % 4) {
-               case 0:
-                 return new Complex(Math.pow(b, z['re']), 0);
-               case 1:
-                 return new Complex(0, Math.pow(b, z['re']));
-               case 2:
-                 return new Complex(-Math.pow(b, z['re']), 0);
-               case 3:
-                 return new Complex(0, -Math.pow(b, z['re']));
-             }
-           }
+           } else if (a === 0) {}

[Survived] ArithmeticOperator
complex.js:482:19
-             switch ((z['re'] % 4 + 4) % 4) {
+             switch ((z['re'] % 4 + 4) * 4) {

[Survived] ArithmeticOperator
complex.js:482:20
-             switch ((z['re'] % 4 + 4) % 4) {
+             switch ((z['re'] % 4 - 4) % 4) {

[Survived] StringLiteral
complex.js:482:22
-             switch ((z['re'] % 4 + 4) % 4) {
+             switch ((z[""] % 4 + 4) % 4) {

[Survived] ConditionalExpression
complex.js:489:13
-               case 3:
-                 return new Complex(0, -Math.pow(b, z['re']));
+               case 3:

[Survived] ConditionalExpression
complex.js:514:22
-         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) {
+         if (a === 0 && true && z['re'] > 0 && z['im'] >= 0) {

[Survived] ConditionalExpression
complex.js:514:33
-         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) {
+         if (a === 0 && b === 0 && true && z['im'] >= 0) {

[Survived] EqualityOperator
complex.js:514:33
-         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) {
+         if (a === 0 && b === 0 && z['re'] >= 0 && z['im'] >= 0) {

[Survived] ConditionalExpression
complex.js:514:48
-         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) {
+         if (a === 0 && b === 0 && z['re'] > 0 && true) {

[Survived] EqualityOperator
complex.js:514:48
-         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) {
+         if (a === 0 && b === 0 && z['re'] > 0 && z['im'] > 0) {

[Survived] ConditionalExpression
complex.js:543:13
-           if (b === 0) {
+           if (false) {

[Survived] BlockStatement
complex.js:543:22
-           if (b === 0) {
-             return new Complex(Math.sqrt(a), 0);
-           }
+           if (b === 0) {}

[Survived] ConditionalExpression
complex.js:570:11
-         if (this['im'] === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:570:11
-         if (this['im'] === 0) {
+         if (false) {

[Survived] StringLiteral
complex.js:570:16
-         if (this['im'] === 0) {
+         if (this[""] === 0) {

[Survived] ConditionalExpression
complex.js:612:11
-         if (b === 0 && a > 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:612:11
-         if (b === 0 && a > 0) {
+         if (false) {

[Survived] LogicalOperator
complex.js:612:11
-         if (b === 0 && a > 0) {
+         if (b === 0 || a > 0) {

[Survived] ConditionalExpression
complex.js:612:11
-         if (b === 0 && a > 0) {
+         if (true && a > 0) {

[Survived] EqualityOperator
complex.js:612:11
-         if (b === 0 && a > 0) {
+         if (b !== 0 && a > 0) {

[Survived] ConditionalExpression
complex.js:612:22
-         if (b === 0 && a > 0) {
+         if (b === 0 && true) {

[Survived] EqualityOperator
complex.js:612:22
-         if (b === 0 && a > 0) {
+         if (b === 0 && a >= 0) {

[Survived] EqualityOperator
complex.js:612:22
-         if (b === 0 && a > 0) {
+         if (b === 0 && a <= 0) {

[Survived] BlockStatement
complex.js:721:23
-       'sec': function() {
-         // sec(c) = 2 / (e^(ci) + e^(-ci))
-         var a = this['re'];
-         var b = this['im'];
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
-         return new Complex(
-           Math.cos(a) * cosh(b) / d,
-           Math.sin(a) * sinh(b) / d);
-       },
+       'sec': function() {},

[Survived] StringLiteral
complex.js:725:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:726:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ArithmeticOperator
complex.js:727:15
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:727:15
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 / cosh(2 * b) + 0.5 * Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:727:26
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 / b) + 0.5 * Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:727:35
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) + 0.5 / Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:727:50
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 / a);

[Survived] ArithmeticOperator
complex.js:730:9
-           Math.cos(a) * cosh(b) / d,
+           Math.cos(a) * cosh(b) * d,

[Survived] ArithmeticOperator
complex.js:730:9
-           Math.cos(a) * cosh(b) / d,
+           Math.cos(a) / cosh(b) / d,

[Survived] ArithmeticOperator
complex.js:731:9
-           Math.sin(a) * sinh(b) / d);
+           Math.sin(a) * sinh(b) * d);

[Survived] ArithmeticOperator
complex.js:731:9
-           Math.sin(a) * sinh(b) / d);
+           Math.sin(a) / sinh(b) / d);

[Survived] BlockStatement
complex.js:739:23
-       'csc': function() {
-         // csc(c) = 2i / (e^(ci) - e^(-ci))
-         var a = this['re'];
-         var b = this['im'];
-         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);
-         return new Complex(
-           Math.sin(a) * cosh(b) / d,
-           -Math.cos(a) * sinh(b) / d);
-       },
+       'csc': function() {},

[Survived] StringLiteral
complex.js:743:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:744:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ArithmeticOperator
complex.js:745:15
-         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:745:15
-         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);
+         var d = 0.5 / cosh(2 * b) - 0.5 * Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:745:35
-         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) - 0.5 / Math.cos(2 * a);

[Survived] ArithmeticOperator
complex.js:745:50
-         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) - 0.5 * Math.cos(2 / a);

[Survived] ArithmeticOperator
complex.js:748:9
-           Math.sin(a) * cosh(b) / d,
+           Math.sin(a) * cosh(b) * d,

[Survived] ArithmeticOperator
complex.js:748:9
-           Math.sin(a) * cosh(b) / d,
+           Math.sin(a) / cosh(b) / d,

[Survived] ArithmeticOperator
complex.js:749:9
-           -Math.cos(a) * sinh(b) / d);
+           -Math.cos(a) * sinh(b) * d);

[Survived] ArithmeticOperator
complex.js:749:9
-           -Math.cos(a) * sinh(b) / d);
+           -Math.cos(a) / sinh(b) / d);

[Survived] UnaryOperator
complex.js:749:9
-           -Math.cos(a) * sinh(b) / d);
+           +Math.cos(a) * sinh(b) / d);

[Survived] ConditionalExpression
complex.js:810:11
-         if (a === 0) {
+         if (false) {

[Survived] BlockStatement
complex.js:810:20
-         if (a === 0) {
-           if (b === 1) {
-             return new Complex(0, Infinity);
-           }
-           if (b === -1) {
-             return new Complex(0, -Infinity);
-           }
-         }
+         if (a === 0) {}

[Survived] ConditionalExpression
complex.js:812:13
-           if (b === 1) {
+           if (true) {

[Survived] ConditionalExpression
complex.js:812:13
-           if (b === 1) {
+           if (false) {
