[Survived] BlockStatement
complex.js:812:22
-           if (b === 1) {
-             return new Complex(0, Infinity);
-           }
+           if (b === 1) {}

[Survived] ConditionalExpression
complex.js:816:13
-           if (b === -1) {
+           if (true) {

[Survived] ConditionalExpression
complex.js:816:13
-           if (b === -1) {
+           if (false) {

[Survived] UnaryOperator
complex.js:816:19
-           if (b === -1) {
+           if (b === +1) {

[Survived] BlockStatement
complex.js:816:23
-           if (b === -1) {
-             return new Complex(0, -Infinity);
-           }
+           if (b === -1) {}

[Survived] UnaryOperator
complex.js:817:33
-             return new Complex(0, -Infinity);
+             return new Complex(0, +Infinity);

[Survived] BlockStatement
complex.js:835:24
-       'acot': function() {
-         // acot(c) = i / 2 log((c - i) / (c + i))
-         var a = this['re'];
-         var b = this['im'];
-         if (b === 0) {
-           return new Complex(Math.atan2(1, a), 0);
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).atan()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).atan();
-       },
+       'acot': function() {},

[Survived] StringLiteral
complex.js:839:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:840:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:842:11
-         if (b === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:842:11
-         if (b === 0) {
+         if (false) {

[Survived] BlockStatement
complex.js:842:20
-         if (b === 0) {
-           return new Complex(Math.atan2(1, a), 0);
-         }
+         if (b === 0) {}

[Survived] ArithmeticOperator
complex.js:846:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:846:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:846:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:847:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:847:15
-         return (d !== 0)
+         return (false)

[Survived] EqualityOperator
complex.js:847:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:849:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:850:11
-             -b / d).atan()
+             -b * d).atan()

[Survived] UnaryOperator
complex.js:850:11
-             -b / d).atan()
+             +b / d).atan()

[Survived] ConditionalExpression
complex.js:852:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:852:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:852:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:852:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:853:12
-             (b !== 0) ? -b / 0 : 0).atan();
+             (true) ? -b / 0 : 0).atan();

[Survived] ConditionalExpression
complex.js:853:12
-             (b !== 0) ? -b / 0 : 0).atan();
+             (false) ? -b / 0 : 0).atan();

[Survived] EqualityOperator
complex.js:853:12
-             (b !== 0) ? -b / 0 : 0).atan();
+             (b === 0) ? -b / 0 : 0).atan();

[Survived] ArithmeticOperator
complex.js:853:23
-             (b !== 0) ? -b / 0 : 0).atan();
+             (b !== 0) ? -b * 0 : 0).atan();

[Survived] UnaryOperator
complex.js:853:23
-             (b !== 0) ? -b / 0 : 0).atan();
+             (b !== 0) ? +b / 0 : 0).atan();

[Survived] BlockStatement
complex.js:861:24
-       'asec': function() {
-         // asec(c) = -i * log(1 / c + sqrt(1 - i / c^2))
-         var a = this['re'];
-         var b = this['im'];
-         if (a === 0 && b === 0) {
-           return new Complex(0, Infinity);
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).acos()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).acos();
-       },
+       'asec': function() {},

[Survived] StringLiteral
complex.js:865:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:866:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:868:11
-         if (a === 0 && b === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:868:11
-         if (a === 0 && b === 0) {
+         if (false) {

[Survived] ConditionalExpression
complex.js:868:11
-         if (a === 0 && b === 0) {
+         if (true && b === 0) {

[Survived] EqualityOperator
complex.js:868:11
-         if (a === 0 && b === 0) {
+         if (a !== 0 && b === 0) {

[Survived] ConditionalExpression
complex.js:868:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && true) {

[Survived] EqualityOperator
complex.js:868:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && b !== 0) {

[Survived] BlockStatement
complex.js:868:31
-         if (a === 0 && b === 0) {
-           return new Complex(0, Infinity);
-         }
+         if (a === 0 && b === 0) {}

[Survived] ArithmeticOperator
complex.js:872:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:872:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:872:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:873:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:873:15
-         return (d !== 0)
+         return (false)

[Survived] EqualityOperator
complex.js:873:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:875:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:876:11
-             -b / d).acos()
+             -b * d).acos()

[Survived] UnaryOperator
complex.js:876:11
-             -b / d).acos()
+             +b / d).acos()

[Survived] ConditionalExpression
complex.js:878:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:878:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:878:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:878:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:879:12
-             (b !== 0) ? -b / 0 : 0).acos();
+             (true) ? -b / 0 : 0).acos();

[Survived] ConditionalExpression
complex.js:879:12
-             (b !== 0) ? -b / 0 : 0).acos();
+             (false) ? -b / 0 : 0).acos();

[Survived] EqualityOperator
complex.js:879:12
-             (b !== 0) ? -b / 0 : 0).acos();
+             (b === 0) ? -b / 0 : 0).acos();

[Survived] ArithmeticOperator
complex.js:879:23
-             (b !== 0) ? -b / 0 : 0).acos();
+             (b !== 0) ? -b * 0 : 0).acos();

[Survived] UnaryOperator
complex.js:879:23
-             (b !== 0) ? -b / 0 : 0).acos();
+             (b !== 0) ? +b / 0 : 0).acos();

[Survived] BlockStatement
complex.js:887:24
-       'acsc': function() {
-         // acsc(c) = -i * log(i / c + sqrt(1 - 1 / c^2))
-         var a = this['re'];
-         var b = this['im'];
-         if (a === 0 && b === 0) {
-           return new Complex(Math.PI / 2, Infinity);
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).asin()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).asin();
-       },
+       'acsc': function() {},

[Survived] StringLiteral
complex.js:891:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:892:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:894:11
-         if (a === 0 && b === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:894:11
-         if (a === 0 && b === 0) {
+         if (false) {

[Survived] ConditionalExpression
complex.js:894:11
-         if (a === 0 && b === 0) {
+         if (true && b === 0) {

[Survived] EqualityOperator
complex.js:894:11
-         if (a === 0 && b === 0) {
+         if (a !== 0 && b === 0) {

[Survived] ConditionalExpression
complex.js:894:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && true) {

[Survived] EqualityOperator
complex.js:894:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && b !== 0) {

[Survived] BlockStatement
complex.js:894:31
-         if (a === 0 && b === 0) {
-           return new Complex(Math.PI / 2, Infinity);
-         }
+         if (a === 0 && b === 0) {}

[Survived] ArithmeticOperator
complex.js:895:28
-           return new Complex(Math.PI / 2, Infinity);
+           return new Complex(Math.PI * 2, Infinity);

[Survived] ArithmeticOperator
complex.js:898:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:898:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:898:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:899:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:899:15
-         return (d !== 0)
+         return (false)

[Survived] EqualityOperator
complex.js:899:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:901:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:902:11
-             -b / d).asin()
+             -b * d).asin()

[Survived] UnaryOperator
complex.js:902:11
-             -b / d).asin()
+             +b / d).asin()

[Survived] ConditionalExpression
complex.js:904:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:904:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:904:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:904:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:905:12
-             (b !== 0) ? -b / 0 : 0).asin();
+             (true) ? -b / 0 : 0).asin();

[Survived] ConditionalExpression
complex.js:905:12
-             (b !== 0) ? -b / 0 : 0).asin();
+             (false) ? -b / 0 : 0).asin();

[Survived] EqualityOperator
complex.js:905:12
-             (b !== 0) ? -b / 0 : 0).asin();
+             (b === 0) ? -b / 0 : 0).asin();

[Survived] ArithmeticOperator
complex.js:905:23
-             (b !== 0) ? -b / 0 : 0).asin();
+             (b !== 0) ? -b * 0 : 0).asin();

[Survived] UnaryOperator
complex.js:905:23
-             (b !== 0) ? -b / 0 : 0).asin();
+             (b !== 0) ? +b / 0 : 0).asin();

[Survived] ArithmeticOperator
complex.js:951:15
-         var a = 2 * this['re'];
+         var a = 2 / this['re'];

[Survived] BlockStatement
complex.js:983:24
-       'csch': function() {
-         // csch(c) = 2 / (e^c - e^-c)
-         var a = this['re'];
-         var b = this['im'];
-         var d = Math.cos(2 * b) - cosh(2 * a);
-         return new Complex(
-           -2 * sinh(a) * Math.cos(b) / d,
-           2 * cosh(a) * Math.sin(b) / d);
-       },
+       'csch': function() {},

[Survived] StringLiteral
complex.js:987:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:988:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ArithmeticOperator
complex.js:989:15
-         var d = Math.cos(2 * b) - cosh(2 * a);
+         var d = Math.cos(2 * b) + cosh(2 * a);

[Survived] ArithmeticOperator
complex.js:989:24
-         var d = Math.cos(2 * b) - cosh(2 * a);
+         var d = Math.cos(2 / b) - cosh(2 * a);

[Survived] ArithmeticOperator
complex.js:989:38
-         var d = Math.cos(2 * b) - cosh(2 * a);
+         var d = Math.cos(2 * b) - cosh(2 / a);

[Survived] ArithmeticOperator
complex.js:992:9
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 * sinh(a) * Math.cos(b) * d,

[Survived] ArithmeticOperator
complex.js:992:9
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 * sinh(a) / Math.cos(b) / d,

[Survived] ArithmeticOperator
complex.js:992:9
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 / sinh(a) * Math.cos(b) / d,

[Survived] UnaryOperator
complex.js:992:9
-           -2 * sinh(a) * Math.cos(b) / d,
+           +2 * sinh(a) * Math.cos(b) / d,

[Survived] ArithmeticOperator
complex.js:993:9
-           2 * cosh(a) * Math.sin(b) / d);
+           2 * cosh(a) * Math.sin(b) * d);

[Survived] ArithmeticOperator
complex.js:993:9
-           2 * cosh(a) * Math.sin(b) / d);
+           2 * cosh(a) / Math.sin(b) / d);

[Survived] ArithmeticOperator
complex.js:993:9
-           2 * cosh(a) * Math.sin(b) / d);
+           2 / cosh(a) * Math.sin(b) / d);

[Survived] BlockStatement
complex.js:1001:24
-       'sech': function() {
-         // sech(c) = 2 / (e^c + e^-c)
-         var a = this['re'];
-         var b = this['im'];
-         var d = Math.cos(2 * b) + cosh(2 * a);
-         return new Complex(
-           2 * cosh(a) * Math.cos(b) / d,
-           -2 * sinh(a) * Math.sin(b) / d);
-       },
+       'sech': function() {},

[Survived] StringLiteral
complex.js:1005:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:1006:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ArithmeticOperator
complex.js:1007:15
-         var d = Math.cos(2 * b) + cosh(2 * a);
+         var d = Math.cos(2 * b) - cosh(2 * a);

[Survived] ArithmeticOperator
complex.js:1007:24
-         var d = Math.cos(2 * b) + cosh(2 * a);
+         var d = Math.cos(2 / b) + cosh(2 * a);

[Survived] ArithmeticOperator
complex.js:1007:38
-         var d = Math.cos(2 * b) + cosh(2 * a);
+         var d = Math.cos(2 * b) + cosh(2 / a);

[Survived] ArithmeticOperator
complex.js:1010:9
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) * Math.cos(b) * d,

[Survived] ArithmeticOperator
complex.js:1010:9
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) / Math.cos(b) / d,

[Survived] ArithmeticOperator
complex.js:1010:9
-           2 * cosh(a) * Math.cos(b) / d,
+           2 / cosh(a) * Math.cos(b) / d,

[Survived] ArithmeticOperator
complex.js:1011:9
-           -2 * sinh(a) * Math.sin(b) / d);
+           -2 * sinh(a) * Math.sin(b) * d);

[Survived] ArithmeticOperator
complex.js:1011:9
-           -2 * sinh(a) * Math.sin(b) / d);
+           -2 * sinh(a) / Math.sin(b) / d);

[Survived] ArithmeticOperator
complex.js:1011:9
-           -2 * sinh(a) * Math.sin(b) / d);
+           -2 / sinh(a) * Math.sin(b) / d);

[Survived] UnaryOperator
complex.js:1011:9
-           -2 * sinh(a) * Math.sin(b) / d);
+           +2 * sinh(a) * Math.sin(b) / d);

[Survived] BlockStatement
complex.js:1019:25
-       'asinh': function() {
-         // asinh(c) = log(c + sqrt(c^2 + 1))
-         var tmp = this['im'];
-         this['im'] = -this['re'];
-         this['re'] = tmp;
-         var res = this['asin']();
-         this['re'] = -this['im'];
-         this['im'] = tmp;
-         tmp = res['re'];
-         res['re'] = -res['im'];
-         res['im'] = tmp;
-         return res;
-       },
+       'asinh': function() {},

[Survived] StringLiteral
complex.js:1023:22
-         var tmp = this['im'];
+         var tmp = this[""];

[Survived] StringLiteral
complex.js:1024:12
-         this['im'] = -this['re'];
+         this[""] = -this['re'];

[Survived] UnaryOperator
complex.js:1024:20
-         this['im'] = -this['re'];
+         this['im'] = +this['re'];

[Survived] StringLiteral
complex.js:1024:26
-         this['im'] = -this['re'];
+         this['im'] = -this[""];

[Survived] StringLiteral
complex.js:1025:12
-         this['re'] = tmp;
+         this[""] = tmp;

[Survived] StringLiteral
complex.js:1026:22
-         var res = this['asin']();
+         var res = this[""]();

[Survived] StringLiteral
complex.js:1028:12
-         this['re'] = -this['im'];
+         this[""] = -this['im'];

[Survived] UnaryOperator
complex.js:1028:20
-         this['re'] = -this['im'];
+         this['re'] = +this['im'];

[Survived] StringLiteral
complex.js:1028:26
-         this['re'] = -this['im'];
+         this['re'] = -this[""];

[Survived] StringLiteral
complex.js:1029:12
-         this['im'] = tmp;
+         this[""] = tmp;

[Survived] StringLiteral
complex.js:1030:17
-         tmp = res['re'];
+         tmp = res[""];

[Survived] StringLiteral
complex.js:1032:11
-         res['re'] = -res['im'];
+         res[""] = -res['im'];

[Survived] UnaryOperator
complex.js:1032:19
-         res['re'] = -res['im'];
+         res['re'] = +res['im'];

[Survived] StringLiteral
complex.js:1032:24
-         res['re'] = -res['im'];
+         res['re'] = -res[""];

[Survived] StringLiteral
complex.js:1033:11
-         res['im'] = tmp;
+         res[""] = tmp;

[Survived] BlockStatement
complex.js:1042:25
-       'acosh': function() {
-         // acosh(c) = log(c + sqrt(c^2 - 1))
-         var res = this['acos']();
-         if (res['im'] <= 0) {
-           var tmp = res['re'];
-           res['re'] = -res['im'];
-           res['im'] = tmp;
-         } else {
-           var tmp = res['im'];
-           res['im'] = -res['re'];
-           res['re'] = tmp;
-         }
-         return res;
-       },
+       'acosh': function() {},

[Survived] StringLiteral
complex.js:1046:22
-         var res = this['acos']();
+         var res = this[""]();

[Survived] ConditionalExpression
complex.js:1047:11
-         if (res['im'] <= 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:1047:11
-         if (res['im'] <= 0) {
+         if (false) {

[Survived] StringLiteral
complex.js:1047:15
-         if (res['im'] <= 0) {
+         if (res[""] <= 0) {

[Survived] BlockStatement
complex.js:1047:27
-         if (res['im'] <= 0) {
-           var tmp = res['re'];
-           res['re'] = -res['im'];
-           res['im'] = tmp;
-         } else {
+         if (res['im'] <= 0) {} else {

[Survived] StringLiteral
complex.js:1048:23
-           var tmp = res['re'];
+           var tmp = res[""];

[Survived] StringLiteral
complex.js:1049:13
-           res['re'] = -res['im'];
+           res[""] = -res['im'];

[Survived] UnaryOperator
complex.js:1049:21
-           res['re'] = -res['im'];
+           res['re'] = +res['im'];

[Survived] StringLiteral
complex.js:1049:26
-           res['re'] = -res['im'];
+           res['re'] = -res[""];

[Survived] StringLiteral
complex.js:1050:13
-           res['im'] = tmp;
+           res[""] = tmp;

[Survived] BlockStatement
complex.js:1051:14
-         } else {
-           var tmp = res['im'];
-           res['im'] = -res['re'];
-           res['re'] = tmp;
-         }
+         } else {}

[Survived] StringLiteral
complex.js:1052:23
-           var tmp = res['im'];
+           var tmp = res[""];

[Survived] StringLiteral
complex.js:1053:13
-           res['im'] = -res['re'];
+           res[""] = -res['re'];

[Survived] UnaryOperator
complex.js:1053:21
-           res['im'] = -res['re'];
+           res['im'] = +res['re'];

[Survived] StringLiteral
complex.js:1053:26
-           res['im'] = -res['re'];
+           res['im'] = -res[""];

[Survived] StringLiteral
complex.js:1054:13
-           res['re'] = tmp;
+           res[""] = tmp;

[Survived] BlockStatement
complex.js:1064:25
-       'atanh': function() {
-         // atanh(c) = log((1+c) / (1-c)) / 2
-         var a = this['re'];
-         var b = this['im'];
-         var noIM = a > 1 && b === 0;
-         var oneMinus = 1 - a;
-         var onePlus = 1 + a;
-         var d = oneMinus * oneMinus + b * b;
-         var x = (d !== 0)
-           ? new Complex(
-             (onePlus * oneMinus - b * b) / d,
-             (b * oneMinus + onePlus * b) / d)
-           : new Complex(
-             (a !== -1) ? (a / 0) : 0,
-             (b !== 0) ? (b / 0) : 0);
-         var temp = x['re'];
-         x['re'] = logHypot(x['re'], x['im']) / 2;
-         x['im'] = Math.atan2(x['im'], temp) / 2;
-         if (noIM) {
-           x['im'] = -x['im'];
-         }
-         return x;
-       },
+       'atanh': function() {},

[Survived] StringLiteral
complex.js:1068:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:1069:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = true;

[Survived] ConditionalExpression
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = false;

[Survived] LogicalOperator
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = a > 1 || b === 0;

[Survived] ConditionalExpression
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = true && b === 0;

[Survived] EqualityOperator
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = a >= 1 && b === 0;

[Survived] EqualityOperator
complex.js:1071:18
-         var noIM = a > 1 && b === 0;
+         var noIM = a <= 1 && b === 0;

[Survived] ConditionalExpression
complex.js:1071:27
-         var noIM = a > 1 && b === 0;
+         var noIM = a > 1 && true;

[Survived] EqualityOperator
complex.js:1071:27
-         var noIM = a > 1 && b === 0;
+         var noIM = a > 1 && b !== 0;

[Survived] ArithmeticOperator
complex.js:1072:22
-         var oneMinus = 1 - a;
+         var oneMinus = 1 + a;

[Survived] ArithmeticOperator
complex.js:1073:21
-         var onePlus = 1 + a;
+         var onePlus = 1 - a;

[Survived] ArithmeticOperator
complex.js:1074:15
-         var d = oneMinus * oneMinus + b * b;
+         var d = oneMinus * oneMinus - b * b;

[Survived] ArithmeticOperator
complex.js:1074:15
-         var d = oneMinus * oneMinus + b * b;
+         var d = oneMinus / oneMinus + b * b;

[Survived] ArithmeticOperator
complex.js:1074:37
-         var d = oneMinus * oneMinus + b * b;
+         var d = oneMinus * oneMinus + b / b;

[Survived] ConditionalExpression
complex.js:1076:16
-         var x = (d !== 0)
+         var x = (true)

[Survived] ConditionalExpression
complex.js:1076:16
-         var x = (d !== 0)
+         var x = (false)

[Survived] EqualityOperator
complex.js:1076:16
-         var x = (d !== 0)
+         var x = (d === 0)

[Survived] ArithmeticOperator
complex.js:1078:11
-             (onePlus * oneMinus - b * b) / d,
+             (onePlus * oneMinus - b * b) * d,

[Survived] ArithmeticOperator
complex.js:1078:12
-             (onePlus * oneMinus - b * b) / d,
+             (onePlus * oneMinus + b * b) / d,

[Survived] ArithmeticOperator
complex.js:1078:12
-             (onePlus * oneMinus - b * b) / d,
+             (onePlus / oneMinus - b * b) / d,

[Survived] ArithmeticOperator
complex.js:1078:33
-             (onePlus * oneMinus - b * b) / d,
+             (onePlus * oneMinus - b / b) / d,

[Survived] ArithmeticOperator
complex.js:1079:11
-             (b * oneMinus + onePlus * b) / d)
+             (b * oneMinus + onePlus * b) * d)

[Survived] ArithmeticOperator
complex.js:1079:12
-             (b * oneMinus + onePlus * b) / d)
+             (b * oneMinus - onePlus * b) / d)

[Survived] ArithmeticOperator
complex.js:1079:12
-             (b * oneMinus + onePlus * b) / d)
+             (b / oneMinus + onePlus * b) / d)

[Survived] ArithmeticOperator
complex.js:1079:27
-             (b * oneMinus + onePlus * b) / d)
+             (b * oneMinus + onePlus / b) / d)

[Survived] ConditionalExpression
complex.js:1081:12
-             (a !== -1) ? (a / 0) : 0,
+             (true) ? (a / 0) : 0,

[Survived] ConditionalExpression
complex.js:1081:12
-             (a !== -1) ? (a / 0) : 0,
+             (false) ? (a / 0) : 0,

[Survived] EqualityOperator
complex.js:1081:12
-             (a !== -1) ? (a / 0) : 0,
+             (a === -1) ? (a / 0) : 0,

[Survived] UnaryOperator
complex.js:1081:18
-             (a !== -1) ? (a / 0) : 0,
+             (a !== +1) ? (a / 0) : 0,

[Survived] ArithmeticOperator
complex.js:1081:25
-             (a !== -1) ? (a / 0) : 0,
+             (a !== -1) ? (a * 0) : 0,

[Survived] ConditionalExpression
complex.js:1082:12
-             (b !== 0) ? (b / 0) : 0);
+             (true) ? (b / 0) : 0);

[Survived] ConditionalExpression
complex.js:1082:12
-             (b !== 0) ? (b / 0) : 0);
+             (false) ? (b / 0) : 0);

[Survived] EqualityOperator
complex.js:1082:12
-             (b !== 0) ? (b / 0) : 0);
+             (b === 0) ? (b / 0) : 0);

[Survived] ArithmeticOperator
complex.js:1082:24
-             (b !== 0) ? (b / 0) : 0);
+             (b !== 0) ? (b * 0) : 0);

[Survived] StringLiteral
complex.js:1084:20
-         var temp = x['re'];
+         var temp = x[""];

[Survived] StringLiteral
complex.js:1085:9
-         x['re'] = logHypot(x['re'], x['im']) / 2;
+         x[""] = logHypot(x['re'], x['im']) / 2;

[Survived] ArithmeticOperator
complex.js:1085:17
-         x['re'] = logHypot(x['re'], x['im']) / 2;
+         x['re'] = logHypot(x['re'], x['im']) * 2;

[Survived] StringLiteral
complex.js:1085:28
-         x['re'] = logHypot(x['re'], x['im']) / 2;
+         x['re'] = logHypot(x[""], x['im']) / 2;

[Survived] StringLiteral
complex.js:1085:37
-         x['re'] = logHypot(x['re'], x['im']) / 2;
+         x['re'] = logHypot(x['re'], x[""]) / 2;

[Survived] StringLiteral
complex.js:1086:9
-         x['im'] = Math.atan2(x['im'], temp) / 2;
+         x[""] = Math.atan2(x['im'], temp) / 2;

[Survived] ArithmeticOperator
complex.js:1086:17
-         x['im'] = Math.atan2(x['im'], temp) / 2;
+         x['im'] = Math.atan2(x['im'], temp) * 2;

[Survived] StringLiteral
complex.js:1086:30
-         x['im'] = Math.atan2(x['im'], temp) / 2;
+         x['im'] = Math.atan2(x[""], temp) / 2;

[Survived] ConditionalExpression
complex.js:1087:11
-         if (noIM) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:1087:11
-         if (noIM) {
+         if (false) {

[Survived] BlockStatement
complex.js:1087:17
-         if (noIM) {
-           x['im'] = -x['im'];
-         }
+         if (noIM) {}

[Survived] StringLiteral
complex.js:1088:11
-           x['im'] = -x['im'];
+           x[""] = -x['im'];

[Survived] UnaryOperator
complex.js:1088:19
-           x['im'] = -x['im'];
+           x['im'] = +x['im'];

[Survived] StringLiteral
complex.js:1088:22
-           x['im'] = -x['im'];
+           x['im'] = -x[""];

[Survived] BlockStatement
complex.js:1098:25
-       'acoth': function() {
-         // acoth(c) = log((c+1) / (c-1)) / 2
-         var a = this['re'];
-         var b = this['im'];
-         if (a === 0 && b === 0) {
-           return new Complex(0, Math.PI / 2);
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).atanh()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).atanh();
-       },
+       'acoth': function() {},

[Survived] StringLiteral
complex.js:1102:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:1103:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:1105:11
-         if (a === 0 && b === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:1105:11
-         if (a === 0 && b === 0) {
+         if (false) {

[Survived] ConditionalExpression
complex.js:1105:11
-         if (a === 0 && b === 0) {
+         if (true && b === 0) {

[Survived] EqualityOperator
complex.js:1105:11
-         if (a === 0 && b === 0) {
+         if (a !== 0 && b === 0) {

[Survived] ConditionalExpression
complex.js:1105:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && true) {

[Survived] EqualityOperator
complex.js:1105:22
-         if (a === 0 && b === 0) {
+         if (a === 0 && b !== 0) {

[Survived] BlockStatement
complex.js:1105:31
-         if (a === 0 && b === 0) {
-           return new Complex(0, Math.PI / 2);
-         }
+         if (a === 0 && b === 0) {}

[Survived] ArithmeticOperator
complex.js:1106:31
-           return new Complex(0, Math.PI / 2);
+           return new Complex(0, Math.PI * 2);

[Survived] ArithmeticOperator
complex.js:1109:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:1109:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:1109:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:1110:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:1110:15
-         return (d !== 0)
+         return (false)
