[Survived] EqualityOperator
complex.js:1110:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:1112:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:1113:11
-             -b / d).atanh()
+             -b * d).atanh()

[Survived] UnaryOperator
complex.js:1113:11
-             -b / d).atanh()
+             +b / d).atanh()

[Survived] ConditionalExpression
complex.js:1115:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:1115:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:1115:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:1115:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:1116:12
-             (b !== 0) ? -b / 0 : 0).atanh();
+             (true) ? -b / 0 : 0).atanh();

[Survived] ConditionalExpression
complex.js:1116:12
-             (b !== 0) ? -b / 0 : 0).atanh();
+             (false) ? -b / 0 : 0).atanh();

[Survived] EqualityOperator
complex.js:1116:12
-             (b !== 0) ? -b / 0 : 0).atanh();
+             (b === 0) ? -b / 0 : 0).atanh();

[Survived] ArithmeticOperator
complex.js:1116:23
-             (b !== 0) ? -b / 0 : 0).atanh();
+             (b !== 0) ? -b * 0 : 0).atanh();

[Survived] UnaryOperator
complex.js:1116:23
-             (b !== 0) ? -b / 0 : 0).atanh();
+             (b !== 0) ? +b / 0 : 0).atanh();

[Survived] BlockStatement
complex.js:1124:25
-       'acsch': function() {
-         // acsch(c) = log((1+sqrt(1+c^2))/c)
-         var a = this['re'];
-         var b = this['im'];
-         if (b === 0) {
-           return new Complex(
-             (a !== 0)
-               ? Math.log(a + Math.sqrt(a * a + 1))
-               : Infinity, 0);
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).asinh()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).asinh();
-       },
+       'acsch': function() {},

[Survived] StringLiteral
complex.js:1128:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:1129:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:1131:11
-         if (b === 0) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:1131:11
-         if (b === 0) {
+         if (false) {

[Survived] BlockStatement
complex.js:1131:20
-         if (b === 0) {
-           return new Complex(
-             (a !== 0)
-               ? Math.log(a + Math.sqrt(a * a + 1))
-               : Infinity, 0);
-         }
+         if (b === 0) {}

[Survived] ConditionalExpression
complex.js:1134:12
-             (a !== 0)
+             (true)

[Survived] ConditionalExpression
complex.js:1134:12
-             (a !== 0)
+             (false)

[Survived] EqualityOperator
complex.js:1134:12
-             (a !== 0)
+             (a === 0)

[Survived] ArithmeticOperator
complex.js:1135:38
-               ? Math.log(a + Math.sqrt(a * a + 1))
+               ? Math.log(a + Math.sqrt(a / a + 1))

[Survived] ArithmeticOperator
complex.js:1139:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:1139:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:1139:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:1140:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:1140:15
-         return (d !== 0)
+         return (false)

[Survived] EqualityOperator
complex.js:1140:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:1142:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:1143:11
-             -b / d).asinh()
+             -b * d).asinh()

[Survived] UnaryOperator
complex.js:1143:11
-             -b / d).asinh()
+             +b / d).asinh()

[Survived] ConditionalExpression
complex.js:1145:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:1145:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:1145:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:1145:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:1146:12
-             (b !== 0) ? -b / 0 : 0).asinh();
+             (true) ? -b / 0 : 0).asinh();

[Survived] ConditionalExpression
complex.js:1146:12
-             (b !== 0) ? -b / 0 : 0).asinh();
+             (false) ? -b / 0 : 0).asinh();

[Survived] EqualityOperator
complex.js:1146:12
-             (b !== 0) ? -b / 0 : 0).asinh();
+             (b === 0) ? -b / 0 : 0).asinh();

[Survived] ArithmeticOperator
complex.js:1146:23
-             (b !== 0) ? -b / 0 : 0).asinh();
+             (b !== 0) ? -b * 0 : 0).asinh();

[Survived] UnaryOperator
complex.js:1146:23
-             (b !== 0) ? -b / 0 : 0).asinh();
+             (b !== 0) ? +b / 0 : 0).asinh();

[Survived] BlockStatement
complex.js:1154:25
-       'asech': function() {
-         // asech(c) = log((1+sqrt(1-c^2))/c)
-         var a = this['re'];
-         var b = this['im'];
-         if (this['isZero']()) {
-           return Complex['INFINITY'];
-         }
-         var d = a * a + b * b;
-         return (d !== 0)
-           ? new Complex(
-             a / d,
-             -b / d).acosh()
-           : new Complex(
-             (a !== 0) ? a / 0 : 0,
-             (b !== 0) ? -b / 0 : 0).acosh();
-       },
+       'asech': function() {},

[Survived] StringLiteral
complex.js:1158:20
-         var a = this['re'];
+         var a = this[""];

[Survived] StringLiteral
complex.js:1159:20
-         var b = this['im'];
+         var b = this[""];

[Survived] ConditionalExpression
complex.js:1161:11
-         if (this['isZero']()) {
+         if (true) {

[Survived] ConditionalExpression
complex.js:1161:11
-         if (this['isZero']()) {
+         if (false) {

[Survived] StringLiteral
complex.js:1161:16
-         if (this['isZero']()) {
+         if (this[""]()) {

[Survived] BlockStatement
complex.js:1161:29
-         if (this['isZero']()) {
-           return Complex['INFINITY'];
-         }
+         if (this['isZero']()) {}

[Survived] StringLiteral
complex.js:1162:24
-           return Complex['INFINITY'];
+           return Complex[""];

[Survived] ArithmeticOperator
complex.js:1165:15
-         var d = a * a + b * b;
+         var d = a * a - b * b;

[Survived] ArithmeticOperator
complex.js:1165:15
-         var d = a * a + b * b;
+         var d = a / a + b * b;

[Survived] ArithmeticOperator
complex.js:1165:23
-         var d = a * a + b * b;
+         var d = a * a + b / b;

[Survived] ConditionalExpression
complex.js:1166:15
-         return (d !== 0)
+         return (true)

[Survived] ConditionalExpression
complex.js:1166:15
-         return (d !== 0)
+         return (false)

[Survived] EqualityOperator
complex.js:1166:15
-         return (d !== 0)
+         return (d === 0)

[Survived] ArithmeticOperator
complex.js:1168:11
-             a / d,
+             a * d,

[Survived] ArithmeticOperator
complex.js:1169:11
-             -b / d).acosh()
+             -b * d).acosh()

[Survived] UnaryOperator
complex.js:1169:11
-             -b / d).acosh()
+             +b / d).acosh()

[Survived] ConditionalExpression
complex.js:1171:12
-             (a !== 0) ? a / 0 : 0,
+             (true) ? a / 0 : 0,

[Survived] ConditionalExpression
complex.js:1171:12
-             (a !== 0) ? a / 0 : 0,
+             (false) ? a / 0 : 0,

[Survived] EqualityOperator
complex.js:1171:12
-             (a !== 0) ? a / 0 : 0,
+             (a === 0) ? a / 0 : 0,

[Survived] ArithmeticOperator
complex.js:1171:23
-             (a !== 0) ? a / 0 : 0,
+             (a !== 0) ? a * 0 : 0,

[Survived] ConditionalExpression
complex.js:1172:12
-             (b !== 0) ? -b / 0 : 0).acosh();
+             (true) ? -b / 0 : 0).acosh();

[Survived] ConditionalExpression
complex.js:1172:12
-             (b !== 0) ? -b / 0 : 0).acosh();
+             (false) ? -b / 0 : 0).acosh();

[Survived] EqualityOperator
complex.js:1172:12
-             (b !== 0) ? -b / 0 : 0).acosh();
+             (b === 0) ? -b / 0 : 0).acosh();

[Survived] ArithmeticOperator
complex.js:1172:23
-             (b !== 0) ? -b / 0 : 0).acosh();
+             (b !== 0) ? -b * 0 : 0).acosh();

[Survived] UnaryOperator
complex.js:1172:23
-             (b !== 0) ? -b / 0 : 0).acosh();
+             (b !== 0) ? +b / 0 : 0).acosh();

[Survived] BlockStatement
complex.js:1224:30
-       'ceil': function(places) {
-         places = Math.pow(10, places || 0);
-         return new Complex(
-           Math.ceil(this['re'] * places) / places,
-           Math.ceil(this['im'] * places) / places);
-       },
+       'ceil': function(places) {},

[Survived] ConditionalExpression
complex.js:1226:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, true);

[Survived] ConditionalExpression
complex.js:1226:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, false);

[Survived] ArithmeticOperator
complex.js:1229:9
-           Math.ceil(this['re'] * places) / places,
+           Math.ceil(this['re'] * places) * places,

[Survived] StringLiteral
complex.js:1229:24
-           Math.ceil(this['re'] * places) / places,
+           Math.ceil(this[""] * places) / places,

[Survived] ArithmeticOperator
complex.js:1230:9
-           Math.ceil(this['im'] * places) / places);
+           Math.ceil(this['im'] * places) * places);

[Survived] ArithmeticOperator
complex.js:1230:19
-           Math.ceil(this['im'] * places) / places);
+           Math.ceil(this['im'] / places) / places);

[Survived] StringLiteral
complex.js:1230:24
-           Math.ceil(this['im'] * places) / places);
+           Math.ceil(this[""] * places) / places);

[Survived] BlockStatement
complex.js:1238:31
-       'floor': function(places) {
-         places = Math.pow(10, places || 0);
-         return new Complex(
-           Math.floor(this['re'] * places) / places,
-           Math.floor(this['im'] * places) / places);
-       },
+       'floor': function(places) {},

[Survived] ConditionalExpression
complex.js:1240:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, true);

[Survived] ConditionalExpression
complex.js:1240:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, false);

[Survived] ArithmeticOperator
complex.js:1243:9
-           Math.floor(this['re'] * places) / places,
+           Math.floor(this['re'] * places) * places,

[Survived] StringLiteral
complex.js:1243:25
-           Math.floor(this['re'] * places) / places,
+           Math.floor(this[""] * places) / places,

[Survived] ArithmeticOperator
complex.js:1244:9
-           Math.floor(this['im'] * places) / places);
+           Math.floor(this['im'] * places) * places);

[Survived] StringLiteral
complex.js:1244:25
-           Math.floor(this['im'] * places) / places);
+           Math.floor(this[""] * places) / places);

[Survived] ConditionalExpression
complex.js:1254:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, true);

[Survived] ConditionalExpression
complex.js:1272:14
-         return Math.abs(z['re'] - this['re']) <= Complex['EPSILON'] &&
+         return true &&

[Survived] EqualityOperator
complex.js:1272:14
-         return Math.abs(z['re'] - this['re']) <= Complex['EPSILON'] &&
+         return Math.abs(z['re'] - this['re']) < Complex['EPSILON'] &&

[Survived] EqualityOperator
complex.js:1273:9
-           Math.abs(z['im'] - this['im']) <= Complex['EPSILON'];
+           Math.abs(z['im'] - this['im']) < Complex['EPSILON'];

[Survived] BlockStatement
complex.js:1281:25
-       'clone': function() {
-         return new Complex(this['re'], this['im']);
-       },
+       'clone': function() {},

[Survived] StringLiteral
complex.js:1283:31
-         return new Complex(this['re'], this['im']);
+         return new Complex(this[""], this['im']);

[Survived] StringLiteral
complex.js:1283:43
-         return new Complex(this['re'], this['im']);
+         return new Complex(this['re'], this[""]);

[Survived] BlockStatement
complex.js:1344:28
-       'toVector': function() {
-         return [this['re'], this['im']];
-       },
+       'toVector': function() {},

[Survived] ArrayDeclaration
complex.js:1346:14
-         return [this['re'], this['im']];
+         return [];

[Survived] StringLiteral
complex.js:1346:20
-         return [this['re'], this['im']];
+         return [this[""], this['im']];

[Survived] StringLiteral
complex.js:1346:32
-         return [this['re'], this['im']];
+         return [this['re'], this[""]];

[Survived] ConditionalExpression
complex.js:1356:11
-         if (this['im'] === 0) {
+         if (true) {

[Survived] LogicalOperator
complex.js:1368:14
-         return isNaN(this['re']) || isNaN(this['im']);
+         return isNaN(this['re']) && isNaN(this['im']);

[Survived] StringLiteral
complex.js:1405:11
-     Complex['PI'] = new Complex(Math.PI, 0);
+     Complex[""] = new Complex(Math.PI, 0);

[Survived] ConditionalExpression
complex.js:1411:7
-     if (typeof define === 'function' && define['amd']) {
+     if (false) {

[Survived] StringLiteral
complex.js:1411:25
-     if (typeof define === 'function' && define['amd']) {
+     if (typeof define === "" && define['amd']) {

[Survived] StringLiteral
complex.js:1411:46
-     if (typeof define === 'function' && define['amd']) {
+     if (typeof define === 'function' && define[""]) {

[Survived] BlockStatement
complex.js:1411:54
-     if (typeof define === 'function' && define['amd']) {
-       define([], function() {
-         return Complex;
-       });
-     } else if (typeof exports === 'object') {
+     if (typeof define === 'function' && define['amd']) {} else if (typeof exports === 'object') {

[Survived] ArrayDeclaration
complex.js:1412:12
-       define([], function() {
+       define(["Stryker was here"], function() {

[Survived] BlockStatement
complex.js:1412:27
-       define([], function() {
-         return Complex;
-       });
+       define([], function() {});

[Survived] StringLiteral
complex.js:1416:36
-       Object.defineProperty(Complex, "__esModule", { 'value': true });
+       Object.defineProperty(Complex, "", { 'value': true });

[Survived] ObjectLiteral
complex.js:1416:50
-       Object.defineProperty(Complex, "__esModule", { 'value': true });
+       Object.defineProperty(Complex, "__esModule", {});

[Survived] BooleanLiteral
complex.js:1416:61
-       Object.defineProperty(Complex, "__esModule", { 'value': true });
+       Object.defineProperty(Complex, "__esModule", { 'value': false });

[Survived] StringLiteral
complex.js:1417:13
-       Complex['default'] = Complex;
+       Complex[""] = Complex;

[Survived] StringLiteral
complex.js:1418:13
-       Complex['Complex'] = Complex;
+       Complex[""] = Complex;

[Survived] BlockStatement
complex.js:1420:10
-     } else {
-       root['Complex'] = Complex;
-     }
+     } else {}

[Survived] StringLiteral
complex.js:1421:10
-       root['Complex'] = Complex;
+       root[""] = Complex;
