[Survived] ConditionalExpression
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (false) {

[Survived] BlockStatement
src/AttributeMap.ts:14:32
-       if (typeof a !== 'object') {
-         a = {};
-       }
+       if (typeof a !== 'object') {}

[Survived] ConditionalExpression
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (false) {

[Survived] BlockStatement
src/AttributeMap.ts:17:32
-       if (typeof b !== 'object') {
-         b = {};
-       }
+       if (typeof b !== 'object') {}

[Survived] ConditionalExpression
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (true && b[key] === undefined) {

[Survived] ConditionalExpression
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (false) {

[Survived] BlockStatement
src/AttributeMap.ts:41:32
-       if (typeof a !== 'object') {
-         a = {};
-       }
+       if (typeof a !== 'object') {}

[Survived] ConditionalExpression
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (false) {

[Survived] BlockStatement
src/AttributeMap.ts:44:32
-       if (typeof b !== 'object') {
-         b = {};
-       }
+       if (typeof b !== 'object') {}

[Survived] ConditionalExpression
src/AttributeMap.ts:70:11
-         if (attr[key] !== base[key] && base[key] === undefined) {
+         if (true && base[key] === undefined) {

[Survived] BooleanLiteral
src/AttributeMap.ts:80:16
-       priority = false,
+       priority = true,

[Survived] ConditionalExpression
src/AttributeMap.ts:97:12
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return true ? attributes : undefined;

[Survived] EqualityOperator
src/AttributeMap.ts:97:12
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(attributes).length >= 0 ? attributes : undefined;

[Survived] ConditionalExpression
src/Delta.ts:20:32
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' || false) {

[Survived] ConditionalExpression
src/Delta.ts:23:32
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b !== 'object' || false) {

[Survived] BlockStatement
src/Delta.ts:45:51
-     static unregisterEmbed(embedType: string): void {
-       delete this.handlers[embedType];
-     }
+     static unregisterEmbed(embedType: string): void {}

[Survived] ConditionalExpression
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (true && arg.length === 0) {

[Survived] ConditionalExpression
src/Delta.ts:80:7
-         typeof attributes === 'object' &&
+         true &&

[Survived] ConditionalExpression
src/Delta.ts:99:9
-       if (typeof length === 'number' && length <= 0) {
+       if (true && length <= 0) {

[Survived] ConditionalExpression
src/Delta.ts:105:7
-         typeof attributes === 'object' &&
+         true &&

[Survived] ConditionalExpression
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (false) {

[Survived] ConditionalExpression
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         false

[Survived] ConditionalExpression
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
+         true &&

[Survived] LogicalOperator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
+         firstOther != null || typeof firstOther.retain === 'number' &&

[Survived] ConditionalExpression
src/Delta.ts:242:7
-         firstOther != null &&
+         true &&

[Survived] EqualityOperator
src/Delta.ts:242:7
-         firstOther != null &&
+         firstOther == null &&

[Survived] ConditionalExpression
src/Delta.ts:243:7
-         typeof firstOther.retain === 'number' &&
+         true &&

[Survived] EqualityOperator
src/Delta.ts:243:7
-         typeof firstOther.retain === 'number' &&
+         typeof firstOther.retain !== 'number' &&

[Survived] StringLiteral
src/Delta.ts:243:36
-         typeof firstOther.retain === 'number' &&
+         typeof firstOther.retain === "" &&

[Survived] BlockStatement
src/Delta.ts:245:7
-       ) {
-         let firstLeft = firstOther.retain;
-         while (
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
-         ) {
-           firstLeft -= thisIter.peekLength();
-           ops.push(thisIter.next());
-         }
-         if (firstOther.retain - firstLeft > 0) {
-           otherIter.next(firstOther.retain - firstLeft);
-         }
-       }
+       ) {}

[Survived] ConditionalExpression
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           false

[Survived] ConditionalExpression
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
+           true &&

[Survived] EqualityOperator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
+           thisIter.peekType() !== 'insert' &&

[Survived] StringLiteral
src/Delta.ts:248:33
-           thisIter.peekType() === 'insert' &&
+           thisIter.peekType() === "" &&

[Survived] EqualityOperator
src/Delta.ts:249:9
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekLength() < firstLeft

[Survived] ConditionalExpression
src/Delta.ts:281:30
-                 const action = thisOp.retain == null ? 'insert' : 'retain';
+                 const action = true ? 'insert' : 'retain';

[Survived] StringLiteral
src/Delta.ts:281:65
-                 const action = thisOp.retain == null ? 'insert' : 'retain';
+                 const action = thisOp.retain == null ? 'insert' : "";

[Survived] ConditionalExpression
src/Delta.ts:291:19
-                     action === 'retain',
+                     true,

[Survived] ConditionalExpression
src/Delta.ts:291:19
-                     action === 'retain',
+                     false,

[Survived] EqualityOperator
src/Delta.ts:291:19
-                     action === 'retain',
+                     action !== 'retain',

[Survived] StringLiteral
src/Delta.ts:291:30
-                     action === 'retain',
+                     action === "",

[Survived] ConditionalExpression
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               false

[Survived] ArithmeticOperator
src/Delta.ts:310:31
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length + 1], newOp)

[Survived] BlockStatement
src/Delta.ts:311:13
-             ) {
-               const rest = new Delta(thisIter.rest());
-               return delta.concat(rest).chop();
-             }
+             ) {}

[Survived] ConditionalExpression
src/Delta.ts:319:11
-             typeof otherOp.delete === 'number' &&
+             true &&

[Survived] ConditionalExpression
src/Delta.ts:321:51
-               (typeof thisOp.retain === 'object' && thisOp.retain !== null))
+               (typeof thisOp.retain === 'object' && true))

[Survived] ConditionalExpression
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (false) {

[Survived] BlockStatement
src/Delta.ts:340:33
-       if (this.ops === other.ops) {
-         return new Delta();
-       }
+       if (this.ops === other.ops) {}

[Survived] ConditionalExpression
src/Delta.ts:349:24
-             const prep = delta === other ? 'on' : 'with';
+             const prep = true ? 'on' : 'with';

[Survived] StringLiteral
src/Delta.ts:349:49
-             const prep = delta === other ? 'on' : 'with';
+             const prep = delta === other ? 'on' : "";

[Survived] MethodExpression
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.max(otherIter.peekLength(), length);

[Survived] UnaryOperator
src/Delta.ts:416:13
-             : -1;
+             : +1;

[Survived] ConditionalExpression
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (true) {

[Survived] LogicalOperator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain || op.attributes) {

[Survived] ConditionalExpression
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (true) {

[Survived] LogicalOperator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (typeof op.retain === 'object' || op.retain !== null) {

[Survived] ConditionalExpression
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (true && op.retain !== null) {

[Survived] ConditionalExpression
src/Delta.ts:456:51
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (typeof op.retain === 'object' && true) {

[Survived] BlockStatement
src/Delta.ts:498:28
-           if (thisOp.delete) {
-             // Our delete either makes their delete redundant or removes their retain
-             continue;
-           } else if (otherOp.delete) {
+           if (thisOp.delete) {} else if (otherOp.delete) {

[Survived] ConditionalExpression
src/Delta.ts:507:13
-               typeof otherData === 'object' && otherData !== null
+               true

[Survived] LogicalOperator
src/Delta.ts:507:13
-               typeof otherData === 'object' && otherData !== null
+               typeof otherData === 'object' || otherData !== null

[Survived] ConditionalExpression
src/Delta.ts:507:13
-               typeof otherData === 'object' && otherData !== null
+               true && otherData !== null

[Survived] ConditionalExpression
src/Delta.ts:507:46
-               typeof otherData === 'object' && otherData !== null
+               typeof otherData === 'object' && true

[Survived] LogicalOperator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
+               typeof thisData === 'object' && thisData !== null || typeof otherData === 'object' &&

[Survived] ConditionalExpression
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
+               true &&

[Survived] LogicalOperator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
+               typeof thisData === 'object' || thisData !== null &&

[Survived] ConditionalExpression
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
+               true &&

[Survived] ConditionalExpression
src/Delta.ts:512:13
-               thisData !== null &&
+               true &&

[Survived] ConditionalExpression
src/Delta.ts:513:13
-               typeof otherData === 'object' &&
+               true &&

[Survived] ConditionalExpression
src/Delta.ts:514:13
-               otherData !== null
+               true

[Survived] ConditionalExpression
src/Delta.ts:517:17
-               if (embedType === Object.keys(otherData)[0]) {
+               if (true) {

[Survived] ConditionalExpression
src/Delta.ts:519:19
-                 if (handler) {
+                 if (true) {

[Survived] BooleanLiteral
src/Delta.ts:546:47
-     transformPosition(index: number, priority = false): number {
+     transformPosition(index: number, priority = true): number {

[Survived] ConditionalExpression
src/Delta.ts:557:44
-         } else if (nextType === 'insert' && (offset < index || !priority)) {
+         } else if (nextType === 'insert' && (false || !priority)) {

[Survived] ConditionalExpression
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (true) {

[Survived] ConditionalExpression
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (false) {

[Survived] EqualityOperator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module !== 'object') {

[Survived] StringLiteral
src/Delta.ts:570:23
-   if (typeof module === 'object') {
+   if (typeof module === "") {

[Survived] BlockStatement
src/Delta.ts:570:33
-   if (typeof module === 'object') {
-     module.exports = Delta;
-     module.exports.default = Delta;
-   }
+   if (typeof module === 'object') {}

[Survived] ConditionalExpression
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (false) {

[Survived] StringLiteral
src/Op.ts:18:37
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === "" && op.retain !== null) {

[Survived] ConditionalExpression
src/Op.ts:18:49
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'object' && true) {

[Survived] EqualityOperator
src/Op.ts:18:49
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'object' && op.retain === null) {

[Survived] ConditionalExpression
src/OpIterator.ts:44:11
-             nextOp.retain !== null
+             true

[Survived] ConditionalExpression
src/OpIterator.ts:81:43
-           (typeof op.retain === 'object' && op.retain !== null)
+           (typeof op.retain === 'object' && true)

[Survived] BlockStatement
src/OpIterator.ts:82:9
-         ) {
-           return 'retain';
-         } else {
+         ) {} else {

[Survived] ConditionalExpression
src/OpIterator.ts:92:9
-       if (!this.hasNext()) {
+       if (false) {

[Survived] ConditionalExpression
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (false) {
