[Survived] StringLiteral
lib/request.js:13:26
-           reject(new Error('Request Failed.\n' +
+           reject(new Error("" +

[Survived] StringLiteral
lib/request.js:14:26
-                            `Status Code: ${res.statusCode}`));
+                            ``));

[Survived] StringLiteral
lib/request.js:20:13
-           .on('error', reject)
+           .on("", reject)

[Survived] StringLiteral
lib/request.js:24:9
-       .on('error', reject);
+       .on("", reject);

[Survived] StringLiteral
lib/TimeoutError.js:3:11
-       super('TimeoutError');
+       super("");

[Survived] StringLiteral
index.js:6:37
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error(""));

[Survived] StringLiteral
index.js:10:37
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error(""));

[Survived] ConditionalExpression
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (true) {

[Survived] ConditionalExpression
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (false) {

[Survived] BlockStatement
index.js:24:39
-     if (!path.isAbsolute(options.dest)) {
-       options.dest = path.resolve(__dirname, options.dest);
-     }
+     if (!path.isAbsolute(options.dest)) {}
