[Survived] BlockStatement
index.js:4:13
-   } catch (_) {
-     _fs = require('fs')
-   }
+   } catch (_) {}

[Survived] ObjectLiteral
index.js:12:15
-       options = { encoding: options }
+       options = {}

[Survived] ObjectLiteral
index.js:42:15
-       options = { encoding: options }
+       options = {}

[Survived] ConditionalExpression
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (true) content = content.toString('utf8')
