[Survived] ArrayDeclaration
index.js:3:13
-   var rules = []
+   var rules = ["Stryker was here"]

[Survived] Regex
index.js:16:9
-   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+   addRule(/[^aeiou]y|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })

[Survived] Regex
index.js:16:9
-   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+   addRule(/[^aeiou]y$|quy/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })

[Survived] Regex
index.js:19:9
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x|ch$|s$/i, function(w) { return w + 'es' })

[Survived] Regex
index.js:27:9
-   addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
+   addRule(/[aeiouy]o/i, function(w) { return w + 's' });

[Survived] ConditionalExpression
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if (false) {

[Survived] ConditionalExpression
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if (false || w === 'roof') {

[Survived] StringLiteral
index.js:33:13
-     if (w === 'dwarf' || w === 'roof') {
+     if (w === "" || w === 'roof') {

[Survived] ConditionalExpression
index.js:33:24
-     if (w === 'dwarf' || w === 'roof') {
+     if (w === 'dwarf' || false) {

[Survived] StringLiteral
index.js:33:30
-     if (w === 'dwarf' || w === 'roof') {
+     if (w === 'dwarf' || w === "") {

[Survived] BlockStatement
index.js:33:38
-     if (w === 'dwarf' || w === 'roof') {
-       return w + 's'
-     }
+     if (w === 'dwarf' || w === 'roof') {}

[Survived] StringLiteral
index.js:34:16
-       return w + 's'
+       return w + ""

[Survived] StringLiteral
index.js:40:9
-   addRule('bacterium', 'bacteria')
+   addRule("", 'bacteria')

[Survived] StringLiteral
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', "")

[Survived] StringLiteral
index.js:42:9
-   addRule('cello', 'cellos')
+   addRule("", 'cellos')

[Survived] StringLiteral
index.js:42:18
-   addRule('cello', 'cellos')
+   addRule('cello', "")

[Survived] Regex
index.js:49:9
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?man/i, function(w) { return w.replace(/a/, 'e') })

[Survived] StringLiteral
index.js:60:45
-     'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
+     'alm', 'fece', 'bowel', 'sud', 'entrail', "", 'outskirt', 'odd', 'tropic',

[Survived] StringLiteral
index.js:60:78
-     'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
+     'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', "",

[Survived] StringLiteral
index.js:61:36
-     'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
+     'riche', 'surrounding', 'thank', "", 'remain', 'amend'

[Survived] Regex
index.js:67:9
-   addRule(/ics$/i, function(w) { return w })
+   addRule(/ics/i, function(w) { return w })

[Survived] LogicalOperator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 && num === undefined) {

[Survived] ConditionalExpression
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (false || num === undefined) {

[Survived] ConditionalExpression
index.js:76:20
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || false) {

[Survived] EqualityOperator
index.js:76:20
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || num !== undefined) {

[Survived] ConditionalExpression
index.js:81:16
-           return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
+           return true ? rule[1](word, rule[0]) : rule[1]

[Survived] ConditionalExpression
index.js:83:11
-         if (type(rule[0]) === 'String' && rule[0] === word) {
+         if (true && rule[0] === word) {

[Survived] ConditionalExpression
index.js:84:16
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return false ? rule[1](word) : rule[1]

[Survived] StringLiteral
index.js:84:34
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(rule[1]) === "" ? rule[1](word) : rule[1]

[Survived] BlockStatement
index.js:104:45
-       String.prototype.plural = function(num) {
-         return plural(this, num)
-       }
+       String.prototype.plural = function(num) {}

[Survived] BlockStatement
index.js:108:8
-     else {
-       throw new Error('Unable to add plural function to String object')
-     }
+     else {}

[Survived] StringLiteral
index.js:109:21
-       throw new Error('Unable to add plural function to String object')
+       throw new Error("")
