[Survived] ConditionalExpression
q.js:38:9
-       if (typeof bootstrap === "function") {
+       if (false) {

[Survived] StringLiteral
q.js:38:30
-       if (typeof bootstrap === "function") {
+       if (typeof bootstrap === "") {

[Survived] BlockStatement
q.js:38:42
-       if (typeof bootstrap === "function") {
-           bootstrap("promise", definition);
-       // CommonJS
-       } else if (typeof exports === "object" && typeof module === "object") {
+       if (typeof bootstrap === "function") {} else if (typeof exports === "object" && typeof module === "object") {

[Survived] StringLiteral
q.js:39:19
-           bootstrap("promise", definition);
+           bootstrap("", definition);

[Survived] ConditionalExpression
q.js:42:16
-       } else if (typeof exports === "object" && typeof module === "object") {
+       } else if (true) {

[Survived] LogicalOperator
q.js:42:16
-       } else if (typeof exports === "object" && typeof module === "object") {
+       } else if (typeof exports === "object" || typeof module === "object") {

[Survived] ConditionalExpression
q.js:42:16
-       } else if (typeof exports === "object" && typeof module === "object") {
+       } else if (true && typeof module === "object") {

[Survived] ConditionalExpression
q.js:42:47
-       } else if (typeof exports === "object" && typeof module === "object") {
+       } else if (typeof exports === "object" && true) {

[Survived] ConditionalExpression
q.js:46:16
-       } else if (typeof define === "function" && define.amd) {
+       } else if (true) {

[Survived] ConditionalExpression
q.js:46:16
-       } else if (typeof define === "function" && define.amd) {
+       } else if (false) {

[Survived] LogicalOperator
q.js:46:16
-       } else if (typeof define === "function" && define.amd) {
+       } else if (typeof define === "function" || define.amd) {

[Survived] ConditionalExpression
q.js:46:16
-       } else if (typeof define === "function" && define.amd) {
+       } else if (true && define.amd) {

[Survived] StringLiteral
q.js:46:34
-       } else if (typeof define === "function" && define.amd) {
+       } else if (typeof define === "" && define.amd) {

[Survived] BlockStatement
q.js:46:60
-       } else if (typeof define === "function" && define.amd) {
-           define(definition);
-       // SES (Secure EcmaScript)
-       } else if (typeof ses !== "undefined") {
+       } else if (typeof define === "function" && define.amd) {} else if (typeof ses !== "undefined") {

[Survived] ConditionalExpression
q.js:50:16
-       } else if (typeof ses !== "undefined") {
+       } else if (true) {

[Survived] ConditionalExpression
q.js:50:16
-       } else if (typeof ses !== "undefined") {
+       } else if (false) {

[Survived] StringLiteral
q.js:50:31
-       } else if (typeof ses !== "undefined") {
+       } else if (typeof ses !== "") {

[Survived] BlockStatement
q.js:50:44
-       } else if (typeof ses !== "undefined") {
-           if (!ses.ok()) {
-               return;
-           } else {
-               ses.makeQ = definition;
-           }
-       // <script>
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof ses !== "undefined") {} else if (typeof window !== "undefined" || typeof self !== "undefined") {

[Survived] ConditionalExpression
q.js:51:13
-           if (!ses.ok()) {
+           if (true) {

[Survived] ConditionalExpression
q.js:51:13
-           if (!ses.ok()) {
+           if (false) {

[Survived] BlockStatement
q.js:51:24
-           if (!ses.ok()) {
-               return;
-           } else {
+           if (!ses.ok()) {} else {

[Survived] BlockStatement
q.js:53:16
-           } else {
-               ses.makeQ = definition;
-           }
+           } else {}

[Survived] ConditionalExpression
q.js:58:16
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (true) {

[Survived] ConditionalExpression
q.js:58:16
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (false) {

[Survived] ConditionalExpression
q.js:58:16
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (false || typeof self !== "undefined") {

[Survived] EqualityOperator
q.js:58:16
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof window === "undefined" || typeof self !== "undefined") {

[Survived] StringLiteral
q.js:58:34
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof window !== "" || typeof self !== "undefined") {

[Survived] ConditionalExpression
q.js:58:49
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof window !== "undefined" || false) {

[Survived] EqualityOperator
q.js:58:49
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof window !== "undefined" || typeof self === "undefined") {

[Survived] StringLiteral
q.js:58:65
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+       } else if (typeof window !== "undefined" || typeof self !== "") {

[Survived] BlockStatement
q.js:58:78
-       } else if (typeof window !== "undefined" || typeof self !== "undefined") {
-           // Prefer window over self for add-on scripts. Use self for
-           // non-windowed contexts.
-           var global = typeof window !== "undefined" ? window : self;
-           // Get the `window` object, save the previous Q global
-           // and initialize Q as a global.
-           var previousQ = global.Q;
-           global.Q = definition();
-           // Add a noConflict function so Q can be removed from the
-           // global namespace.
-           global.Q.noConflict = function () {
-               global.Q = previousQ;
-               return this;
-           };
-       } else {
+       } else if (typeof window !== "undefined" || typeof self !== "undefined") {} else {

[Survived] ConditionalExpression
q.js:61:22
-           var global = typeof window !== "undefined" ? window : self;
+           var global = true ? window : self;

[Survived] ConditionalExpression
q.js:61:22
-           var global = typeof window !== "undefined" ? window : self;
+           var global = false ? window : self;

[Survived] EqualityOperator
q.js:61:22
-           var global = typeof window !== "undefined" ? window : self;
+           var global = typeof window === "undefined" ? window : self;

[Survived] StringLiteral
q.js:61:40
-           var global = typeof window !== "undefined" ? window : self;
+           var global = typeof window !== "" ? window : self;

[Survived] BlockStatement
q.js:70:43
-           global.Q.noConflict = function () {
-               global.Q = previousQ;
-               return this;
-           };
+           global.Q.noConflict = function () {};

[Survived] BlockStatement
q.js:75:12
-       } else {
-           throw new Error("This environment was not anticipated by Q. Please file a bug.");
-       }
+       } else {}

[Survived] StringLiteral
q.js:76:25
-           throw new Error("This environment was not anticipated by Q. Please file a bug.");
+           throw new Error("");

[Survived] BooleanLiteral
q.js:82:17
-   var hasStacks = false;
+   var hasStacks = true;

[Survived] BlockStatement
q.js:83:5
-   try {
-       throw new Error();
-   } catch (e) {
+   try {} catch (e) {

[Survived] BlockStatement
q.js:85:13
-   } catch (e) {
-       hasStacks = !!e.stack;
-   }
+   } catch (e) {}

[Survived] BooleanLiteral
q.js:86:17
-       hasStacks = !!e.stack;
+       hasStacks = !e.stack;

[Survived] BooleanLiteral
q.js:86:18
-       hasStacks = !!e.stack;
+       hasStacks = !e.stack;

[Survived] ObjectLiteral
q.js:103:16
-       var head = {task: void 0, next: null};
+       var head = {};

[Survived] BooleanLiteral
q.js:107:20
-       var isNodeJS = false;
+       var isNodeJS = true;

[Survived] ArrayDeclaration
q.js:109:22
-       var laterQueue = [];
+       var laterQueue = ["Stryker was here"];

[Survived] ConditionalExpression
q.js:121:17
-               if (domain) {
+               if (false) {

[Survived] BlockStatement
q.js:121:25
-               if (domain) {
-                   head.domain = void 0;
-                   domain.enter();
-               }
+               if (domain) {}

[Survived] ConditionalExpression
q.js:128:16
-           while (laterQueue.length) {
+           while (false) {

[Survived] BlockStatement
q.js:139:21
-           } catch (e) {
-               if (isNodeJS) {
-                   // In node, uncaught exceptions are considered fatal errors.
-                   // Re-throw them synchronously to interrupt flushing!
-                   // Ensure continuation if the uncaught exception is suppressed
-                   // listening "uncaughtException" events (as domains does).
-                   // Continue in next event to avoid tick recursion.
-                   if (domain) {
-                       domain.exit();
-                   }
-                   setTimeout(flush, 0);
-                   if (domain) {
-                       domain.enter();
-                   }
-                   throw e;
-               } else {
-                   // In browsers, uncaught exceptions are not fatal.
-                   // Re-throw them asynchronously to avoid slow-downs.
-                   setTimeout(function () {
-                       throw e;
-                   }, 0);
-               }
-           }
+           } catch (e) {}

[Survived] BlockStatement
q.js:140:27
-               if (isNodeJS) {
-                   // In node, uncaught exceptions are considered fatal errors.
-                   // Re-throw them synchronously to interrupt flushing!
-                   // Ensure continuation if the uncaught exception is suppressed
-                   // listening "uncaughtException" events (as domains does).
-                   // Continue in next event to avoid tick recursion.
-                   if (domain) {
-                       domain.exit();
-                   }
-                   setTimeout(flush, 0);
-                   if (domain) {
-                       domain.enter();
-                   }
-                   throw e;
-               } else {
+               if (isNodeJS) {} else {

[Survived] BlockStatement
q.js:147:29
-                   if (domain) {
-                       domain.exit();
-                   }
+                   if (domain) {}

[Survived] ConditionalExpression
q.js:151:21
-                   if (domain) {
+                   if (true) {

[Survived] BlockStatement
q.js:151:29
-                   if (domain) {
-                       domain.enter();
-                   }
+                   if (domain) {}

[Survived] BlockStatement
q.js:157:20
-               } else {
-                   // In browsers, uncaught exceptions are not fatal.
-                   // Re-throw them asynchronously to avoid slow-downs.
-                   setTimeout(function () {
-                       throw e;
-                   }, 0);
-               }
+               } else {}

[Survived] BlockStatement
q.js:160:40
-                   setTimeout(function () {
-                       throw e;
-                   }, 0);
+                   setTimeout(function () {}, 0);

[Survived] ConditionalExpression
q.js:166:13
-           if (domain) {
+           if (false) {

[Survived] BlockStatement
q.js:166:21
-           if (domain) {
-               domain.exit();
-           }
+           if (domain) {}

[Survived] ConditionalExpression
q.js:174:21
-               domain: isNodeJS && process.domain,
+               domain: false,

[Survived] BooleanLiteral
q.js:179:24
-               flushing = true;
+               flushing = false;

[Survived] ConditionalExpression
q.js:184:9
-       if (typeof process === "object" &&
-           process.toString() === "[object process]" && process.nextTick) {
+       if (true) {

[Survived] ConditionalExpression
q.js:184:9
-       if (typeof process === "object" &&
-           process.toString() === "[object process]" && process.nextTick) {
+       if (false) {

[Survived] LogicalOperator
q.js:184:9
-       if (typeof process === "object" &&
-           process.toString() === "[object process]" && process.nextTick) {
+       if (typeof process === "object" && process.toString() === "[object process]" || process.nextTick) {

[Survived] ConditionalExpression
q.js:184:9
-       if (typeof process === "object" &&
-           process.toString() === "[object process]" && process.nextTick) {
+       if (true && process.nextTick) {

[Survived] LogicalOperator
q.js:184:9
-       if (typeof process === "object" &&
-           process.toString() === "[object process]" && process.nextTick) {
+       if (typeof process === "object" || process.toString() === "[object process]" && process.nextTick) {

[Survived] ConditionalExpression
q.js:184:9
-       if (typeof process === "object" &&
+       if (true &&

[Survived] EqualityOperator
q.js:184:9
-       if (typeof process === "object" &&
+       if (typeof process !== "object" &&

[Survived] StringLiteral
q.js:184:28
-       if (typeof process === "object" &&
+       if (typeof process === "" &&

[Survived] ConditionalExpression
q.js:185:9
-           process.toString() === "[object process]" && process.nextTick) {
+           true && process.nextTick) {

[Survived] EqualityOperator
q.js:185:9
-           process.toString() === "[object process]" && process.nextTick) {
+           process.toString() !== "[object process]" && process.nextTick) {

[Survived] StringLiteral
q.js:185:32
-           process.toString() === "[object process]" && process.nextTick) {
+           process.toString() === "" && process.nextTick) {

[Survived] BooleanLiteral
q.js:194:20
-           isNodeJS = true;
+           isNodeJS = false;

[Survived] ConditionalExpression
q.js:200:16
-       } else if (typeof setImmediate === "function") {
+       } else if (true) {

[Survived] ConditionalExpression
q.js:200:16
-       } else if (typeof setImmediate === "function") {
+       } else if (false) {

[Survived] EqualityOperator
q.js:200:16
-       } else if (typeof setImmediate === "function") {
+       } else if (typeof setImmediate !== "function") {

[Survived] StringLiteral
q.js:200:40
-       } else if (typeof setImmediate === "function") {
+       } else if (typeof setImmediate === "") {

[Survived] BlockStatement
q.js:200:52
-       } else if (typeof setImmediate === "function") {
-           // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
-           if (typeof window !== "undefined") {
-               requestTick = setImmediate.bind(window, flush);
-           } else {
-               requestTick = function () {
-                   setImmediate(flush);
-               };
-           }
-       } else if (typeof MessageChannel !== "undefined") {
+       } else if (typeof setImmediate === "function") {} else if (typeof MessageChannel !== "undefined") {

[Survived] StringLiteral
q.js:202:31
-           if (typeof window !== "undefined") {
+           if (typeof window !== "") {

[Survived] BlockStatement
q.js:202:44
-           if (typeof window !== "undefined") {
-               requestTick = setImmediate.bind(window, flush);
-           } else {
+           if (typeof window !== "undefined") {} else {

[Survived] BlockStatement
q.js:204:16
-           } else {
-               requestTick = function () {
-                   setImmediate(flush);
-               };
-           }
+           } else {}

[Survived] BlockStatement
q.js:205:39
-               requestTick = function () {
-                   setImmediate(flush);
-               };
+               requestTick = function () {};

[Survived] ConditionalExpression
q.js:210:16
-       } else if (typeof MessageChannel !== "undefined") {
+       } else if (true) {

[Survived] ConditionalExpression
q.js:210:16
-       } else if (typeof MessageChannel !== "undefined") {
+       } else if (false) {

[Survived] StringLiteral
q.js:210:42
-       } else if (typeof MessageChannel !== "undefined") {
+       } else if (typeof MessageChannel !== "") {

[Survived] BlockStatement
q.js:210:55
-       } else if (typeof MessageChannel !== "undefined") {
-           // modern browsers
-           // http://www.nonblocking.io/2011/06/windownexttick.html
-           var channel = new MessageChannel();
-           // At least Safari Version 6.0.5 (8536.30.1) intermittently cannot create
-           // working message ports the first time a page loads.
-           channel.port1.onmessage = function () {
-               requestTick = requestPortTick;
-               channel.port1.onmessage = flush;
-               flush();
-           };
-           var requestPortTick = function () {
-               // Opera requires us to provide a message payload, regardless of
-               // whether we use it.
-               channel.port2.postMessage(0);
-           };
-           requestTick = function () {
-               setTimeout(flush, 0);
-               requestPortTick();
-           };
-       } else {
+       } else if (typeof MessageChannel !== "undefined") {} else {

[Survived] BlockStatement
q.js:216:47
-           channel.port1.onmessage = function () {
-               requestTick = requestPortTick;
-               channel.port1.onmessage = flush;
-               flush();
-           };
+           channel.port1.onmessage = function () {};

[Survived] BlockStatement
q.js:221:43
-           var requestPortTick = function () {
-               // Opera requires us to provide a message payload, regardless of
-               // whether we use it.
-               channel.port2.postMessage(0);
-           };
+           var requestPortTick = function () {};

[Survived] BlockStatement
q.js:226:35
-           requestTick = function () {
-               setTimeout(flush, 0);
-               requestPortTick();
-           };
+           requestTick = function () {};

[Survived] BlockStatement
q.js:231:12
-       } else {
-           // old browsers
-           requestTick = function () {
-               setTimeout(flush, 0);
-           };
-       }
+       } else {}

[Survived] BlockStatement
q.js:233:35
-           requestTick = function () {
-               setTimeout(flush, 0);
-           };
+           requestTick = function () {};

[Survived] BlockStatement
q.js:240:41
-       nextTick.runAfter = function (task) {
-           laterQueue.push(task);
-           if (!flushing) {
-               flushing = true;
-               requestTick();
-           }
-       };
+       nextTick.runAfter = function (task) {};

[Survived] ConditionalExpression
q.js:242:13
-           if (!flushing) {
+           if (true) {

[Survived] ConditionalExpression
q.js:242:13
-           if (!flushing) {
+           if (false) {

[Survived] BlockStatement
q.js:242:24
-           if (!flushing) {
-               flushing = true;
-               requestTick();
-           }
+           if (!flushing) {}

[Survived] BooleanLiteral
q.js:243:24
-               flushing = true;
+               flushing = false;

[Survived] LogicalOperator
q.js:273:5
-       Array.prototype.reduce || function (callback, basis) {
-           var index = 0,
-               length = this.length;
-           // concerning the initial value, if one is not provided
-           if (arguments.length === 1) {
-               // seek to the first value in the array, accounting
-               // for the possibility that is is a sparse array
-               do {
-                   if (index in this) {
-                       basis = this[index++];
-                       break;
-                   }
-                   if (++index >= length) {
-                       throw new TypeError();
-                   }
-               } while (1);
-           }
-           // reduce
-           for (; index < length; index++) {
-               // account for the possibility that the array is sparse
-               if (index in this) {
-                   basis = callback(basis, this[index], index);
-               }
-           }
-           return basis;
-       }
+       Array.prototype.reduce && function (callback, basis) {
+     var index = 0,

[Survived] BlockStatement
q.js:273:58
-       Array.prototype.reduce || function (callback, basis) {
-           var index = 0,
-               length = this.length;
-           // concerning the initial value, if one is not provided
-           if (arguments.length === 1) {
-               // seek to the first value in the array, accounting
-               // for the possibility that is is a sparse array
-               do {
-                   if (index in this) {
-                       basis = this[index++];
-                       break;
-                   }
-                   if (++index >= length) {
-                       throw new TypeError();
-                   }
-               } while (1);
-           }
-           // reduce
-           for (; index < length; index++) {
-               // account for the possibility that the array is sparse
-               if (index in this) {
-                   basis = callback(basis, this[index], index);
-               }
-           }
-           return basis;
-       }
+       Array.prototype.reduce || function (callback, basis) {}

[Survived] ConditionalExpression
q.js:277:13
-           if (arguments.length === 1) {
+           if (true) {

[Survived] ConditionalExpression
q.js:277:13
-           if (arguments.length === 1) {
+           if (false) {

[Survived] BlockStatement
q.js:277:37
-           if (arguments.length === 1) {
-               // seek to the first value in the array, accounting
-               // for the possibility that is is a sparse array
-               do {
-                   if (index in this) {
-                       basis = this[index++];
-                       break;
-                   }
-                   if (++index >= length) {
-                       throw new TypeError();
-                   }
-               } while (1);
-           }
+           if (arguments.length === 1) {}

[Survived] ConditionalExpression
q.js:288:22
-               } while (1);
+               } while (false);

[Survived] BlockStatement
q.js:280:16
-               do {
-                   if (index in this) {
-                       basis = this[index++];
-                       break;
-                   }
-                   if (++index >= length) {
-                       throw new TypeError();
-                   }
-               } while (1);
+               do {} while (1);

[Survived] ConditionalExpression
q.js:281:21
-                   if (index in this) {
+                   if (true) {

[Survived] ConditionalExpression
q.js:281:21
-                   if (index in this) {
+                   if (false) {

[Survived] BlockStatement
q.js:281:36
-                   if (index in this) {
-                       basis = this[index++];
-                       break;
-                   }
+                   if (index in this) {}

[Survived] UpdateOperator
q.js:282:34
-                       basis = this[index++];
+                       basis = this[index--];

[Survived] ConditionalExpression
q.js:285:21
-                   if (++index >= length) {
+                   if (true) {

[Survived] ConditionalExpression
q.js:285:21
-                   if (++index >= length) {
+                   if (false) {

[Survived] EqualityOperator
q.js:285:21
-                   if (++index >= length) {
+                   if (++index < length) {

[Survived] UpdateOperator
q.js:285:21
-                   if (++index >= length) {
+                   if (--index >= length) {

[Survived] BlockStatement
q.js:285:40
-                   if (++index >= length) {
-                       throw new TypeError();
-                   }
+                   if (++index >= length) {}

[Survived] ConditionalExpression
q.js:291:16
-           for (; index < length; index++) {
+           for (; false; index++) {

[Survived] BlockStatement
q.js:291:41
-           for (; index < length; index++) {
-               // account for the possibility that the array is sparse
-               if (index in this) {
-                   basis = callback(basis, this[index], index);
-               }
-           }
+           for (; index < length; index++) {}

[Survived] ConditionalExpression
q.js:293:17
-               if (index in this) {
+               if (true) {

[Survived] ConditionalExpression
q.js:293:17
-               if (index in this) {
+               if (false) {

[Survived] BlockStatement
q.js:293:32
-               if (index in this) {
-                   basis = callback(basis, this[index], index);
-               }
+               if (index in this) {}

[Survived] LogicalOperator
q.js:302:5
-       Array.prototype.indexOf || function (value) {
-           // not a very good shim, but good enough for our one use of it
-           for (var i = 0; i < this.length; i++) {
-               if (this[i] === value) {
-                   return i;
-               }
-           }
-           return -1;
-       }
+       Array.prototype.indexOf && function (value) {
+     // not a very good shim, but good enough for our one use of it
+     for (var i = 0; i < this.length; i++) {
+       if (this[i] === value) {
+         return i;
+       }
+     }
+     return -1;
+   }

[Survived] BlockStatement
q.js:302:49
-       Array.prototype.indexOf || function (value) {
-           // not a very good shim, but good enough for our one use of it
-           for (var i = 0; i < this.length; i++) {
-               if (this[i] === value) {
-                   return i;
-               }
-           }
-           return -1;
-       }
+       Array.prototype.indexOf || function (value) {}

[Survived] ConditionalExpression
q.js:304:25
-           for (var i = 0; i < this.length; i++) {
+           for (var i = 0; false; i++) {

[Survived] BlockStatement
q.js:304:47
-           for (var i = 0; i < this.length; i++) {
-               if (this[i] === value) {
-                   return i;
-               }
-           }
+           for (var i = 0; i < this.length; i++) {}

[Survived] ConditionalExpression
q.js:305:17
-               if (this[i] === value) {
+               if (true) {

[Survived] ConditionalExpression
q.js:305:17
-               if (this[i] === value) {
+               if (false) {

[Survived] BlockStatement
q.js:305:36
-               if (this[i] === value) {
-                   return i;
-               }
+               if (this[i] === value) {}

[Survived] UnaryOperator
q.js:309:16
-           return -1;
+           return +1;

[Survived] ConditionalExpression
q.js:314:5
-       Array.prototype.map || function (callback, thisp) {
-           var self = this;
-           var collect = [];
-           array_reduce(self, function (undefined, value, index) {
-               collect.push(callback.call(thisp, value, index, self));
-           }, void 0);
-           return collect;
-       }
+       true

[Survived] ConditionalExpression
q.js:314:5
-       Array.prototype.map || function (callback, thisp) {
-           var self = this;
-           var collect = [];
-           array_reduce(self, function (undefined, value, index) {
-               collect.push(callback.call(thisp, value, index, self));
-           }, void 0);
-           return collect;
-       }
+       false

[Survived] LogicalOperator
q.js:314:5
-       Array.prototype.map || function (callback, thisp) {
-           var self = this;
-           var collect = [];
-           array_reduce(self, function (undefined, value, index) {
-               collect.push(callback.call(thisp, value, index, self));
-           }, void 0);
-           return collect;
-       }
+       Array.prototype.map && function (callback, thisp) {
+     var self = this;
+     var collect = [];
+     array_reduce(self, function (undefined, value, index) {
+       collect.push(callback.call(thisp, value, index, self));
+     }, void 0);
+     return collect;
+   }

[Survived] BlockStatement
q.js:314:55
-       Array.prototype.map || function (callback, thisp) {
-           var self = this;
-           var collect = [];
-           array_reduce(self, function (undefined, value, index) {
-               collect.push(callback.call(thisp, value, index, self));
-           }, void 0);
-           return collect;
-       }
+       Array.prototype.map || function (callback, thisp) {}

[Survived] ArrayDeclaration
q.js:316:23
-           var collect = [];
+           var collect = ["Stryker was here"];

[Survived] BlockStatement
q.js:317:63
-           array_reduce(self, function (undefined, value, index) {
-               collect.push(callback.call(thisp, value, index, self));
-           }, void 0);
+           array_reduce(self, function (undefined, value, index) {}, void 0);

[Survived] LogicalOperator
q.js:324:21
-   var object_create = Object.create || function (prototype) {
-       function Type() { }
-       Type.prototype = prototype;
-       return new Type();
-   };
+   var object_create = Object.create && function (prototype) {
+     function Type() {}
+     Type.prototype = prototype;
+     return new Type();
+   };

[Survived] BlockStatement
q.js:324:59
-   var object_create = Object.create || function (prototype) {
-       function Type() { }
-       Type.prototype = prototype;
-       return new Type();
-   };
+   var object_create = Object.create || function (prototype) {};
