[Survived] ConditionalExpression
q.js:330:29
-   var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-       obj[prop] = descriptor.value;
-       return obj;
-   };
+   var object_defineProperty = true;

[Survived] ConditionalExpression
q.js:330:29
-   var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-       obj[prop] = descriptor.value;
-       return obj;
-   };
+   var object_defineProperty = false;

[Survived] LogicalOperator
q.js:330:29
-   var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-       obj[prop] = descriptor.value;
-       return obj;
-   };
+   var object_defineProperty = Object.defineProperty && function (obj, prop, descriptor) {
+     obj[prop] = descriptor.value;
+     return obj;
+   };

[Survived] BlockStatement
q.js:330:87
-   var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-       obj[prop] = descriptor.value;
-       return obj;
-   };
+   var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {};

[Survived] ConditionalExpression
q.js:337:19
-   var object_keys = Object.keys || function (object) {
-       var keys = [];
-       for (var key in object) {
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
-       }
-       return keys;
-   };
+   var object_keys = true;

[Survived] ConditionalExpression
q.js:337:19
-   var object_keys = Object.keys || function (object) {
-       var keys = [];
-       for (var key in object) {
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
-       }
-       return keys;
-   };
+   var object_keys = false;

[Survived] LogicalOperator
q.js:337:19
-   var object_keys = Object.keys || function (object) {
-       var keys = [];
-       for (var key in object) {
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
-       }
-       return keys;
-   };
+   var object_keys = Object.keys && function (object) {
+     var keys = [];
+     for (var key in object) {
+       if (object_hasOwnProperty(object, key)) {
+         keys.push(key);
+       }
+     }
+     return keys;
+   };

[Survived] BlockStatement
q.js:337:52
-   var object_keys = Object.keys || function (object) {
-       var keys = [];
-       for (var key in object) {
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
-       }
-       return keys;
-   };
+   var object_keys = Object.keys || function (object) {};

[Survived] ArrayDeclaration
q.js:338:16
-       var keys = [];
+       var keys = ["Stryker was here"];

[Survived] BlockStatement
q.js:339:29
-       for (var key in object) {
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
-       }
+       for (var key in object) {}

[Survived] ConditionalExpression
q.js:340:13
-           if (object_hasOwnProperty(object, key)) {
+           if (true) {

[Survived] ConditionalExpression
q.js:340:13
-           if (object_hasOwnProperty(object, key)) {
+           if (false) {

[Survived] BlockStatement
q.js:340:49
-           if (object_hasOwnProperty(object, key)) {
-               keys.push(key);
-           }
+           if (object_hasOwnProperty(object, key)) {}

[Survived] BlockStatement
q.js:356:37
-   function isStopIteration(exception) {
-       return (
-           object_toString(exception) === "[object StopIteration]" ||
-           exception instanceof QReturnValue
-       );
-   }
+   function isStopIteration(exception) {}

[Survived] ConditionalExpression
q.js:358:9
-           object_toString(exception) === "[object StopIteration]" ||
-           exception instanceof QReturnValue
+           true

[Survived] ConditionalExpression
q.js:358:9
-           object_toString(exception) === "[object StopIteration]" ||
-           exception instanceof QReturnValue
+           false

[Survived] LogicalOperator
q.js:358:9
-           object_toString(exception) === "[object StopIteration]" ||
-           exception instanceof QReturnValue
+           object_toString(exception) === "[object StopIteration]" && exception instanceof QReturnValue

[Survived] ConditionalExpression
q.js:358:9
-           object_toString(exception) === "[object StopIteration]" ||
+           false ||

[Survived] EqualityOperator
q.js:358:9
-           object_toString(exception) === "[object StopIteration]" ||
+           object_toString(exception) !== "[object StopIteration]" ||

[Survived] StringLiteral
q.js:358:40
-           object_toString(exception) === "[object StopIteration]" ||
+           object_toString(exception) === "" ||

[Survived] BlockStatement
q.js:366:41
-   if (typeof ReturnValue !== "undefined") {
-       QReturnValue = ReturnValue;
-   } else {
+   if (typeof ReturnValue !== "undefined") {} else {

[Survived] BlockStatement
q.js:368:8
-   } else {
-       QReturnValue = function (value) {
-           this.value = value;
-       };
-   }
+   } else {}

[Survived] BlockStatement
q.js:369:37
-       QReturnValue = function (value) {
-           this.value = value;
-       };
+       QReturnValue = function (value) {};

[Survived] StringLiteral
q.js:376:28
-   var STACK_JUMP_SEPARATOR = "From previous event:";
+   var STACK_JUMP_SEPARATOR = "";

[Survived] BlockStatement
q.js:378:45
-   function makeStackTraceLong(error, promise) {
-       // If possible, transform the error stack trace by removing Node and Q
-       // cruft, then concatenating with the stack trace of `promise`. See #57.
-       if (hasStacks &&
-           promise.stack &&
-           typeof error === "object" &&
-           error !== null &&
-           error.stack
-       ) {
-           var stacks = [];
-           for (var p = promise; !!p; p = p.source) {
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                   stacks.unshift(p.stack);
-               }
-           }
-           stacks.unshift(error.stack);
-           var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
-           var stack = filterStackString(concatedStacks);
-           object_defineProperty(error, "stack", {value: stack, configurable: true});
-       }
-   }
+   function makeStackTraceLong(error, promise) {}

[Survived] ConditionalExpression
q.js:381:9
-       if (hasStacks &&
-           promise.stack &&
-           typeof error === "object" &&
-           error !== null &&
-           error.stack
+       if (false

[Survived] LogicalOperator
q.js:381:9
-       if (hasStacks &&
-           promise.stack &&
-           typeof error === "object" &&
+       if (hasStacks && promise.stack || typeof error === "object" &&

[Survived] ConditionalExpression
q.js:381:9
-       if (hasStacks &&
-           promise.stack &&
+       if (true &&

[Survived] LogicalOperator
q.js:381:9
-       if (hasStacks &&
-           promise.stack &&
+       if (hasStacks || promise.stack &&

[Survived] ConditionalExpression
q.js:383:9
-           typeof error === "object" &&
+           true &&

[Survived] EqualityOperator
q.js:383:9
-           typeof error === "object" &&
+           typeof error !== "object" &&

[Survived] StringLiteral
q.js:383:26
-           typeof error === "object" &&
+           typeof error === "" &&

[Survived] ConditionalExpression
q.js:384:9
-           error !== null &&
+           true &&

[Survived] EqualityOperator
q.js:384:9
-           error !== null &&
+           error === null &&

[Survived] BlockStatement
q.js:386:7
-       ) {
-           var stacks = [];
-           for (var p = promise; !!p; p = p.source) {
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                   stacks.unshift(p.stack);
-               }
-           }
-           stacks.unshift(error.stack);
-           var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
-           var stack = filterStackString(concatedStacks);
-           object_defineProperty(error, "stack", {value: stack, configurable: true});
-       }
+       ) {}

[Survived] ArrayDeclaration
q.js:387:22
-           var stacks = [];
+           var stacks = ["Stryker was here"];

[Survived] ConditionalExpression
q.js:388:31
-           for (var p = promise; !!p; p = p.source) {
+           for (var p = promise; false; p = p.source) {

[Survived] BooleanLiteral
q.js:388:32
-           for (var p = promise; !!p; p = p.source) {
+           for (var p = promise; !p; p = p.source) {

[Survived] BlockStatement
q.js:388:50
-           for (var p = promise; !!p; p = p.source) {
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                   stacks.unshift(p.stack);
-               }
-           }
+           for (var p = promise; !!p; p = p.source) {}

[Survived] ConditionalExpression
q.js:389:17
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (true) {

[Survived] ConditionalExpression
q.js:389:17
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (false) {

[Survived] LogicalOperator
q.js:389:17
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack || !error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter) {

[Survived] ConditionalExpression
q.js:389:29
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (true)) {

[Survived] LogicalOperator
q.js:389:29
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (!error.__minimumStackCounter__ && error.__minimumStackCounter__ > p.stackCounter)) {

[Survived] BooleanLiteral
q.js:389:29
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {

[Survived] ConditionalExpression
q.js:389:63
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (!error.__minimumStackCounter__ || false)) {

[Survived] EqualityOperator
q.js:389:63
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ >= p.stackCounter)) {

[Survived] EqualityOperator
q.js:389:63
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ <= p.stackCounter)) {

[Survived] BlockStatement
q.js:389:112
-               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                   stacks.unshift(p.stack);
-               }
+               if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {}

[Survived] ObjectLiteral
q.js:390:73
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
+                   object_defineProperty(error, "__minimumStackCounter__", {});

[Survived] BooleanLiteral
q.js:390:111
-                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
+                   object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: false});

[Survived] StringLiteral
q.js:396:42
-           var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
+           var concatedStacks = stacks.join("" + STACK_JUMP_SEPARATOR + "\n");

[Survived] StringLiteral
q.js:396:72
-           var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
+           var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "");

[Survived] StringLiteral
q.js:398:38
-           object_defineProperty(error, "stack", {value: stack, configurable: true});
+           object_defineProperty(error, "", {value: stack, configurable: true});

[Survived] ObjectLiteral
q.js:398:47
-           object_defineProperty(error, "stack", {value: stack, configurable: true});
+           object_defineProperty(error, "stack", {});

[Survived] BooleanLiteral
q.js:398:76
-           object_defineProperty(error, "stack", {value: stack, configurable: true});
+           object_defineProperty(error, "stack", {value: stack, configurable: false});

[Survived] BlockStatement
q.js:402:41
-   function filterStackString(stackString) {
-       var lines = stackString.split("\n");
-       var desiredLines = [];
-       for (var i = 0; i < lines.length; ++i) {
-           var line = lines[i];
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
-               desiredLines.push(line);
-           }
-       }
-       return desiredLines.join("\n");
-   }
+   function filterStackString(stackString) {}

[Survived] ArrayDeclaration
q.js:404:24
-       var desiredLines = [];
+       var desiredLines = ["Stryker was here"];

[Survived] ConditionalExpression
q.js:405:21
-       for (var i = 0; i < lines.length; ++i) {
+       for (var i = 0; false; ++i) {

[Survived] UpdateOperator
q.js:405:39
-       for (var i = 0; i < lines.length; ++i) {
+       for (var i = 0; i < lines.length; --i) {

[Survived] BlockStatement
q.js:405:44
-       for (var i = 0; i < lines.length; ++i) {
-           var line = lines[i];
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
-               desiredLines.push(line);
-           }
-       }
+       for (var i = 0; i < lines.length; ++i) {}

[Survived] ConditionalExpression
q.js:408:13
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (true) {

[Survived] ConditionalExpression
q.js:408:13
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (false) {

[Survived] LogicalOperator
q.js:408:13
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (!isInternalFrame(line) && !isNodeFrame(line) || line) {

[Survived] ConditionalExpression
q.js:408:13
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (true && line) {

[Survived] LogicalOperator
q.js:408:13
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (!isInternalFrame(line) || !isNodeFrame(line) && line) {

[Survived] BooleanLiteral
q.js:408:39
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+           if (!isInternalFrame(line) && isNodeFrame(line) && line) {

[Survived] BlockStatement
q.js:408:67
-           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
-               desiredLines.push(line);
-           }
+           if (!isInternalFrame(line) && !isNodeFrame(line) && line) {}

[Survived] BlockStatement
q.js:415:33
-   function isNodeFrame(stackLine) {
-       return stackLine.indexOf("(module.js:") !== -1 ||
-              stackLine.indexOf("(node.js:") !== -1;
-   }
+   function isNodeFrame(stackLine) {}

[Survived] ConditionalExpression
q.js:416:12
-       return stackLine.indexOf("(module.js:") !== -1 ||
-              stackLine.indexOf("(node.js:") !== -1;
+       return true;

[Survived] ConditionalExpression
q.js:416:12
-       return stackLine.indexOf("(module.js:") !== -1 ||
-              stackLine.indexOf("(node.js:") !== -1;
+       return false;

[Survived] LogicalOperator
q.js:416:12
-       return stackLine.indexOf("(module.js:") !== -1 ||
-              stackLine.indexOf("(node.js:") !== -1;
+       return stackLine.indexOf("(module.js:") !== -1 && stackLine.indexOf("(node.js:") !== -1;

[Survived] ConditionalExpression
q.js:416:12
-       return stackLine.indexOf("(module.js:") !== -1 ||
+       return false ||

[Survived] EqualityOperator
q.js:416:12
-       return stackLine.indexOf("(module.js:") !== -1 ||
+       return stackLine.indexOf("(module.js:") === -1 ||

[Survived] StringLiteral
q.js:416:30
-       return stackLine.indexOf("(module.js:") !== -1 ||
+       return stackLine.indexOf("") !== -1 ||

[Survived] UnaryOperator
q.js:416:49
-       return stackLine.indexOf("(module.js:") !== -1 ||
+       return stackLine.indexOf("(module.js:") !== +1 ||

[Survived] ConditionalExpression
q.js:417:12
-              stackLine.indexOf("(node.js:") !== -1;
+              false;

[Survived] EqualityOperator
q.js:417:12
-              stackLine.indexOf("(node.js:") !== -1;
+              stackLine.indexOf("(node.js:") === -1;

[Survived] StringLiteral
q.js:417:30
-              stackLine.indexOf("(node.js:") !== -1;
+              stackLine.indexOf("") !== -1;

[Survived] UnaryOperator
q.js:417:47
-              stackLine.indexOf("(node.js:") !== -1;
+              stackLine.indexOf("(node.js:") !== +1;

[Survived] BlockStatement
q.js:420:46
-   function getFileNameAndLineNumber(stackLine) {
-       // Named functions: "at functionName (filename:lineNumber:columnNumber)"
-       // In IE10 function name can have spaces ("Anonymous function") O_o
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
-       if (attempt1) {
-           return [attempt1[1], Number(attempt1[2])];
-       }
-       // Anonymous functions: "at filename:lineNumber:columnNumber"
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
-       if (attempt2) {
-           return [attempt2[1], Number(attempt2[2])];
-       }
-       // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
-       if (attempt3) {
-           return [attempt3[1], Number(attempt3[2])];
-       }
-   }
+   function getFileNameAndLineNumber(stackLine) {}

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at . \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.):(\d+):(?:\d+)\)$/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.+):(\d):(?:\d+)\)$/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.+):(\D+):(?:\d+)\)$/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.+):(\d+):(?:\d)\)$/.exec(stackLine);

[Survived] Regex
q.js:423:20
-       var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+       var attempt1 = /at .+ \((.+):(\d+):(?:\D+)\)$/.exec(stackLine);

[Survived] ConditionalExpression
q.js:424:9
-       if (attempt1) {
+       if (false) {

[Survived] BlockStatement
q.js:424:19
-       if (attempt1) {
-           return [attempt1[1], Number(attempt1[2])];
-       }
+       if (attempt1) {}

[Survived] ArrayDeclaration
q.js:425:16
-           return [attempt1[1], Number(attempt1[2])];
+           return [];

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]):(\d+):(?:\d+)$/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([ ]+):(\d+):(?:\d+)$/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]+):(\d):(?:\d+)$/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]+):(\D+):(?:\d+)$/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]+):(\d+):(?:\d)$/.exec(stackLine);

[Survived] Regex
q.js:429:20
-       var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
+       var attempt2 = /at ([^ ]+):(\d+):(?:\D+)$/.exec(stackLine);

[Survived] ConditionalExpression
q.js:430:9
-       if (attempt2) {
+       if (true) {

[Survived] ConditionalExpression
q.js:430:9
-       if (attempt2) {
+       if (false) {

[Survived] BlockStatement
q.js:430:19
-       if (attempt2) {
-           return [attempt2[1], Number(attempt2[2])];
-       }
+       if (attempt2) {}

[Survived] ArrayDeclaration
q.js:431:16
-           return [attempt2[1], Number(attempt2[2])];
+           return [];

[Survived] Regex
q.js:435:20
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+       var attempt3 = /.*@(.+):(\d+)/.exec(stackLine);

[Survived] Regex
q.js:435:20
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+       var attempt3 = /.@(.+):(\d+)$/.exec(stackLine);

[Survived] Regex
q.js:435:20
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+       var attempt3 = /.*@(.):(\d+)$/.exec(stackLine);

[Survived] Regex
q.js:435:20
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+       var attempt3 = /.*@(.+):(\d)$/.exec(stackLine);

[Survived] Regex
q.js:435:20
-       var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+       var attempt3 = /.*@(.+):(\D+)$/.exec(stackLine);

[Survived] ConditionalExpression
q.js:436:9
-       if (attempt3) {
+       if (true) {

[Survived] ConditionalExpression
q.js:436:9
-       if (attempt3) {
+       if (false) {

[Survived] BlockStatement
q.js:436:19
-       if (attempt3) {
-           return [attempt3[1], Number(attempt3[2])];
-       }
+       if (attempt3) {}

[Survived] ArrayDeclaration
q.js:437:16
-           return [attempt3[1], Number(attempt3[2])];
+           return [];

[Survived] BlockStatement
q.js:441:37
-   function isInternalFrame(stackLine) {
-       var fileNameAndLineNumber = getFileNameAndLineNumber(stackLine);
-       if (!fileNameAndLineNumber) {
-           return false;
-       }
-       var fileName = fileNameAndLineNumber[0];
-       var lineNumber = fileNameAndLineNumber[1];
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
-           lineNumber <= qEndingLine;
-   }
+   function isInternalFrame(stackLine) {}

[Survived] BooleanLiteral
q.js:444:9
-       if (!fileNameAndLineNumber) {
+       if (fileNameAndLineNumber) {

[Survived] ConditionalExpression
q.js:444:9
-       if (!fileNameAndLineNumber) {
+       if (true) {

[Survived] ConditionalExpression
q.js:444:9
-       if (!fileNameAndLineNumber) {
+       if (false) {

[Survived] BlockStatement
q.js:444:33
-       if (!fileNameAndLineNumber) {
-           return false;
-       }
+       if (!fileNameAndLineNumber) {}

[Survived] BooleanLiteral
q.js:445:16
-           return false;
+           return true;

[Survived] ConditionalExpression
q.js:451:12
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
-           lineNumber <= qEndingLine;
+       return true;

[Survived] ConditionalExpression
q.js:451:12
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
-           lineNumber <= qEndingLine;
+       return false;

[Survived] LogicalOperator
q.js:451:12
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
-           lineNumber <= qEndingLine;
+       return fileName === qFileName && lineNumber >= qStartingLine || lineNumber <= qEndingLine;

[Survived] ConditionalExpression
q.js:451:12
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
+       return true &&

[Survived] LogicalOperator
q.js:451:12
-       return fileName === qFileName &&
-           lineNumber >= qStartingLine &&
+       return fileName === qFileName || lineNumber >= qStartingLine &&

[Survived] ConditionalExpression
q.js:451:12
-       return fileName === qFileName &&
+       return true &&

[Survived] EqualityOperator
q.js:451:12
-       return fileName === qFileName &&
+       return fileName !== qFileName &&

[Survived] ConditionalExpression
q.js:452:9
-           lineNumber >= qStartingLine &&
+           true &&

[Survived] EqualityOperator
q.js:452:9
-           lineNumber >= qStartingLine &&
+           lineNumber > qStartingLine &&

[Survived] EqualityOperator
q.js:452:9
-           lineNumber >= qStartingLine &&
+           lineNumber < qStartingLine &&

[Survived] ConditionalExpression
q.js:453:9
-           lineNumber <= qEndingLine;
+           true;

[Survived] EqualityOperator
q.js:453:9
-           lineNumber <= qEndingLine;
+           lineNumber < qEndingLine;

[Survived] EqualityOperator
q.js:453:9
-           lineNumber <= qEndingLine;
+           lineNumber > qEndingLine;

[Survived] BlockStatement
q.js:458:24
-   function captureLine() {
-       if (!hasStacks) {
-           return;
-       }
-       try {
-           throw new Error();
-       } catch (e) {
-           var lines = e.stack.split("\n");
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
-           var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-           if (!fileNameAndLineNumber) {
-               return;
-           }
-           qFileName = fileNameAndLineNumber[0];
-           return fileNameAndLineNumber[1];
-       }
-   }
+   function captureLine() {}

[Survived] BlockStatement
q.js:459:21
-       if (!hasStacks) {
-           return;
-       }
+       if (!hasStacks) {}

[Survived] BlockStatement
q.js:463:9
-       try {
-           throw new Error();
-       } catch (e) {
+       try {} catch (e) {

[Survived] BlockStatement
q.js:465:17
-       } catch (e) {
-           var lines = e.stack.split("\n");
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
-           var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-           if (!fileNameAndLineNumber) {
-               return;
-           }
-           qFileName = fileNameAndLineNumber[0];
-           return fileNameAndLineNumber[1];
-       }
+       } catch (e) {}

[Survived] ConditionalExpression
q.js:467:25
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+           var firstLine = true ? lines[1] : lines[2];

[Survived] ConditionalExpression
q.js:467:25
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+           var firstLine = false ? lines[1] : lines[2];

[Survived] EqualityOperator
q.js:467:25
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+           var firstLine = lines[0].indexOf("@") >= 0 ? lines[1] : lines[2];

[Survived] EqualityOperator
q.js:467:25
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+           var firstLine = lines[0].indexOf("@") <= 0 ? lines[1] : lines[2];

[Survived] StringLiteral
q.js:467:42
-           var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+           var firstLine = lines[0].indexOf("") > 0 ? lines[1] : lines[2];

[Survived] BooleanLiteral
q.js:469:13
-           if (!fileNameAndLineNumber) {
+           if (fileNameAndLineNumber) {

[Survived] ConditionalExpression
q.js:469:13
-           if (!fileNameAndLineNumber) {
+           if (true) {

[Survived] ConditionalExpression
q.js:469:13
-           if (!fileNameAndLineNumber) {
+           if (false) {

[Survived] BlockStatement
q.js:469:37
-           if (!fileNameAndLineNumber) {
-               return;
-           }
+           if (!fileNameAndLineNumber) {}

[Survived] BlockStatement
q.js:478:49
-   function deprecate(callback, name, alternative) {
-       return function () {
-           if (typeof console !== "undefined" &&
-               typeof console.warn === "function") {
-               console.warn(name + " is deprecated, use " + alternative +
-                            " instead.", new Error("").stack);
-           }
-           return callback.apply(callback, arguments);
-       };
-   }
+   function deprecate(callback, name, alternative) {}

[Survived] BlockStatement
q.js:479:24
-       return function () {
-           if (typeof console !== "undefined" &&
-               typeof console.warn === "function") {
-               console.warn(name + " is deprecated, use " + alternative +
-                            " instead.", new Error("").stack);
-           }
-           return callback.apply(callback, arguments);
-       };
+       return function () {};
