[Survived] ConditionalExpression
q.js:480:13
-           if (typeof console !== "undefined" &&
-               typeof console.warn === "function") {
+           if (true) {

[Survived] ConditionalExpression
q.js:480:13
-           if (typeof console !== "undefined" &&
-               typeof console.warn === "function") {
+           if (false) {

[Survived] LogicalOperator
q.js:480:13
-           if (typeof console !== "undefined" &&
-               typeof console.warn === "function") {
+           if (typeof console !== "undefined" || typeof console.warn === "function") {

[Survived] ConditionalExpression
q.js:480:13
-           if (typeof console !== "undefined" &&
+           if (true &&

[Survived] EqualityOperator
q.js:480:13
-           if (typeof console !== "undefined" &&
+           if (typeof console === "undefined" &&

[Survived] StringLiteral
q.js:480:32
-           if (typeof console !== "undefined" &&
+           if (typeof console !== "" &&

[Survived] ConditionalExpression
q.js:481:13
-               typeof console.warn === "function") {
+               true) {

[Survived] EqualityOperator
q.js:481:13
-               typeof console.warn === "function") {
+               typeof console.warn !== "function") {

[Survived] StringLiteral
q.js:481:37
-               typeof console.warn === "function") {
+               typeof console.warn === "") {

[Survived] BlockStatement
q.js:481:49
-               typeof console.warn === "function") {
-               console.warn(name + " is deprecated, use " + alternative +
-                            " instead.", new Error("").stack);
-           }
+               typeof console.warn === "function") {}

[Survived] StringLiteral
q.js:482:33
-               console.warn(name + " is deprecated, use " + alternative +
+               console.warn(name + "" + alternative +

[Survived] StringLiteral
q.js:483:26
-                            " instead.", new Error("").stack);
+                            "", new Error("").stack);

[Survived] StringLiteral
q.js:483:49
-                            " instead.", new Error("").stack);
+                            " instead.", new Error("Stryker was here!").stack);

[Survived] ConditionalExpression
q.js:501:9
-       if (value instanceof Promise) {
+       if (false) {

[Survived] BlockStatement
q.js:501:35
-       if (value instanceof Promise) {
-           return value;
-       }
+       if (value instanceof Promise) {}

[Survived] BooleanLiteral
q.js:523:22
-   Q.longStackSupport = false;
+   Q.longStackSupport = true;

[Survived] ConditionalExpression
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (true) {

[Survived] ConditionalExpression
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (false) {

[Survived] LogicalOperator
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (typeof process === "object" && process && process.env || process.env.Q_DEBUG) {

[Survived] ConditionalExpression
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (true && process.env.Q_DEBUG) {

[Survived] LogicalOperator
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (typeof process === "object" && process || process.env && process.env.Q_DEBUG) {

[Survived] ConditionalExpression
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (true && process.env && process.env.Q_DEBUG) {

[Survived] LogicalOperator
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (typeof process === "object" || process && process.env && process.env.Q_DEBUG) {

[Survived] ConditionalExpression
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (true && process && process.env && process.env.Q_DEBUG) {

[Survived] EqualityOperator
q.js:534:5
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (typeof process !== "object" && process && process.env && process.env.Q_DEBUG) {

[Survived] StringLiteral
q.js:534:24
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+   if (typeof process === "" && process && process.env && process.env.Q_DEBUG) {

[Survived] BlockStatement
q.js:534:83
-   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
-       Q.longStackSupport = true;
-   }
+   if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {}

[Survived] BooleanLiteral
q.js:535:26
-       Q.longStackSupport = true;
+       Q.longStackSupport = false;

[Survived] ArrayDeclaration
q.js:556:44
-       var messages = [], progressListeners = [], resolvedPromise;
+       var messages = [], progressListeners = ["Stryker was here"], resolvedPromise;

[Survived] ConditionalExpression
q.js:565:17
-               if (op === "when" && operands[1]) { // progress operand
+               if (true) { // progress operand

[Survived] ConditionalExpression
q.js:565:17
-               if (op === "when" && operands[1]) { // progress operand
+               if (false) { // progress operand

[Survived] LogicalOperator
q.js:565:17
-               if (op === "when" && operands[1]) { // progress operand
+               if (op === "when" || operands[1]) { // progress operand

[Survived] ConditionalExpression
q.js:565:17
-               if (op === "when" && operands[1]) { // progress operand
+               if (true && operands[1]) { // progress operand

[Survived] StringLiteral
q.js:565:24
-               if (op === "when" && operands[1]) { // progress operand
+               if (op === "" && operands[1]) { // progress operand

[Survived] BlockStatement
q.js:565:47
-               if (op === "when" && operands[1]) { // progress operand
-                   progressListeners.push(operands[1]);
-               }
+               if (op === "when" && operands[1]) {}

[Survived] BlockStatement
q.js:576:35
-       promise.valueOf = function () {
-           if (messages) {
-               return promise;
-           }
-           var nearerValue = nearer(resolvedPromise);
-           if (isPromise(nearerValue)) {
-               resolvedPromise = nearerValue; // shorten chain
-           }
-           return nearerValue;
-       };
+       promise.valueOf = function () {};

[Survived] ConditionalExpression
q.js:577:13
-           if (messages) {
+           if (true) {

[Survived] ConditionalExpression
q.js:577:13
-           if (messages) {
+           if (false) {

[Survived] BlockStatement
q.js:577:23
-           if (messages) {
-               return promise;
-           }
+           if (messages) {}

[Survived] ConditionalExpression
q.js:581:13
-           if (isPromise(nearerValue)) {
+           if (true) {

[Survived] ConditionalExpression
q.js:581:13
-           if (isPromise(nearerValue)) {
+           if (false) {

[Survived] BlockStatement
q.js:581:37
-           if (isPromise(nearerValue)) {
-               resolvedPromise = nearerValue; // shorten chain
-           }
+           if (isPromise(nearerValue)) {}

[Survived] BlockStatement
q.js:587:35
-       promise.inspect = function () {
-           if (!resolvedPromise) {
-               return { state: "pending" };
-           }
-           return resolvedPromise.inspect();
-       };
+       promise.inspect = function () {};

[Survived] ConditionalExpression
q.js:588:13
-           if (!resolvedPromise) {
+           if (true) {

[Survived] ConditionalExpression
q.js:588:13
-           if (!resolvedPromise) {
+           if (false) {

[Survived] BlockStatement
q.js:588:31
-           if (!resolvedPromise) {
-               return { state: "pending" };
-           }
+           if (!resolvedPromise) {}

[Survived] ObjectLiteral
q.js:589:20
-               return { state: "pending" };
+               return {};

[Survived] StringLiteral
q.js:589:29
-               return { state: "pending" };
+               return { state: "" };

[Survived] ConditionalExpression
q.js:594:9
-       if (Q.longStackSupport && hasStacks) {
+       if (true) {

[Survived] BlockStatement
q.js:594:42
-       if (Q.longStackSupport && hasStacks) {
-           try {
-               throw new Error();
-           } catch (e) {
-               // NOTE: don't try to use `Error.captureStackTrace` or transfer the
-               // accessor around; that causes memory leaks as per GH-111. Just
-               // reify the stack trace as a string ASAP.
-               //
-               // At the same time, cut off the first line; it's always just
-               // "[object Promise]\n", as per the `toString`.
-               promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
-               promise.stackCounter = longStackCounter++;
-           }
-       }
+       if (Q.longStackSupport && hasStacks) {}

[Survived] BlockStatement
q.js:595:13
-           try {
-               throw new Error();
-           } catch (e) {
+           try {} catch (e) {

[Survived] BlockStatement
q.js:597:21
-           } catch (e) {
-               // NOTE: don't try to use `Error.captureStackTrace` or transfer the
-               // accessor around; that causes memory leaks as per GH-111. Just
-               // reify the stack trace as a string ASAP.
-               //
-               // At the same time, cut off the first line; it's always just
-               // "[object Promise]\n", as per the `toString`.
-               promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
-               promise.stackCounter = longStackCounter++;
-           }
+           } catch (e) {}

[Survived] MethodExpression
q.js:604:29
-               promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
+               promise.stack = e.stack;

[Survived] UpdateOperator
q.js:605:36
-               promise.stackCounter = longStackCounter++;
+               promise.stackCounter = longStackCounter--;

[Survived] ConditionalExpression
q.js:616:13
-           if (Q.longStackSupport && hasStacks) {
+           if (true) {

[Survived] BlockStatement
q.js:616:46
-           if (Q.longStackSupport && hasStacks) {
-               // Only hold a reference to the new promise if long stacks
-               // are enabled to reduce memory usage
-               promise.source = newPromise;
-           }
+           if (Q.longStackSupport && hasStacks) {}

[Survived] BlockStatement
q.js:641:41
-       deferred.fulfill = function (value) {
-           if (resolvedPromise) {
-               return;
-           }
-           become(fulfill(value));
-       };
+       deferred.fulfill = function (value) {};

[Survived] ConditionalExpression
q.js:642:13
-           if (resolvedPromise) {
+           if (true) {

[Survived] ConditionalExpression
q.js:642:13
-           if (resolvedPromise) {
+           if (false) {

[Survived] BlockStatement
q.js:642:30
-           if (resolvedPromise) {
-               return;
-           }
+           if (resolvedPromise) {}

[Survived] BlockStatement
q.js:655:43
-       deferred.notify = function (progress) {
-           if (resolvedPromise) {
-               return;
-           }
-           array_reduce(progressListeners, function (undefined, progressListener) {
-               Q.nextTick(function () {
-                   progressListener(progress);
-               });
-           }, void 0);
-       };
+       deferred.notify = function (progress) {};

[Survived] ConditionalExpression
q.js:656:13
-           if (resolvedPromise) {
+           if (true) {

[Survived] ConditionalExpression
q.js:656:13
-           if (resolvedPromise) {
+           if (false) {

[Survived] BlockStatement
q.js:656:30
-           if (resolvedPromise) {
-               return;
-           }
+           if (resolvedPromise) {}

[Survived] BlockStatement
q.js:660:80
-           array_reduce(progressListeners, function (undefined, progressListener) {
-               Q.nextTick(function () {
-                   progressListener(progress);
-               });
-           }, void 0);
+           array_reduce(progressListeners, function (undefined, progressListener) {}, void 0);

[Survived] BlockStatement
q.js:661:36
-               Q.nextTick(function () {
-                   progressListener(progress);
-               });
+               Q.nextTick(function () {});

[Survived] BlockStatement
q.js:675:48
-   defer.prototype.makeNodeResolver = function () {
-       var self = this;
-       return function (error, value) {
-           if (error) {
-               self.reject(error);
-           } else if (arguments.length > 2) {
-               self.resolve(array_slice(arguments, 1));
-           } else {
-               self.resolve(value);
-           }
-       };
-   };
+   defer.prototype.makeNodeResolver = function () {};

[Survived] BlockStatement
q.js:677:36
-       return function (error, value) {
-           if (error) {
-               self.reject(error);
-           } else if (arguments.length > 2) {
-               self.resolve(array_slice(arguments, 1));
-           } else {
-               self.resolve(value);
-           }
-       };
+       return function (error, value) {};

[Survived] ConditionalExpression
q.js:678:13
-           if (error) {
+           if (true) {

[Survived] ConditionalExpression
q.js:678:13
-           if (error) {
+           if (false) {

[Survived] BlockStatement
q.js:678:20
-           if (error) {
-               self.reject(error);
-           } else if (arguments.length > 2) {
+           if (error) {} else if (arguments.length > 2) {

[Survived] ConditionalExpression
q.js:680:20
-           } else if (arguments.length > 2) {
+           } else if (true) {

[Survived] ConditionalExpression
q.js:680:20
-           } else if (arguments.length > 2) {
+           } else if (false) {

[Survived] EqualityOperator
q.js:680:20
-           } else if (arguments.length > 2) {
+           } else if (arguments.length <= 2) {

[Survived] BlockStatement
q.js:680:42
-           } else if (arguments.length > 2) {
-               self.resolve(array_slice(arguments, 1));
-           } else {
+           } else if (arguments.length > 2) {} else {

[Survived] BlockStatement
q.js:682:16
-           } else {
-               self.resolve(value);
-           }
+           } else {}

[Survived] BlockStatement
q.js:696:28
-   function promise(resolver) {
-       if (typeof resolver !== "function") {
-           throw new TypeError("resolver must be a function.");
-       }
-       var deferred = defer();
-       try {
-           resolver(deferred.resolve, deferred.reject, deferred.notify);
-       } catch (reason) {
-           deferred.reject(reason);
-       }
-       return deferred.promise;
-   }
+   function promise(resolver) {}

[Survived] ConditionalExpression
q.js:697:9
-       if (typeof resolver !== "function") {
+       if (true) {

[Survived] ConditionalExpression
q.js:697:9
-       if (typeof resolver !== "function") {
+       if (false) {

[Survived] StringLiteral
q.js:697:29
-       if (typeof resolver !== "function") {
+       if (typeof resolver !== "") {

[Survived] BlockStatement
q.js:697:41
-       if (typeof resolver !== "function") {
-           throw new TypeError("resolver must be a function.");
-       }
+       if (typeof resolver !== "function") {}

[Survived] StringLiteral
q.js:698:29
-           throw new TypeError("resolver must be a function.");
+           throw new TypeError("");

[Survived] BlockStatement
q.js:701:9
-       try {
-           resolver(deferred.resolve, deferred.reject, deferred.notify);
-       } catch (reason) {
+       try {} catch (reason) {

[Survived] BlockStatement
q.js:703:22
-       } catch (reason) {
-           deferred.reject(reason);
-       }
+       } catch (reason) {}

[Survived] BlockStatement
q.js:717:34
-   Q.passByCopy = function (object) {
-       //freeze(object);
-       //passByCopies.set(object, true);
-       return object;
-   };
+   Q.passByCopy = function (object) {};

[Survived] BlockStatement
q.js:723:44
-   Promise.prototype.passByCopy = function () {
-       //freeze(object);
-       //passByCopies.set(object, true);
-       return this;
-   };
+   Promise.prototype.passByCopy = function () {};

[Survived] BlockStatement
q.js:738:26
-   Q.join = function (x, y) {
-       return Q(x).join(y);
-   };
+   Q.join = function (x, y) {};

[Survived] BlockStatement
q.js:742:42
-   Promise.prototype.join = function (that) {
-       return Q([this, that]).spread(function (x, y) {
-           if (x === y) {
-               // TODO: "===" should be Object.is or equiv
-               return x;
-           } else {
-               throw new Error("Q can't join: not the same: " + x + " " + y);
-           }
-       });
-   };
+   Promise.prototype.join = function (that) {};

[Survived] ArrayDeclaration
q.js:743:14
-       return Q([this, that]).spread(function (x, y) {
+       return Q([]).spread(function (x, y) {

[Survived] BlockStatement
q.js:743:51
-       return Q([this, that]).spread(function (x, y) {
-           if (x === y) {
-               // TODO: "===" should be Object.is or equiv
-               return x;
-           } else {
-               throw new Error("Q can't join: not the same: " + x + " " + y);
-           }
-       });
+       return Q([this, that]).spread(function (x, y) {});

[Survived] ConditionalExpression
q.js:744:13
-           if (x === y) {
+           if (true) {

[Survived] ConditionalExpression
q.js:744:13
-           if (x === y) {
+           if (false) {

[Survived] BlockStatement
q.js:744:22
-           if (x === y) {
-               // TODO: "===" should be Object.is or equiv
-               return x;
-           } else {
+           if (x === y) {} else {

[Survived] BlockStatement
q.js:747:16
-           } else {
-               throw new Error("Q can't join: not the same: " + x + " " + y);
-           }
+           } else {}

[Survived] StringLiteral
q.js:748:29
-               throw new Error("Q can't join: not the same: " + x + " " + y);
+               throw new Error("" + x + " " + y);

[Survived] StringLiteral
q.js:748:66
-               throw new Error("Q can't join: not the same: " + x + " " + y);
+               throw new Error("Q can't join: not the same: " + x + "" + y);

[Survived] BlockStatement
q.js:759:25
-   function race(answerPs) {
-       return promise(function (resolve, reject) {
-           // Switch to this once we can assume at least ES5
-           // answerPs.forEach(function (answerP) {
-           //     Q(answerP).then(resolve, reject);
-           // });
-           // Use this in the meantime
-           for (var i = 0, len = answerPs.length; i < len; i++) {
-               Q(answerPs[i]).then(resolve, reject);
-           }
-       });
-   }
+   function race(answerPs) {}

[Survived] BlockStatement
q.js:760:47
-       return promise(function (resolve, reject) {
-           // Switch to this once we can assume at least ES5
-           // answerPs.forEach(function (answerP) {
-           //     Q(answerP).then(resolve, reject);
-           // });
-           // Use this in the meantime
-           for (var i = 0, len = answerPs.length; i < len; i++) {
-               Q(answerPs[i]).then(resolve, reject);
-           }
-       });
+       return promise(function (resolve, reject) {});

[Survived] ConditionalExpression
q.js:766:48
-           for (var i = 0, len = answerPs.length; i < len; i++) {
+           for (var i = 0, len = answerPs.length; false; i++) {

[Survived] BlockStatement
q.js:766:62
-           for (var i = 0, len = answerPs.length; i < len; i++) {
-               Q(answerPs[i]).then(resolve, reject);
-           }
+           for (var i = 0, len = answerPs.length; i < len; i++) {}

[Survived] BlockStatement
q.js:772:38
-   Promise.prototype.race = function () {
-       return this.then(Q.race);
-   };
+   Promise.prototype.race = function () {};

[Survived] ConditionalExpression
q.js:789:9
-       if (fallback === void 0) {
+       if (true) {

[Survived] ConditionalExpression
q.js:789:9
-       if (fallback === void 0) {
+       if (false) {

[Survived] BlockStatement
q.js:789:30
-       if (fallback === void 0) {
-           fallback = function (op) {
-               return reject(new Error(
-                   "Promise does not support operation: " + op
-               ));
-           };
-       }
+       if (fallback === void 0) {}

[Survived] BlockStatement
q.js:790:34
-           fallback = function (op) {
-               return reject(new Error(
-                   "Promise does not support operation: " + op
-               ));
-           };
+           fallback = function (op) {};

[Survived] StringLiteral
q.js:792:17
-                   "Promise does not support operation: " + op
+                   "" + op

[Survived] ConditionalExpression
q.js:796:9
-       if (inspect === void 0) {
+       if (true) {

[Survived] ConditionalExpression
q.js:796:9
-       if (inspect === void 0) {
+       if (false) {

[Survived] BlockStatement
q.js:796:29
-       if (inspect === void 0) {
-           inspect = function () {
-               return {state: "unknown"};
-           };
-       }
+       if (inspect === void 0) {}

[Survived] BlockStatement
q.js:797:31
-           inspect = function () {
-               return {state: "unknown"};
-           };
+           inspect = function () {};

[Survived] ObjectLiteral
q.js:798:20
-               return {state: "unknown"};
+               return {};

[Survived] StringLiteral
q.js:798:28
-               return {state: "unknown"};
+               return {state: ""};

[Survived] ConditionalExpression
q.js:807:17
-               if (descriptor[op]) {
+               if (true) {

[Survived] BlockStatement
q.js:809:20
-               } else {
-                   result = fallback.call(promise, op, args);
-               }
+               } else {}

[Survived] BlockStatement
q.js:812:29
-           } catch (exception) {
-               result = reject(exception);
-           }
+           } catch (exception) {}

[Survived] ConditionalExpression
q.js:823:9
-       if (inspect) {
+       if (true) {

[Survived] ConditionalExpression
q.js:823:9
-       if (inspect) {
+       if (false) {

[Survived] BlockStatement
q.js:823:18
-       if (inspect) {
-           var inspected = inspect();
-           if (inspected.state === "rejected") {
-               promise.exception = inspected.reason;
-           }
-           promise.valueOf = function () {
-               var inspected = inspect();
-               if (inspected.state === "pending" ||
-                   inspected.state === "rejected") {
-                   return promise;
-               }
-               return inspected.value;
-           };
-       }
+       if (inspect) {}

[Survived] ConditionalExpression
q.js:825:13
-           if (inspected.state === "rejected") {
+           if (true) {

[Survived] ConditionalExpression
q.js:825:13
-           if (inspected.state === "rejected") {
+           if (false) {

[Survived] StringLiteral
q.js:825:33
-           if (inspected.state === "rejected") {
+           if (inspected.state === "") {

[Survived] BlockStatement
q.js:825:45
-           if (inspected.state === "rejected") {
-               promise.exception = inspected.reason;
-           }
+           if (inspected.state === "rejected") {}

[Survived] BlockStatement
q.js:829:39
-           promise.valueOf = function () {
-               var inspected = inspect();
-               if (inspected.state === "pending" ||
-                   inspected.state === "rejected") {
-                   return promise;
-               }
-               return inspected.value;
-           };
+           promise.valueOf = function () {};

[Survived] ConditionalExpression
q.js:831:17
-               if (inspected.state === "pending" ||
-                   inspected.state === "rejected") {
+               if (true) {

[Survived] ConditionalExpression
q.js:831:17
-               if (inspected.state === "pending" ||
-                   inspected.state === "rejected") {
+               if (false) {

[Survived] ConditionalExpression
q.js:831:17
-               if (inspected.state === "pending" ||
+               if (false ||

[Survived] EqualityOperator
q.js:831:17
-               if (inspected.state === "pending" ||
+               if (inspected.state !== "pending" ||

[Survived] StringLiteral
q.js:831:37
-               if (inspected.state === "pending" ||
+               if (inspected.state === "" ||

[Survived] ConditionalExpression
q.js:832:17
-                   inspected.state === "rejected") {
+                   false) {

[Survived] EqualityOperator
q.js:832:17
-                   inspected.state === "rejected") {
+                   inspected.state !== "rejected") {

[Survived] StringLiteral
q.js:832:37
-                   inspected.state === "rejected") {
+                   inspected.state === "") {

[Survived] BlockStatement
q.js:832:49
-                   inspected.state === "rejected") {
-                   return promise;
-               }
+                   inspected.state === "rejected") {}

[Survived] BlockStatement
q.js:842:42
-   Promise.prototype.toString = function () {
-       return "[object Promise]";
-   };
+   Promise.prototype.toString = function () {};

[Survived] StringLiteral
q.js:843:12
-       return "[object Promise]";
+       return "";

[Survived] BlockStatement
q.js:872:33
-       function _progressed(value) {
-           return typeof progressed === "function" ? progressed(value) : value;
-       }
+       function _progressed(value) {}

[Survived] ConditionalExpression
q.js:873:16
-           return typeof progressed === "function" ? progressed(value) : value;
+           return true ? progressed(value) : value;

[Survived] ConditionalExpression
q.js:873:16
-           return typeof progressed === "function" ? progressed(value) : value;
+           return false ? progressed(value) : value;

[Survived] EqualityOperator
q.js:873:16
-           return typeof progressed === "function" ? progressed(value) : value;
+           return typeof progressed !== "function" ? progressed(value) : value;

[Survived] StringLiteral
q.js:873:38
-           return typeof progressed === "function" ? progressed(value) : value;
+           return typeof progressed === "" ? progressed(value) : value;

[Survived] BooleanLiteral
q.js:881:20
-               done = true;
+               done = false;

[Survived] ConditionalExpression
q.js:885:17
-               if (done) {
+               if (false) {

[Survived] BlockStatement
q.js:885:23
-               if (done) {
-                   return;
-               }
+               if (done) {}

[Survived] StringLiteral
q.js:895:34
-       self.promiseDispatch(void 0, "when", [void 0, function (value) {
+       self.promiseDispatch(void 0, "", [void 0, function (value) {

[Survived] ArrayDeclaration
q.js:895:42
-       self.promiseDispatch(void 0, "when", [void 0, function (value) {
-           var newValue;
-           var threw = false;
-           try {
-               newValue = _progressed(value);
-           } catch (e) {
-               threw = true;
-               if (Q.onerror) {
-                   Q.onerror(e);
-               } else {
-                   throw e;
-               }
-           }
-           if (!threw) {
-               deferred.notify(newValue);
-           }
-       }]);
+       self.promiseDispatch(void 0, "when", []);

[Survived] BlockStatement
q.js:895:68
-       self.promiseDispatch(void 0, "when", [void 0, function (value) {
-           var newValue;
-           var threw = false;
-           try {
-               newValue = _progressed(value);
-           } catch (e) {
-               threw = true;
-               if (Q.onerror) {
-                   Q.onerror(e);
-               } else {
-                   throw e;
-               }
-           }
-           if (!threw) {
-               deferred.notify(newValue);
-           }
-       }]);
+       self.promiseDispatch(void 0, "when", [void 0, function (value) {}]);

[Survived] BooleanLiteral
q.js:897:21
-           var threw = false;
+           var threw = true;

[Survived] BlockStatement
q.js:898:13
-           try {
-               newValue = _progressed(value);
-           } catch (e) {
+           try {} catch (e) {

[Survived] BlockStatement
q.js:900:21
-           } catch (e) {
-               threw = true;
-               if (Q.onerror) {
-                   Q.onerror(e);
-               } else {
-                   throw e;
-               }
-           }
+           } catch (e) {}

[Survived] BooleanLiteral
q.js:901:21
-               threw = true;
+               threw = false;

[Survived] ConditionalExpression
q.js:902:17
-               if (Q.onerror) {
+               if (true) {

[Survived] ConditionalExpression
q.js:902:17
-               if (Q.onerror) {
+               if (false) {

[Survived] BlockStatement
q.js:902:28
-               if (Q.onerror) {
-                   Q.onerror(e);
-               } else {
+               if (Q.onerror) {} else {

[Survived] BlockStatement
q.js:904:20
-               } else {
-                   throw e;
-               }
+               } else {}

[Survived] ConditionalExpression
q.js:909:13
-           if (!threw) {
+           if (false) {

[Survived] BlockStatement
q.js:909:21
-           if (!threw) {
-               deferred.notify(newValue);
-           }
+           if (!threw) {}

[Survived] BlockStatement
q.js:917:38
-   Q.tap = function (promise, callback) {
-       return Q(promise).tap(callback);
-   };
+   Q.tap = function (promise, callback) {};
