[Survived] BlockStatement
q.js:933:45
-   Promise.prototype.tap = function (callback) {
-       callback = Q(callback);
-       return this.then(function (value) {
-           return callback.fcall(value).thenResolve(value);
-       });
-   };
+   Promise.prototype.tap = function (callback) {};

[Survived] BlockStatement
q.js:936:39
-       return this.then(function (value) {
-           return callback.fcall(value).thenResolve(value);
-       });
+       return this.then(function (value) {});

[Survived] BlockStatement
q.js:958:55
-   function when(value, fulfilled, rejected, progressed) {
-       return Q(value).then(fulfilled, rejected, progressed);
-   }
+   function when(value, fulfilled, rejected, progressed) {}

[Survived] BlockStatement
q.js:962:50
-   Promise.prototype.thenResolve = function (value) {
-       return this.then(function () { return value; });
-   };
+   Promise.prototype.thenResolve = function (value) {};

[Survived] BlockStatement
q.js:963:34
-       return this.then(function () { return value; });
+       return this.then(function () {});

[Survived] BlockStatement
q.js:966:43
-   Q.thenResolve = function (promise, value) {
-       return Q(promise).thenResolve(value);
-   };
+   Q.thenResolve = function (promise, value) {};

[Survived] BlockStatement
q.js:970:50
-   Promise.prototype.thenReject = function (reason) {
-       return this.then(function () { throw reason; });
-   };
+   Promise.prototype.thenReject = function (reason) {};

[Survived] BlockStatement
q.js:971:34
-       return this.then(function () { throw reason; });
+       return this.then(function () {});

[Survived] BlockStatement
q.js:974:43
-   Q.thenReject = function (promise, reason) {
-       return Q(promise).thenReject(reason);
-   };
+   Q.thenReject = function (promise, reason) {};

[Survived] BlockStatement
q.js:990:24
-   function nearer(value) {
-       if (isPromise(value)) {
-           var inspected = value.inspect();
-           if (inspected.state === "fulfilled") {
-               return inspected.value;
-           }
-       }
-       return value;
-   }
+   function nearer(value) {}

[Survived] ConditionalExpression
q.js:991:9
-       if (isPromise(value)) {
+       if (true) {

[Survived] ConditionalExpression
q.js:991:9
-       if (isPromise(value)) {
+       if (false) {

[Survived] BlockStatement
q.js:991:27
-       if (isPromise(value)) {
-           var inspected = value.inspect();
-           if (inspected.state === "fulfilled") {
-               return inspected.value;
-           }
-       }
+       if (isPromise(value)) {}

[Survived] ConditionalExpression
q.js:993:13
-           if (inspected.state === "fulfilled") {
+           if (true) {

[Survived] ConditionalExpression
q.js:993:13
-           if (inspected.state === "fulfilled") {
+           if (false) {

[Survived] StringLiteral
q.js:993:33
-           if (inspected.state === "fulfilled") {
+           if (inspected.state === "") {

[Survived] BlockStatement
q.js:993:46
-           if (inspected.state === "fulfilled") {
-               return inspected.value;
-           }
+           if (inspected.state === "fulfilled") {}

[Survived] BlockStatement
q.js:1005:28
-   function isPromise(object) {
-       return object instanceof Promise;
-   }
+   function isPromise(object) {}

[Survived] BlockStatement
q.js:1019:28
-   function isPending(object) {
-       return isPromise(object) && object.inspect().state === "pending";
-   }
+   function isPending(object) {}

[Survived] ConditionalExpression
q.js:1020:12
-       return isPromise(object) && object.inspect().state === "pending";
+       return true;

[Survived] ConditionalExpression
q.js:1020:12
-       return isPromise(object) && object.inspect().state === "pending";
+       return false;

[Survived] LogicalOperator
q.js:1020:12
-       return isPromise(object) && object.inspect().state === "pending";
+       return isPromise(object) || object.inspect().state === "pending";

[Survived] ConditionalExpression
q.js:1020:33
-       return isPromise(object) && object.inspect().state === "pending";
+       return isPromise(object) && true;

[Survived] EqualityOperator
q.js:1020:33
-       return isPromise(object) && object.inspect().state === "pending";
+       return isPromise(object) && object.inspect().state !== "pending";

[Survived] StringLiteral
q.js:1020:60
-       return isPromise(object) && object.inspect().state === "pending";
+       return isPromise(object) && object.inspect().state === "";

[Survived] BlockStatement
q.js:1023:43
-   Promise.prototype.isPending = function () {
-       return this.inspect().state === "pending";
-   };
+   Promise.prototype.isPending = function () {};

[Survived] ConditionalExpression
q.js:1024:12
-       return this.inspect().state === "pending";
+       return true;

[Survived] ConditionalExpression
q.js:1024:12
-       return this.inspect().state === "pending";
+       return false;

[Survived] EqualityOperator
q.js:1024:12
-       return this.inspect().state === "pending";
+       return this.inspect().state !== "pending";

[Survived] StringLiteral
q.js:1024:37
-       return this.inspect().state === "pending";
+       return this.inspect().state === "";

[Survived] BlockStatement
q.js:1032:30
-   function isFulfilled(object) {
-       return !isPromise(object) || object.inspect().state === "fulfilled";
-   }
+   function isFulfilled(object) {}

[Survived] ConditionalExpression
q.js:1033:12
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return true;

[Survived] ConditionalExpression
q.js:1033:12
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return false;

[Survived] LogicalOperator
q.js:1033:12
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return !isPromise(object) && object.inspect().state === "fulfilled";

[Survived] BooleanLiteral
q.js:1033:12
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return isPromise(object) || object.inspect().state === "fulfilled";

[Survived] ConditionalExpression
q.js:1033:34
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return !isPromise(object) || false;

[Survived] EqualityOperator
q.js:1033:34
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return !isPromise(object) || object.inspect().state !== "fulfilled";

[Survived] StringLiteral
q.js:1033:61
-       return !isPromise(object) || object.inspect().state === "fulfilled";
+       return !isPromise(object) || object.inspect().state === "";

[Survived] BlockStatement
q.js:1036:45
-   Promise.prototype.isFulfilled = function () {
-       return this.inspect().state === "fulfilled";
-   };
+   Promise.prototype.isFulfilled = function () {};

[Survived] ConditionalExpression
q.js:1037:12
-       return this.inspect().state === "fulfilled";
+       return true;

[Survived] ConditionalExpression
q.js:1037:12
-       return this.inspect().state === "fulfilled";
+       return false;

[Survived] EqualityOperator
q.js:1037:12
-       return this.inspect().state === "fulfilled";
+       return this.inspect().state !== "fulfilled";

[Survived] StringLiteral
q.js:1037:37
-       return this.inspect().state === "fulfilled";
+       return this.inspect().state === "";

[Survived] BlockStatement
q.js:1044:29
-   function isRejected(object) {
-       return isPromise(object) && object.inspect().state === "rejected";
-   }
+   function isRejected(object) {}

[Survived] ConditionalExpression
q.js:1045:12
-       return isPromise(object) && object.inspect().state === "rejected";
+       return true;

[Survived] ConditionalExpression
q.js:1045:12
-       return isPromise(object) && object.inspect().state === "rejected";
+       return false;

[Survived] LogicalOperator
q.js:1045:12
-       return isPromise(object) && object.inspect().state === "rejected";
+       return isPromise(object) || object.inspect().state === "rejected";

[Survived] ConditionalExpression
q.js:1045:33
-       return isPromise(object) && object.inspect().state === "rejected";
+       return isPromise(object) && true;

[Survived] EqualityOperator
q.js:1045:33
-       return isPromise(object) && object.inspect().state === "rejected";
+       return isPromise(object) && object.inspect().state !== "rejected";

[Survived] StringLiteral
q.js:1045:60
-       return isPromise(object) && object.inspect().state === "rejected";
+       return isPromise(object) && object.inspect().state === "";

[Survived] BlockStatement
q.js:1048:44
-   Promise.prototype.isRejected = function () {
-       return this.inspect().state === "rejected";
-   };
+   Promise.prototype.isRejected = function () {};

[Survived] ConditionalExpression
q.js:1049:12
-       return this.inspect().state === "rejected";
+       return true;

[Survived] ConditionalExpression
q.js:1049:12
-       return this.inspect().state === "rejected";
+       return false;

[Survived] EqualityOperator
q.js:1049:12
-       return this.inspect().state === "rejected";
+       return this.inspect().state !== "rejected";

[Survived] StringLiteral
q.js:1049:37
-       return this.inspect().state === "rejected";
+       return this.inspect().state === "";

[Survived] ArrayDeclaration
q.js:1058:24
-   var unhandledReasons = [];
+   var unhandledReasons = ["Stryker was here"];

[Survived] ArrayDeclaration
q.js:1059:27
-   var unhandledRejections = [];
+   var unhandledRejections = ["Stryker was here"];

[Survived] ArrayDeclaration
q.js:1060:35
-   var reportedUnhandledRejections = [];
+   var reportedUnhandledRejections = ["Stryker was here"];

[Survived] BooleanLiteral
q.js:1061:32
-   var trackUnhandledRejections = true;
+   var trackUnhandledRejections = false;

[Survived] BlockStatement
q.js:1063:37
-   function resetUnhandledRejections() {
-       unhandledReasons.length = 0;
-       unhandledRejections.length = 0;
-       if (!trackUnhandledRejections) {
-           trackUnhandledRejections = true;
-       }
-   }
+   function resetUnhandledRejections() {}

[Survived] ConditionalExpression
q.js:1067:9
-       if (!trackUnhandledRejections) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1067:9
-       if (!trackUnhandledRejections) {
+       if (false) {

[Survived] BlockStatement
q.js:1067:36
-       if (!trackUnhandledRejections) {
-           trackUnhandledRejections = true;
-       }
+       if (!trackUnhandledRejections) {}

[Survived] BooleanLiteral
q.js:1068:36
-           trackUnhandledRejections = true;
+           trackUnhandledRejections = false;

[Survived] BlockStatement
q.js:1072:42
-   function trackRejection(promise, reason) {
-       if (!trackUnhandledRejections) {
-           return;
-       }
-       if (typeof process === "object" && typeof process.emit === "function") {
-           Q.nextTick.runAfter(function () {
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
-                   process.emit("unhandledRejection", reason, promise);
-                   reportedUnhandledRejections.push(promise);
-               }
-           });
-       }
-       unhandledRejections.push(promise);
-       if (reason && typeof reason.stack !== "undefined") {
-           unhandledReasons.push(reason.stack);
-       } else {
-           unhandledReasons.push("(no stack) " + reason);
-       }
-   }
+   function trackRejection(promise, reason) {}

[Survived] ConditionalExpression
q.js:1073:9
-       if (!trackUnhandledRejections) {
+       if (false) {

[Survived] BlockStatement
q.js:1073:36
-       if (!trackUnhandledRejections) {
-           return;
-       }
+       if (!trackUnhandledRejections) {}

[Survived] ConditionalExpression
q.js:1076:9
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (true) {

[Survived] ConditionalExpression
q.js:1076:9
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (false) {

[Survived] LogicalOperator
q.js:1076:9
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process === "object" || typeof process.emit === "function") {

[Survived] ConditionalExpression
q.js:1076:9
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (true && typeof process.emit === "function") {

[Survived] EqualityOperator
q.js:1076:9
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process !== "object" && typeof process.emit === "function") {

[Survived] StringLiteral
q.js:1076:28
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process === "" && typeof process.emit === "function") {

[Survived] ConditionalExpression
q.js:1076:40
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process === "object" && true) {

[Survived] EqualityOperator
q.js:1076:40
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process === "object" && typeof process.emit !== "function") {

[Survived] StringLiteral
q.js:1076:64
-       if (typeof process === "object" && typeof process.emit === "function") {
+       if (typeof process === "object" && typeof process.emit === "") {

[Survived] BlockStatement
q.js:1076:76
-       if (typeof process === "object" && typeof process.emit === "function") {
-           Q.nextTick.runAfter(function () {
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
-                   process.emit("unhandledRejection", reason, promise);
-                   reportedUnhandledRejections.push(promise);
-               }
-           });
-       }
+       if (typeof process === "object" && typeof process.emit === "function") {}

[Survived] BlockStatement
q.js:1077:41
-           Q.nextTick.runAfter(function () {
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
-                   process.emit("unhandledRejection", reason, promise);
-                   reportedUnhandledRejections.push(promise);
-               }
-           });
+           Q.nextTick.runAfter(function () {});

[Survived] ConditionalExpression
q.js:1078:17
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
+               if (true) {

[Survived] ConditionalExpression
q.js:1078:17
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
+               if (false) {

[Survived] UnaryOperator
q.js:1078:65
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
+               if (array_indexOf(unhandledRejections, promise) !== +1) {

[Survived] BlockStatement
q.js:1078:69
-               if (array_indexOf(unhandledRejections, promise) !== -1) {
-                   process.emit("unhandledRejection", reason, promise);
-                   reportedUnhandledRejections.push(promise);
-               }
+               if (array_indexOf(unhandledRejections, promise) !== -1) {}

[Survived] StringLiteral
q.js:1079:30
-                   process.emit("unhandledRejection", reason, promise);
+                   process.emit("", reason, promise);

[Survived] ConditionalExpression
q.js:1086:9
-       if (reason && typeof reason.stack !== "undefined") {
+       if (false) {

[Survived] ConditionalExpression
q.js:1086:19
-       if (reason && typeof reason.stack !== "undefined") {
+       if (reason && true) {

[Survived] EqualityOperator
q.js:1086:19
-       if (reason && typeof reason.stack !== "undefined") {
+       if (reason && typeof reason.stack === "undefined") {

[Survived] StringLiteral
q.js:1086:43
-       if (reason && typeof reason.stack !== "undefined") {
+       if (reason && typeof reason.stack !== "") {

[Survived] BlockStatement
q.js:1086:56
-       if (reason && typeof reason.stack !== "undefined") {
-           unhandledReasons.push(reason.stack);
-       } else {
+       if (reason && typeof reason.stack !== "undefined") {} else {

[Survived] BlockStatement
q.js:1088:12
-       } else {
-           unhandledReasons.push("(no stack) " + reason);
-       }
+       } else {}

[Survived] StringLiteral
q.js:1089:31
-           unhandledReasons.push("(no stack) " + reason);
+           unhandledReasons.push("" + reason);

[Survived] BlockStatement
q.js:1093:36
-   function untrackRejection(promise) {
-       if (!trackUnhandledRejections) {
-           return;
-       }
-       var at = array_indexOf(unhandledRejections, promise);
-       if (at !== -1) {
-           if (typeof process === "object" && typeof process.emit === "function") {
-               Q.nextTick.runAfter(function () {
-                   var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                   if (atReport !== -1) {
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
-                       reportedUnhandledRejections.splice(atReport, 1);
-                   }
-               });
-           }
-           unhandledRejections.splice(at, 1);
-           unhandledReasons.splice(at, 1);
-       }
-   }
+   function untrackRejection(promise) {}

[Survived] ConditionalExpression
q.js:1094:9
-       if (!trackUnhandledRejections) {
+       if (false) {

[Survived] BlockStatement
q.js:1094:36
-       if (!trackUnhandledRejections) {
-           return;
-       }
+       if (!trackUnhandledRejections) {}

[Survived] ConditionalExpression
q.js:1099:9
-       if (at !== -1) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1099:9
-       if (at !== -1) {
+       if (false) {

[Survived] UnaryOperator
q.js:1099:16
-       if (at !== -1) {
+       if (at !== +1) {

[Survived] BlockStatement
q.js:1099:20
-       if (at !== -1) {
-           if (typeof process === "object" && typeof process.emit === "function") {
-               Q.nextTick.runAfter(function () {
-                   var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                   if (atReport !== -1) {
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
-                       reportedUnhandledRejections.splice(atReport, 1);
-                   }
-               });
-           }
-           unhandledRejections.splice(at, 1);
-           unhandledReasons.splice(at, 1);
-       }
+       if (at !== -1) {}

[Survived] ConditionalExpression
q.js:1100:13
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (true) {

[Survived] ConditionalExpression
q.js:1100:13
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (false) {

[Survived] LogicalOperator
q.js:1100:13
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process === "object" || typeof process.emit === "function") {

[Survived] ConditionalExpression
q.js:1100:13
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (true && typeof process.emit === "function") {

[Survived] EqualityOperator
q.js:1100:13
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process !== "object" && typeof process.emit === "function") {

[Survived] StringLiteral
q.js:1100:32
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process === "" && typeof process.emit === "function") {

[Survived] ConditionalExpression
q.js:1100:44
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process === "object" && true) {

[Survived] EqualityOperator
q.js:1100:44
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process === "object" && typeof process.emit !== "function") {

[Survived] StringLiteral
q.js:1100:68
-           if (typeof process === "object" && typeof process.emit === "function") {
+           if (typeof process === "object" && typeof process.emit === "") {

[Survived] BlockStatement
q.js:1100:80
-           if (typeof process === "object" && typeof process.emit === "function") {
-               Q.nextTick.runAfter(function () {
-                   var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                   if (atReport !== -1) {
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
-                       reportedUnhandledRejections.splice(atReport, 1);
-                   }
-               });
-           }
+           if (typeof process === "object" && typeof process.emit === "function") {}

[Survived] BlockStatement
q.js:1101:45
-               Q.nextTick.runAfter(function () {
-                   var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                   if (atReport !== -1) {
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
-                       reportedUnhandledRejections.splice(atReport, 1);
-                   }
-               });
+               Q.nextTick.runAfter(function () {});

[Survived] ConditionalExpression
q.js:1103:21
-                   if (atReport !== -1) {
+                   if (true) {

[Survived] ConditionalExpression
q.js:1103:21
-                   if (atReport !== -1) {
+                   if (false) {

[Survived] UnaryOperator
q.js:1103:34
-                   if (atReport !== -1) {
+                   if (atReport !== +1) {

[Survived] BlockStatement
q.js:1103:38
-                   if (atReport !== -1) {
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
-                       reportedUnhandledRejections.splice(atReport, 1);
-                   }
+                   if (atReport !== -1) {}

[Survived] StringLiteral
q.js:1104:34
-                       process.emit("rejectionHandled", unhandledReasons[at], promise);
+                       process.emit("", unhandledReasons[at], promise);

[Survived] BlockStatement
q.js:1116:37
-   Q.getUnhandledReasons = function () {
-       // Make a copy so that consumers can't interfere with our internal state.
-       return unhandledReasons.slice();
-   };
+   Q.getUnhandledReasons = function () {};

[Survived] MethodExpression
q.js:1118:12
-       return unhandledReasons.slice();
+       return unhandledReasons;

[Survived] BlockStatement
q.js:1121:48
-   Q.stopUnhandledRejectionTracking = function () {
-       resetUnhandledRejections();
-       trackUnhandledRejections = false;
-   };
+   Q.stopUnhandledRejectionTracking = function () {};

[Survived] BooleanLiteral
q.js:1123:32
-       trackUnhandledRejections = false;
+       trackUnhandledRejections = true;

[Survived] BlockStatement
q.js:1139:27
-               if (rejected) {
-                   untrackRejection(this);
-               }
+               if (rejected) {}

[Survived] BlockStatement
q.js:1144:28
-       }, function fallback() {
-           return this;
-       }, function inspect() {
+       }, function fallback() {}, function inspect() {

[Survived] ObjectLiteral
q.js:1147:16
-           return { state: "rejected", reason: reason };
+           return {};

[Survived] StringLiteral
q.js:1147:25
-           return { state: "rejected", reason: reason };
+           return { state: "", reason: reason };

[Survived] BlockStatement
q.js:1166:32
-           "get": function (name) {
-               return value[name];
-           },
+           "get": function (name) {},

[Survived] BlockStatement
q.js:1169:37
-           "set": function (name, rhs) {
-               value[name] = rhs;
-           },
+           "set": function (name, rhs) {},

[Survived] BlockStatement
q.js:1172:35
-           "delete": function (name) {
-               delete value[name];
-           },
+           "delete": function (name) {},

[Survived] BlockStatement
q.js:1175:39
-           "post": function (name, args) {
-               // Mark Miller proposes that post with no name should apply a
-               // promised function.
-               if (name === null || name === void 0) {
-                   return value.apply(void 0, args);
-               } else {
-                   return value[name].apply(value, args);
-               }
-           },
+           "post": function (name, args) {},

[Survived] ConditionalExpression
q.js:1178:17
-               if (name === null || name === void 0) {
+               if (true) {

[Survived] ConditionalExpression
q.js:1178:17
-               if (name === null || name === void 0) {
+               if (false) {

[Survived] LogicalOperator
q.js:1178:17
-               if (name === null || name === void 0) {
+               if (name === null && name === void 0) {

[Survived] ConditionalExpression
q.js:1178:17
-               if (name === null || name === void 0) {
+               if (false || name === void 0) {

[Survived] EqualityOperator
q.js:1178:17
-               if (name === null || name === void 0) {
+               if (name !== null || name === void 0) {

[Survived] ConditionalExpression
q.js:1178:34
-               if (name === null || name === void 0) {
+               if (name === null || false) {

[Survived] EqualityOperator
q.js:1178:34
-               if (name === null || name === void 0) {
+               if (name === null || name !== void 0) {

[Survived] BlockStatement
q.js:1178:51
-               if (name === null || name === void 0) {
-                   return value.apply(void 0, args);
-               } else {
+               if (name === null || name === void 0) {} else {

[Survived] BlockStatement
q.js:1180:20
-               } else {
-                   return value[name].apply(value, args);
-               }
+               } else {}

[Survived] BlockStatement
q.js:1184:41
-           "apply": function (thisp, args) {
-               return value.apply(thisp, args);
-           },
+           "apply": function (thisp, args) {},

[Survived] BlockStatement
q.js:1187:29
-           "keys": function () {
-               return object_keys(value);
-           }
+           "keys": function () {}

[Survived] ObjectLiteral
q.js:1191:16
-           return { state: "fulfilled", value: value };
+           return {};

[Survived] StringLiteral
q.js:1191:25
-           return { state: "fulfilled", value: value };
+           return { state: "", value: value };

[Survived] BlockStatement
q.js:1205:29
-           } catch (exception) {
-               deferred.reject(exception);
-           }
+           } catch (exception) {}

[Survived] BlockStatement
q.js:1222:25
-   function master(object) {
-       return Promise({
-           "isDef": function () {}
-       }, function fallback(op, args) {
-           return dispatch(object, op, args);
-       }, function () {
-           return Q(object).inspect();
-       });
-   }
+   function master(object) {}

[Survived] ObjectLiteral
q.js:1223:20
-       return Promise({
-           "isDef": function () {}
-       }, function fallback(op, args) {
+       return Promise({}, function fallback(op, args) {

[Survived] BlockStatement
q.js:1225:36
-       }, function fallback(op, args) {
-           return dispatch(object, op, args);
-       }, function () {
+       }, function fallback(op, args) {}, function () {

[Survived] BlockStatement
q.js:1227:20
-       }, function () {
-           return Q(object).inspect();
-       });
+       }, function () {});

[Survived] BlockStatement
q.js:1243:45
-   function spread(value, fulfilled, rejected) {
-       return Q(value).spread(fulfilled, rejected);
-   }
+   function spread(value, fulfilled, rejected) {}

[Survived] BlockStatement
q.js:1247:59
-   Promise.prototype.spread = function (fulfilled, rejected) {
-       return this.all().then(function (array) {
-           return fulfilled.apply(void 0, array);
-       }, rejected);
-   };
+   Promise.prototype.spread = function (fulfilled, rejected) {};

[Survived] BlockStatement
q.js:1248:45
-       return this.all().then(function (array) {
-           return fulfilled.apply(void 0, array);
-       }, rejected);
+       return this.all().then(function (array) {}, rejected);

[Survived] ConditionalExpression
q.js:1295:17
-               if (typeof StopIteration === "undefined") {
+               if (true) {

[Survived] StringLiteral
q.js:1295:42
-               if (typeof StopIteration === "undefined") {
+               if (typeof StopIteration === "") {

[Survived] BlockStatement
q.js:1295:55
-               if (typeof StopIteration === "undefined") {
-                   // ES6 Generators
-                   try {
-                       result = generator[verb](arg);
-                   } catch (exception) {
-                       return reject(exception);
-                   }
-                   if (result.done) {
-                       return Q(result.value);
-                   } else {
-                       return when(result.value, callback, errback);
-                   }
-               } else {
+               if (typeof StopIteration === "undefined") {} else {

[Survived] BlockStatement
q.js:1297:21
-                   try {
-                       result = generator[verb](arg);
-                   } catch (exception) {
+                   try {} catch (exception) {

[Survived] BlockStatement
q.js:1299:37
-                   } catch (exception) {
-                       return reject(exception);
-                   }
+                   } catch (exception) {}

[Survived] ConditionalExpression
q.js:1302:21
-                   if (result.done) {
+                   if (true) {

[Survived] ConditionalExpression
q.js:1302:21
-                   if (result.done) {
+                   if (false) {
