[Survived] BlockStatement
q.js:1302:34
-                   if (result.done) {
-                       return Q(result.value);
-                   } else {
+                   if (result.done) {} else {

[Survived] BlockStatement
q.js:1304:24
-                   } else {
-                       return when(result.value, callback, errback);
-                   }
+                   } else {}

[Survived] BlockStatement
q.js:1307:20
-               } else {
-                   // SpiderMonkey Generators
-                   // FIXME: Remove this case when SM does ES6 generators.
-                   try {
-                       result = generator[verb](arg);
-                   } catch (exception) {
-                       if (isStopIteration(exception)) {
-                           return Q(exception.value);
-                       } else {
-                           return reject(exception);
-                       }
-                   }
-                   return when(result, callback, errback);
-               }
+               } else {}

[Survived] BlockStatement
q.js:1310:21
-                   try {
-                       result = generator[verb](arg);
-                   } catch (exception) {
+                   try {} catch (exception) {

[Survived] BlockStatement
q.js:1312:37
-                   } catch (exception) {
-                       if (isStopIteration(exception)) {
-                           return Q(exception.value);
-                       } else {
-                           return reject(exception);
-                       }
-                   }
+                   } catch (exception) {}

[Survived] ConditionalExpression
q.js:1313:25
-                       if (isStopIteration(exception)) {
+                       if (true) {

[Survived] ConditionalExpression
q.js:1313:25
-                       if (isStopIteration(exception)) {
+                       if (false) {

[Survived] BlockStatement
q.js:1313:53
-                       if (isStopIteration(exception)) {
-                           return Q(exception.value);
-                       } else {
+                       if (isStopIteration(exception)) {} else {

[Survived] BlockStatement
q.js:1315:28
-                       } else {
-                           return reject(exception);
-                       }
+                       } else {}

[Survived] StringLiteral
q.js:1323:50
-           var callback = continuer.bind(continuer, "next");
+           var callback = continuer.bind(continuer, "");

[Survived] StringLiteral
q.js:1324:49
-           var errback = continuer.bind(continuer, "throw");
+           var errback = continuer.bind(continuer, "");

[Survived] BlockStatement
q.js:1337:31
-   function spawn(makeGenerator) {
-       Q.done(Q.async(makeGenerator)());
-   }
+   function spawn(makeGenerator) {}

[Survived] StringLiteral
q.js:1366:3
-   Q["return"] = _return;
+   Q[""] = _return;

[Survived] BlockStatement
q.js:1367:25
-   function _return(value) {
-       throw new QReturnValue(value);
-   }
+   function _return(value) {}

[Survived] BlockStatement
q.js:1387:29
-   function promised(callback) {
-       return function () {
-           return spread([this, all(arguments)], function (self, args) {
-               return callback.apply(self, args);
-           });
-       };
-   }
+   function promised(callback) {}

[Survived] BlockStatement
q.js:1388:24
-       return function () {
-           return spread([this, all(arguments)], function (self, args) {
-               return callback.apply(self, args);
-           });
-       };
+       return function () {};

[Survived] ArrayDeclaration
q.js:1389:23
-           return spread([this, all(arguments)], function (self, args) {
+           return spread([], function (self, args) {

[Survived] BlockStatement
q.js:1389:69
-           return spread([this, all(arguments)], function (self, args) {
-               return callback.apply(self, args);
-           });
+           return spread([this, all(arguments)], function (self, args) {});

[Survived] BlockStatement
q.js:1403:37
-   function dispatch(object, op, args) {
-       return Q(object).dispatch(op, args);
-   }
+   function dispatch(object, op, args) {}

[Survived] BlockStatement
q.js:1407:50
-   Promise.prototype.dispatch = function (op, args) {
-       var self = this;
-       var deferred = defer();
-       Q.nextTick(function () {
-           self.promiseDispatch(deferred.resolve, op, args);
-       });
-       return deferred.promise;
-   };
+   Promise.prototype.dispatch = function (op, args) {};

[Survived] BlockStatement
q.js:1410:28
-       Q.nextTick(function () {
-           self.promiseDispatch(deferred.resolve, op, args);
-       });
+       Q.nextTick(function () {});

[Survived] BlockStatement
q.js:1422:32
-   Q.get = function (object, key) {
-       return Q(object).dispatch("get", [key]);
-   };
+   Q.get = function (object, key) {};

[Survived] StringLiteral
q.js:1423:31
-       return Q(object).dispatch("get", [key]);
+       return Q(object).dispatch("", [key]);

[Survived] ArrayDeclaration
q.js:1423:38
-       return Q(object).dispatch("get", [key]);
+       return Q(object).dispatch("get", []);

[Survived] BlockStatement
q.js:1426:40
-   Promise.prototype.get = function (key) {
-       return this.dispatch("get", [key]);
-   };
+   Promise.prototype.get = function (key) {};

[Survived] StringLiteral
q.js:1427:26
-       return this.dispatch("get", [key]);
+       return this.dispatch("", [key]);

[Survived] ArrayDeclaration
q.js:1427:33
-       return this.dispatch("get", [key]);
+       return this.dispatch("get", []);

[Survived] BlockStatement
q.js:1437:39
-   Q.set = function (object, key, value) {
-       return Q(object).dispatch("set", [key, value]);
-   };
+   Q.set = function (object, key, value) {};

[Survived] StringLiteral
q.js:1438:31
-       return Q(object).dispatch("set", [key, value]);
+       return Q(object).dispatch("", [key, value]);

[Survived] ArrayDeclaration
q.js:1438:38
-       return Q(object).dispatch("set", [key, value]);
+       return Q(object).dispatch("set", []);

[Survived] BlockStatement
q.js:1441:47
-   Promise.prototype.set = function (key, value) {
-       return this.dispatch("set", [key, value]);
-   };
+   Promise.prototype.set = function (key, value) {};

[Survived] StringLiteral
q.js:1442:26
-       return this.dispatch("set", [key, value]);
+       return this.dispatch("", [key, value]);

[Survived] ArrayDeclaration
q.js:1442:33
-       return this.dispatch("set", [key, value]);
+       return this.dispatch("set", []);

[Survived] StringLiteral
q.js:1452:3
-   Q["delete"] = function (object, key) {
+   Q[""] = function (object, key) {

[Survived] BlockStatement
q.js:1452:38
-   Q["delete"] = function (object, key) {
-       return Q(object).dispatch("delete", [key]);
-   };
+   Q["delete"] = function (object, key) {};

[Survived] StringLiteral
q.js:1453:31
-       return Q(object).dispatch("delete", [key]);
+       return Q(object).dispatch("", [key]);

[Survived] StringLiteral
q.js:1457:19
-   Promise.prototype["delete"] = function (key) {
+   Promise.prototype[""] = function (key) {

[Survived] BlockStatement
q.js:1457:46
-   Promise.prototype["delete"] = function (key) {
-       return this.dispatch("delete", [key]);
-   };
+   Promise.prototype["delete"] = function (key) {};

[Survived] StringLiteral
q.js:1458:26
-       return this.dispatch("delete", [key]);
+       return this.dispatch("", [key]);

[Survived] ArrayDeclaration
q.js:1458:36
-       return this.dispatch("delete", [key]);
+       return this.dispatch("delete", []);

[Survived] BlockStatement
q.js:1475:40
-   Q.post = function (object, name, args) {
-       return Q(object).dispatch("post", [name, args]);
-   };
+   Q.post = function (object, name, args) {};

[Survived] StringLiteral
q.js:1476:31
-       return Q(object).dispatch("post", [name, args]);
+       return Q(object).dispatch("", [name, args]);

[Survived] ArrayDeclaration
q.js:1476:39
-       return Q(object).dispatch("post", [name, args]);
+       return Q(object).dispatch("post", []);

[Survived] BlockStatement
q.js:1480:48
-   Promise.prototype.post = function (name, args) {
-       return this.dispatch("post", [name, args]);
-   };
+   Promise.prototype.post = function (name, args) {};

[Survived] StringLiteral
q.js:1481:26
-       return this.dispatch("post", [name, args]);
+       return this.dispatch("", [name, args]);

[Survived] ArrayDeclaration
q.js:1481:34
-       return this.dispatch("post", [name, args]);
+       return this.dispatch("post", []);

[Survived] BlockStatement
q.js:1493:48
-   Q.invoke = function (object, name /*...args*/) {
-       return Q(object).dispatch("post", [name, array_slice(arguments, 2)]);
-   };
+   Q.invoke = function (object, name /*...args*/) {};

[Survived] StringLiteral
q.js:1494:31
-       return Q(object).dispatch("post", [name, array_slice(arguments, 2)]);
+       return Q(object).dispatch("", [name, array_slice(arguments, 2)]);

[Survived] ArrayDeclaration
q.js:1494:39
-       return Q(object).dispatch("post", [name, array_slice(arguments, 2)]);
+       return Q(object).dispatch("post", []);

[Survived] BlockStatement
q.js:1499:56
-   Promise.prototype.invoke = function (name /*...args*/) {
-       return this.dispatch("post", [name, array_slice(arguments, 1)]);
-   };
+   Promise.prototype.invoke = function (name /*...args*/) {};

[Survived] StringLiteral
q.js:1500:26
-       return this.dispatch("post", [name, array_slice(arguments, 1)]);
+       return this.dispatch("", [name, array_slice(arguments, 1)]);

[Survived] ArrayDeclaration
q.js:1500:34
-       return this.dispatch("post", [name, array_slice(arguments, 1)]);
+       return this.dispatch("post", []);

[Survived] BlockStatement
q.js:1508:36
-   Q.fapply = function (object, args) {
-       return Q(object).dispatch("apply", [void 0, args]);
-   };
+   Q.fapply = function (object, args) {};

[Survived] StringLiteral
q.js:1509:31
-       return Q(object).dispatch("apply", [void 0, args]);
+       return Q(object).dispatch("", [void 0, args]);

[Survived] ArrayDeclaration
q.js:1509:40
-       return Q(object).dispatch("apply", [void 0, args]);
+       return Q(object).dispatch("apply", []);

[Survived] BlockStatement
q.js:1512:44
-   Promise.prototype.fapply = function (args) {
-       return this.dispatch("apply", [void 0, args]);
-   };
+   Promise.prototype.fapply = function (args) {};

[Survived] StringLiteral
q.js:1513:26
-       return this.dispatch("apply", [void 0, args]);
+       return this.dispatch("", [void 0, args]);

[Survived] ArrayDeclaration
q.js:1513:35
-       return this.dispatch("apply", [void 0, args]);
+       return this.dispatch("apply", []);

[Survived] StringLiteral
q.js:1521:3
-   Q["try"] =
+   Q[""] =

[Survived] BlockStatement
q.js:1522:42
-   Q.fcall = function (object /* ...args*/) {
-       return Q(object).dispatch("apply", [void 0, array_slice(arguments, 1)]);
-   };
+   Q.fcall = function (object /* ...args*/) {};

[Survived] StringLiteral
q.js:1523:31
-       return Q(object).dispatch("apply", [void 0, array_slice(arguments, 1)]);
+       return Q(object).dispatch("", [void 0, array_slice(arguments, 1)]);

[Survived] ArrayDeclaration
q.js:1523:40
-       return Q(object).dispatch("apply", [void 0, array_slice(arguments, 1)]);
+       return Q(object).dispatch("apply", []);

[Survived] BlockStatement
q.js:1526:50
-   Promise.prototype.fcall = function (/*...args*/) {
-       return this.dispatch("apply", [void 0, array_slice(arguments)]);
-   };
+   Promise.prototype.fcall = function (/*...args*/) {};

[Survived] StringLiteral
q.js:1527:26
-       return this.dispatch("apply", [void 0, array_slice(arguments)]);
+       return this.dispatch("", [void 0, array_slice(arguments)]);

[Survived] ArrayDeclaration
q.js:1527:35
-       return this.dispatch("apply", [void 0, array_slice(arguments)]);
+       return this.dispatch("apply", []);

[Survived] BlockStatement
q.js:1536:41
-   Q.fbind = function (object /*...args*/) {
-       var promise = Q(object);
-       var args = array_slice(arguments, 1);
-       return function fbound() {
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
-       };
-   };
+   Q.fbind = function (object /*...args*/) {};

[Survived] BlockStatement
q.js:1539:30
-       return function fbound() {
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
-       };
+       return function fbound() {};

[Survived] StringLiteral
q.js:1540:33
-           return promise.dispatch("apply", [
+           return promise.dispatch("", [

[Survived] ArrayDeclaration
q.js:1540:42
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
+           return promise.dispatch("apply", []);

[Survived] BlockStatement
q.js:1546:50
-   Promise.prototype.fbind = function (/*...args*/) {
-       var promise = this;
-       var args = array_slice(arguments);
-       return function fbound() {
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
-       };
-   };
+   Promise.prototype.fbind = function (/*...args*/) {};

[Survived] BlockStatement
q.js:1549:30
-       return function fbound() {
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
-       };
+       return function fbound() {};

[Survived] StringLiteral
q.js:1550:33
-           return promise.dispatch("apply", [
+           return promise.dispatch("", [

[Survived] ArrayDeclaration
q.js:1550:42
-           return promise.dispatch("apply", [
-               this,
-               args.concat(array_slice(arguments))
-           ]);
+           return promise.dispatch("apply", []);

[Survived] BlockStatement
q.js:1563:28
-   Q.keys = function (object) {
-       return Q(object).dispatch("keys", []);
-   };
+   Q.keys = function (object) {};

[Survived] StringLiteral
q.js:1564:31
-       return Q(object).dispatch("keys", []);
+       return Q(object).dispatch("", []);

[Survived] ArrayDeclaration
q.js:1564:39
-       return Q(object).dispatch("keys", []);
+       return Q(object).dispatch("keys", ["Stryker was here"]);

[Survived] BlockStatement
q.js:1567:38
-   Promise.prototype.keys = function () {
-       return this.dispatch("keys", []);
-   };
+   Promise.prototype.keys = function () {};

[Survived] StringLiteral
q.js:1568:26
-       return this.dispatch("keys", []);
+       return this.dispatch("", []);

[Survived] ArrayDeclaration
q.js:1568:34
-       return this.dispatch("keys", []);
+       return this.dispatch("keys", ["Stryker was here"]);

[Survived] BlockStatement
q.js:1585:69
-           array_reduce(promises, function (undefined, promise, index) {
-               var snapshot;
-               if (
-                   isPromise(promise) &&
-                   (snapshot = promise.inspect()).state === "fulfilled"
-               ) {
-                   promises[index] = snapshot.value;
-               } else {
-                   ++pendingCount;
-                   when(
-                       promise,
-                       function (value) {
-                           promises[index] = value;
-                           if (--pendingCount === 0) {
-                               deferred.resolve(promises);
-                           }
-                       },
-                       deferred.reject,
-                       function (progress) {
-                           deferred.notify({ index: index, value: progress });
-                       }
-                   );
-               }
-           }, void 0);
+           array_reduce(promises, function (undefined, promise, index) {}, void 0);

[Survived] ConditionalExpression
q.js:1588:17
-                   isPromise(promise) &&
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   true

[Survived] ConditionalExpression
q.js:1588:17
-                   isPromise(promise) &&
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   false

[Survived] LogicalOperator
q.js:1588:17
-                   isPromise(promise) &&
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   isPromise(promise) || (snapshot = promise.inspect()).state === "fulfilled"

[Survived] ConditionalExpression
q.js:1589:17
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   true

[Survived] EqualityOperator
q.js:1589:17
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   (snapshot = promise.inspect()).state !== "fulfilled"

[Survived] StringLiteral
q.js:1589:58
-                   (snapshot = promise.inspect()).state === "fulfilled"
+                   (snapshot = promise.inspect()).state === ""

[Survived] BlockStatement
q.js:1590:15
-               ) {
-                   promises[index] = snapshot.value;
-               } else {
+               ) {} else {

[Survived] BlockStatement
q.js:1592:20
-               } else {
-                   ++pendingCount;
-                   when(
-                       promise,
-                       function (value) {
-                           promises[index] = value;
-                           if (--pendingCount === 0) {
-                               deferred.resolve(promises);
-                           }
-                       },
-                       deferred.reject,
-                       function (progress) {
-                           deferred.notify({ index: index, value: progress });
-                       }
-                   );
-               }
+               } else {}

[Survived] UpdateOperator
q.js:1593:17
-                   ++pendingCount;
+                   --pendingCount;

[Survived] BlockStatement
q.js:1596:38
-                       function (value) {
-                           promises[index] = value;
-                           if (--pendingCount === 0) {
-                               deferred.resolve(promises);
-                           }
-                       },
+                       function (value) {},

[Survived] ConditionalExpression
q.js:1598:29
-                           if (--pendingCount === 0) {
+                           if (true) {

[Survived] ConditionalExpression
q.js:1598:29
-                           if (--pendingCount === 0) {
+                           if (false) {

[Survived] EqualityOperator
q.js:1598:29
-                           if (--pendingCount === 0) {
+                           if (--pendingCount !== 0) {

[Survived] UpdateOperator
q.js:1598:29
-                           if (--pendingCount === 0) {
+                           if (++pendingCount === 0) {

[Survived] BlockStatement
q.js:1598:51
-                           if (--pendingCount === 0) {
-                               deferred.resolve(promises);
-                           }
+                           if (--pendingCount === 0) {}

[Survived] BlockStatement
q.js:1603:41
-                       function (progress) {
-                           deferred.notify({ index: index, value: progress });
-                       }
+                       function (progress) {}

[Survived] ObjectLiteral
q.js:1604:41
-                           deferred.notify({ index: index, value: progress });
+                           deferred.notify({});

[Survived] ConditionalExpression
q.js:1609:13
-           if (pendingCount === 0) {
+           if (true) {

[Survived] ConditionalExpression
q.js:1609:13
-           if (pendingCount === 0) {
+           if (false) {

[Survived] BlockStatement
q.js:1609:33
-           if (pendingCount === 0) {
-               deferred.resolve(promises);
-           }
+           if (pendingCount === 0) {}

[Survived] BlockStatement
q.js:1616:37
-   Promise.prototype.all = function () {
-       return all(this);
-   };
+   Promise.prototype.all = function () {};

[Survived] ConditionalExpression
q.js:1630:9
-       if (promises.length === 0) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1630:9
-       if (promises.length === 0) {
+       if (false) {

[Survived] BlockStatement
q.js:1630:32
-       if (promises.length === 0) {
-           return Q.resolve();
-       }
+       if (promises.length === 0) {}

[Survived] BlockStatement
q.js:1636:60
-       array_reduce(promises, function (prev, current, index) {
-           var promise = promises[index];
-           pendingCount++;
-           when(promise, onFulfilled, onRejected, onProgress);
-           function onFulfilled(result) {
-               deferred.resolve(result);
-           }
-           function onRejected(err) {
-               pendingCount--;
-               if (pendingCount === 0) {
-                   var rejection = err || new Error("" + err);
-                   rejection.message = ("Q can't get fulfillment value from any promise, all " +
-                       "promises were rejected. Last error message: " + rejection.message);
-                   deferred.reject(rejection);
-               }
-           }
-           function onProgress(progress) {
-               deferred.notify({
-                   index: index,
-                   value: progress
-               });
-           }
-       }, undefined);
+       array_reduce(promises, function (prev, current, index) {}, undefined);

[Survived] UpdateOperator
q.js:1639:9
-           pendingCount++;
+           pendingCount--;

[Survived] BlockStatement
q.js:1642:38
-           function onFulfilled(result) {
-               deferred.resolve(result);
-           }
+           function onFulfilled(result) {}

[Survived] BlockStatement
q.js:1645:34
-           function onRejected(err) {
-               pendingCount--;
-               if (pendingCount === 0) {
-                   var rejection = err || new Error("" + err);
-                   rejection.message = ("Q can't get fulfillment value from any promise, all " +
-                       "promises were rejected. Last error message: " + rejection.message);
-                   deferred.reject(rejection);
-               }
-           }
+           function onRejected(err) {}

[Survived] UpdateOperator
q.js:1646:13
-               pendingCount--;
+               pendingCount++;

[Survived] ConditionalExpression
q.js:1647:17
-               if (pendingCount === 0) {
+               if (true) {

[Survived] ConditionalExpression
q.js:1647:17
-               if (pendingCount === 0) {
+               if (false) {

[Survived] BlockStatement
q.js:1647:37
-               if (pendingCount === 0) {
-                   var rejection = err || new Error("" + err);
-                   rejection.message = ("Q can't get fulfillment value from any promise, all " +
-                       "promises were rejected. Last error message: " + rejection.message);
-                   deferred.reject(rejection);
-               }
+               if (pendingCount === 0) {}

[Survived] ConditionalExpression
q.js:1648:33
-                   var rejection = err || new Error("" + err);
+                   var rejection = true;

[Survived] ConditionalExpression
q.js:1648:33
-                   var rejection = err || new Error("" + err);
+                   var rejection = false;

[Survived] LogicalOperator
q.js:1648:33
-                   var rejection = err || new Error("" + err);
+                   var rejection = err && new Error("" + err);

[Survived] StringLiteral
q.js:1648:50
-                   var rejection = err || new Error("" + err);
+                   var rejection = err || new Error("Stryker was here!" + err);

[Survived] StringLiteral
q.js:1650:38
-                   rejection.message = ("Q can't get fulfillment value from any promise, all " +
+                   rejection.message = ("" +

[Survived] StringLiteral
q.js:1651:21
-                       "promises were rejected. Last error message: " + rejection.message);
+                       "" + rejection.message);

[Survived] BlockStatement
q.js:1656:39
-           function onProgress(progress) {
-               deferred.notify({
-                   index: index,
-                   value: progress
-               });
-           }
+           function onProgress(progress) {}

[Survived] ObjectLiteral
q.js:1657:29
-               deferred.notify({
-                   index: index,
-                   value: progress
-               });
+               deferred.notify({});

[Survived] BlockStatement
q.js:1667:37
-   Promise.prototype.any = function () {
-       return any(this);
-   };
+   Promise.prototype.any = function () {};

[Survived] StringLiteral
q.js:1680:40
-   Q.allResolved = deprecate(allResolved, "allResolved", "allSettled");
+   Q.allResolved = deprecate(allResolved, "", "allSettled");

[Survived] StringLiteral
q.js:1680:55
-   Q.allResolved = deprecate(allResolved, "allResolved", "allSettled");
+   Q.allResolved = deprecate(allResolved, "allResolved", "");

[Survived] BlockStatement
q.js:1681:32
-   function allResolved(promises) {
-       return when(promises, function (promises) {
-           promises = array_map(promises, Q);
-           return when(all(array_map(promises, function (promise) {
-               return when(promise, noop, noop);
-           })), function () {
-               return promises;
-           });
-       });
-   }
+   function allResolved(promises) {}

[Survived] BlockStatement
q.js:1682:47
-       return when(promises, function (promises) {
-           promises = array_map(promises, Q);
-           return when(all(array_map(promises, function (promise) {
-               return when(promise, noop, noop);
-           })), function () {
-               return promises;
-           });
-       });
+       return when(promises, function (promises) {});

[Survived] BlockStatement
q.js:1684:64
-           return when(all(array_map(promises, function (promise) {
-               return when(promise, noop, noop);
-           })), function () {
+           return when(all(array_map(promises, function (promise) {})), function () {

[Survived] BlockStatement
q.js:1686:26
-           })), function () {
-               return promises;
-           });
+           })), function () {});

[Survived] BlockStatement
q.js:1692:45
-   Promise.prototype.allResolved = function () {
-       return allResolved(this);
-   };
+   Promise.prototype.allResolved = function () {};

[Survived] BlockStatement
q.js:1700:31
-   function allSettled(promises) {
-       return Q(promises).allSettled();
-   }
+   function allSettled(promises) {}

[Survived] BlockStatement
q.js:1711:44
-   Promise.prototype.allSettled = function () {
-       return this.then(function (promises) {
-           return all(array_map(promises, function (promise) {
-               promise = Q(promise);
-               function regardless() {
-                   return promise.inspect();
-               }
-               return promise.then(regardless, regardless);
-           }));
-       });
-   };
+   Promise.prototype.allSettled = function () {};

[Survived] BlockStatement
q.js:1712:42
-       return this.then(function (promises) {
-           return all(array_map(promises, function (promise) {
-               promise = Q(promise);
-               function regardless() {
-                   return promise.inspect();
-               }
-               return promise.then(regardless, regardless);
-           }));
-       });
+       return this.then(function (promises) {});

[Survived] BlockStatement
q.js:1713:59
-           return all(array_map(promises, function (promise) {
-               promise = Q(promise);
-               function regardless() {
-                   return promise.inspect();
-               }
-               return promise.then(regardless, regardless);
-           }));
+           return all(array_map(promises, function (promise) {}));

[Survived] BlockStatement
q.js:1715:35
-               function regardless() {
-                   return promise.inspect();
-               }
+               function regardless() {}

[Survived] StringLiteral
q.js:1733:3
-   Q["catch"] = function (object, rejected) {
+   Q[""] = function (object, rejected) {

[Survived] BlockStatement
q.js:1733:42
-   Q["catch"] = function (object, rejected) {
-       return Q(object).then(void 0, rejected);
-   };
+   Q["catch"] = function (object, rejected) {};

[Survived] StringLiteral
q.js:1738:19
-   Promise.prototype["catch"] = function (rejected) {
+   Promise.prototype[""] = function (rejected) {

[Survived] BlockStatement
q.js:1738:50
-   Promise.prototype["catch"] = function (rejected) {
-       return this.then(void 0, rejected);
-   };
+   Promise.prototype["catch"] = function (rejected) {};

[Survived] BlockStatement
q.js:1751:39
-   function progress(object, progressed) {
-       return Q(object).then(void 0, void 0, progressed);
-   }
+   function progress(object, progressed) {}

[Survived] BlockStatement
q.js:1755:52
-   Promise.prototype.progress = function (progressed) {
-       return this.then(void 0, void 0, progressed);
-   };
+   Promise.prototype.progress = function (progressed) {};

[Survived] StringLiteral
q.js:1771:3
-   Q["finally"] = function (object, callback) {
+   Q[""] = function (object, callback) {

[Survived] BlockStatement
q.js:1771:44
-   Q["finally"] = function (object, callback) {
-       return Q(object)["finally"](callback);
-   };
+   Q["finally"] = function (object, callback) {};

[Survived] StringLiteral
q.js:1772:22
-       return Q(object)["finally"](callback);
+       return Q(object)[""](callback);
