[Survived] StringLiteral
q.js:1776:19
-   Promise.prototype["finally"] = function (callback) {
+   Promise.prototype[""] = function (callback) {

[Survived] BlockStatement
q.js:1776:52
-   Promise.prototype["finally"] = function (callback) {
-       if (!callback || typeof callback.apply !== "function") {
-           throw new Error("Q can't apply finally callback");
-       }
-       callback = Q(callback);
-       return this.then(function (value) {
-           return callback.fcall().then(function () {
-               return value;
-           });
-       }, function (reason) {
-           // TODO attempt to recycle the rejection with "this".
-           return callback.fcall().then(function () {
-               throw reason;
-           });
-       });
-   };
+   Promise.prototype["finally"] = function (callback) {};

[Survived] ConditionalExpression
q.js:1777:9
-       if (!callback || typeof callback.apply !== "function") {
+       if (true) {

[Survived] ConditionalExpression
q.js:1777:9
-       if (!callback || typeof callback.apply !== "function") {
+       if (false) {

[Survived] LogicalOperator
q.js:1777:9
-       if (!callback || typeof callback.apply !== "function") {
+       if (!callback && typeof callback.apply !== "function") {

[Survived] BooleanLiteral
q.js:1777:9
-       if (!callback || typeof callback.apply !== "function") {
+       if (callback || typeof callback.apply !== "function") {

[Survived] ConditionalExpression
q.js:1777:22
-       if (!callback || typeof callback.apply !== "function") {
+       if (!callback || false) {

[Survived] EqualityOperator
q.js:1777:22
-       if (!callback || typeof callback.apply !== "function") {
+       if (!callback || typeof callback.apply === "function") {

[Survived] StringLiteral
q.js:1777:48
-       if (!callback || typeof callback.apply !== "function") {
+       if (!callback || typeof callback.apply !== "") {

[Survived] BlockStatement
q.js:1777:60
-       if (!callback || typeof callback.apply !== "function") {
-           throw new Error("Q can't apply finally callback");
-       }
+       if (!callback || typeof callback.apply !== "function") {}

[Survived] StringLiteral
q.js:1778:25
-           throw new Error("Q can't apply finally callback");
+           throw new Error("");

[Survived] BlockStatement
q.js:1781:39
-       return this.then(function (value) {
-           return callback.fcall().then(function () {
-               return value;
-           });
-       }, function (reason) {
+       return this.then(function (value) {}, function (reason) {

[Survived] BlockStatement
q.js:1782:50
-           return callback.fcall().then(function () {
-               return value;
-           });
+           return callback.fcall().then(function () {});

[Survived] BlockStatement
q.js:1785:26
-       }, function (reason) {
-           // TODO attempt to recycle the rejection with "this".
-           return callback.fcall().then(function () {
-               throw reason;
-           });
-       });
+       }, function (reason) {});

[Survived] BlockStatement
q.js:1787:50
-           return callback.fcall().then(function () {
-               throw reason;
-           });
+           return callback.fcall().then(function () {});

[Survived] BlockStatement
q.js:1799:59
-   Q.done = function (object, fulfilled, rejected, progress) {
-       return Q(object).done(fulfilled, rejected, progress);
-   };
+   Q.done = function (object, fulfilled, rejected, progress) {};

[Survived] BlockStatement
q.js:1803:67
-   Promise.prototype.done = function (fulfilled, rejected, progress) {
-       var onUnhandledError = function (error) {
-           // forward to a future turn so that ``when``
-           // does not catch it and turn it into a rejection.
-           Q.nextTick(function () {
-               makeStackTraceLong(error, promise);
-               if (Q.onerror) {
-                   Q.onerror(error);
-               } else {
-                   throw error;
-               }
-           });
-       };
-       // Avoid unnecessary `nextTick`ing via an unnecessary `when`.
-       var promise = fulfilled || rejected || progress ?
-           this.then(fulfilled, rejected, progress) :
-           this;
-       if (typeof process === "object" && process && process.domain) {
-           onUnhandledError = process.domain.bind(onUnhandledError);
-       }
-       promise.then(void 0, onUnhandledError);
-   };
+   Promise.prototype.done = function (fulfilled, rejected, progress) {};

[Survived] BlockStatement
q.js:1804:45
-       var onUnhandledError = function (error) {
-           // forward to a future turn so that ``when``
-           // does not catch it and turn it into a rejection.
-           Q.nextTick(function () {
-               makeStackTraceLong(error, promise);
-               if (Q.onerror) {
-                   Q.onerror(error);
-               } else {
-                   throw error;
-               }
-           });
-       };
+       var onUnhandledError = function (error) {};

[Survived] BlockStatement
q.js:1807:32
-           Q.nextTick(function () {
-               makeStackTraceLong(error, promise);
-               if (Q.onerror) {
-                   Q.onerror(error);
-               } else {
-                   throw error;
-               }
-           });
+           Q.nextTick(function () {});

[Survived] ConditionalExpression
q.js:1809:17
-               if (Q.onerror) {
+               if (true) {

[Survived] ConditionalExpression
q.js:1809:17
-               if (Q.onerror) {
+               if (false) {

[Survived] BlockStatement
q.js:1809:28
-               if (Q.onerror) {
-                   Q.onerror(error);
-               } else {
+               if (Q.onerror) {} else {

[Survived] BlockStatement
q.js:1811:20
-               } else {
-                   throw error;
-               }
+               } else {}

[Survived] ConditionalExpression
q.js:1818:19
-       var promise = fulfilled || rejected || progress ?
+       var promise = true ?

[Survived] ConditionalExpression
q.js:1818:19
-       var promise = fulfilled || rejected || progress ?
+       var promise = false ?

[Survived] LogicalOperator
q.js:1818:19
-       var promise = fulfilled || rejected || progress ?
+       var promise = (fulfilled || rejected) && progress ?

[Survived] ConditionalExpression
q.js:1818:19
-       var promise = fulfilled || rejected || progress ?
+       var promise = false || progress ?

[Survived] LogicalOperator
q.js:1818:19
-       var promise = fulfilled || rejected || progress ?
+       var promise = fulfilled && rejected || progress ?

[Survived] ConditionalExpression
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (false) {

[Survived] LogicalOperator
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (typeof process === "object" && process || process.domain) {

[Survived] ConditionalExpression
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (true && process.domain) {

[Survived] LogicalOperator
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (typeof process === "object" || process && process.domain) {

[Survived] ConditionalExpression
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (true && process && process.domain) {

[Survived] EqualityOperator
q.js:1822:9
-       if (typeof process === "object" && process && process.domain) {
+       if (typeof process !== "object" && process && process.domain) {

[Survived] StringLiteral
q.js:1822:28
-       if (typeof process === "object" && process && process.domain) {
+       if (typeof process === "" && process && process.domain) {

[Survived] BlockStatement
q.js:1822:67
-       if (typeof process === "object" && process && process.domain) {
-           onUnhandledError = process.domain.bind(onUnhandledError);
-       }
+       if (typeof process === "object" && process && process.domain) {}

[Survived] BlockStatement
q.js:1838:42
-   Q.timeout = function (object, ms, error) {
-       return Q(object).timeout(ms, error);
-   };
+   Q.timeout = function (object, ms, error) {};

[Survived] BlockStatement
q.js:1842:50
-   Promise.prototype.timeout = function (ms, error) {
-       var deferred = defer();
-       var timeoutId = setTimeout(function () {
-           if (!error || "string" === typeof error) {
-               error = new Error(error || "Timed out after " + ms + " ms");
-               error.code = "ETIMEDOUT";
-           }
-           deferred.reject(error);
-       }, ms);
-       this.then(function (value) {
-           clearTimeout(timeoutId);
-           deferred.resolve(value);
-       }, function (exception) {
-           clearTimeout(timeoutId);
-           deferred.reject(exception);
-       }, deferred.notify);
-       return deferred.promise;
-   };
+   Promise.prototype.timeout = function (ms, error) {};

[Survived] BlockStatement
q.js:1844:44
-       var timeoutId = setTimeout(function () {
-           if (!error || "string" === typeof error) {
-               error = new Error(error || "Timed out after " + ms + " ms");
-               error.code = "ETIMEDOUT";
-           }
-           deferred.reject(error);
-       }, ms);
+       var timeoutId = setTimeout(function () {}, ms);

[Survived] ConditionalExpression
q.js:1845:13
-           if (!error || "string" === typeof error) {
+           if (true) {

[Survived] ConditionalExpression
q.js:1845:13
-           if (!error || "string" === typeof error) {
+           if (false) {

[Survived] LogicalOperator
q.js:1845:13
-           if (!error || "string" === typeof error) {
+           if (!error && "string" === typeof error) {

[Survived] ConditionalExpression
q.js:1845:23
-           if (!error || "string" === typeof error) {
+           if (!error || false) {

[Survived] EqualityOperator
q.js:1845:23
-           if (!error || "string" === typeof error) {
+           if (!error || "string" !== typeof error) {

[Survived] StringLiteral
q.js:1845:23
-           if (!error || "string" === typeof error) {
+           if (!error || "" === typeof error) {

[Survived] BlockStatement
q.js:1845:50
-           if (!error || "string" === typeof error) {
-               error = new Error(error || "Timed out after " + ms + " ms");
-               error.code = "ETIMEDOUT";
-           }
+           if (!error || "string" === typeof error) {}

[Survived] ConditionalExpression
q.js:1846:31
-               error = new Error(error || "Timed out after " + ms + " ms");
+               error = new Error(true);

[Survived] ConditionalExpression
q.js:1846:31
-               error = new Error(error || "Timed out after " + ms + " ms");
+               error = new Error(false);

[Survived] LogicalOperator
q.js:1846:31
-               error = new Error(error || "Timed out after " + ms + " ms");
+               error = new Error(error && "Timed out after " + ms + " ms");

[Survived] StringLiteral
q.js:1846:40
-               error = new Error(error || "Timed out after " + ms + " ms");
+               error = new Error(error || "" + ms + " ms");

[Survived] StringLiteral
q.js:1846:66
-               error = new Error(error || "Timed out after " + ms + " ms");
+               error = new Error(error || "Timed out after " + ms + "");

[Survived] StringLiteral
q.js:1847:26
-               error.code = "ETIMEDOUT";
+               error.code = "";

[Survived] BlockStatement
q.js:1852:32
-       this.then(function (value) {
-           clearTimeout(timeoutId);
-           deferred.resolve(value);
-       }, function (exception) {
+       this.then(function (value) {}, function (exception) {

[Survived] BlockStatement
q.js:1855:29
-       }, function (exception) {
-           clearTimeout(timeoutId);
-           deferred.reject(exception);
-       }, deferred.notify);
+       }, function (exception) {}, deferred.notify);

[Survived] BlockStatement
q.js:1872:38
-   Q.delay = function (object, timeout) {
-       if (timeout === void 0) {
-           timeout = object;
-           object = void 0;
-       }
-       return Q(object).delay(timeout);
-   };
+   Q.delay = function (object, timeout) {};

[Survived] ConditionalExpression
q.js:1873:9
-       if (timeout === void 0) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1873:9
-       if (timeout === void 0) {
+       if (false) {

[Survived] BlockStatement
q.js:1873:29
-       if (timeout === void 0) {
-           timeout = object;
-           object = void 0;
-       }
+       if (timeout === void 0) {}

[Survived] BlockStatement
q.js:1880:46
-   Promise.prototype.delay = function (timeout) {
-       return this.then(function (value) {
-           var deferred = defer();
-           setTimeout(function () {
-               deferred.resolve(value);
-           }, timeout);
-           return deferred.promise;
-       });
-   };
+   Promise.prototype.delay = function (timeout) {};

[Survived] BlockStatement
q.js:1881:39
-       return this.then(function (value) {
-           var deferred = defer();
-           setTimeout(function () {
-               deferred.resolve(value);
-           }, timeout);
-           return deferred.promise;
-       });
+       return this.then(function (value) {});

[Survived] BlockStatement
q.js:1883:32
-           setTimeout(function () {
-               deferred.resolve(value);
-           }, timeout);
+           setTimeout(function () {}, timeout);

[Survived] BlockStatement
q.js:1899:39
-   Q.nfapply = function (callback, args) {
-       return Q(callback).nfapply(args);
-   };
+   Q.nfapply = function (callback, args) {};

[Survived] BlockStatement
q.js:1903:45
-   Promise.prototype.nfapply = function (args) {
-       var deferred = defer();
-       var nodeArgs = array_slice(args);
-       nodeArgs.push(deferred.makeNodeResolver());
-       this.fapply(nodeArgs).fail(deferred.reject);
-       return deferred.promise;
-   };
+   Promise.prototype.nfapply = function (args) {};

[Survived] BlockStatement
q.js:1920:44
-   Q.nfcall = function (callback /*...args*/) {
-       var args = array_slice(arguments, 1);
-       return Q(callback).nfapply(args);
-   };
+   Q.nfcall = function (callback /*...args*/) {};

[Survived] BlockStatement
q.js:1925:51
-   Promise.prototype.nfcall = function (/*...args*/) {
-       var nodeArgs = array_slice(arguments);
-       var deferred = defer();
-       nodeArgs.push(deferred.makeNodeResolver());
-       this.fapply(nodeArgs).fail(deferred.reject);
-       return deferred.promise;
-   };
+   Promise.prototype.nfcall = function (/*...args*/) {};

[Survived] BlockStatement
q.js:1942:47
-   Q.denodeify = function (callback /*...args*/) {
-       if (callback === undefined) {
-           throw new Error("Q can't wrap an undefined function");
-       }
-       var baseArgs = array_slice(arguments, 1);
-       return function () {
-           var nodeArgs = baseArgs.concat(array_slice(arguments));
-           var deferred = defer();
-           nodeArgs.push(deferred.makeNodeResolver());
-           Q(callback).fapply(nodeArgs).fail(deferred.reject);
-           return deferred.promise;
-       };
-   };
+   Q.denodeify = function (callback /*...args*/) {};

[Survived] ConditionalExpression
q.js:1943:9
-       if (callback === undefined) {
+       if (true) {

[Survived] ConditionalExpression
q.js:1943:9
-       if (callback === undefined) {
+       if (false) {

[Survived] BlockStatement
q.js:1943:33
-       if (callback === undefined) {
-           throw new Error("Q can't wrap an undefined function");
-       }
+       if (callback === undefined) {}

[Survived] StringLiteral
q.js:1944:25
-           throw new Error("Q can't wrap an undefined function");
+           throw new Error("");

[Survived] BlockStatement
q.js:1947:24
-       return function () {
-           var nodeArgs = baseArgs.concat(array_slice(arguments));
-           var deferred = defer();
-           nodeArgs.push(deferred.makeNodeResolver());
-           Q(callback).fapply(nodeArgs).fail(deferred.reject);
-           return deferred.promise;
-       };
+       return function () {};

[Survived] BlockStatement
q.js:1957:54
-   Promise.prototype.denodeify = function (/*...args*/) {
-       var args = array_slice(arguments);
-       args.unshift(this);
-       return Q.denodeify.apply(void 0, args);
-   };
+   Promise.prototype.denodeify = function (/*...args*/) {};

[Survived] BlockStatement
q.js:1963:50
-   Q.nbind = function (callback, thisp /*...args*/) {
-       var baseArgs = array_slice(arguments, 2);
-       return function () {
-           var nodeArgs = baseArgs.concat(array_slice(arguments));
-           var deferred = defer();
-           nodeArgs.push(deferred.makeNodeResolver());
-           function bound() {
-               return callback.apply(thisp, arguments);
-           }
-           Q(bound).fapply(nodeArgs).fail(deferred.reject);
-           return deferred.promise;
-       };
-   };
+   Q.nbind = function (callback, thisp /*...args*/) {};

[Survived] BlockStatement
q.js:1965:24
-       return function () {
-           var nodeArgs = baseArgs.concat(array_slice(arguments));
-           var deferred = defer();
-           nodeArgs.push(deferred.makeNodeResolver());
-           function bound() {
-               return callback.apply(thisp, arguments);
-           }
-           Q(bound).fapply(nodeArgs).fail(deferred.reject);
-           return deferred.promise;
-       };
+       return function () {};

[Survived] BlockStatement
q.js:1969:26
-           function bound() {
-               return callback.apply(thisp, arguments);
-           }
+           function bound() {}

[Survived] BlockStatement
q.js:1977:57
-   Promise.prototype.nbind = function (/*thisp, ...args*/) {
-       var args = array_slice(arguments, 0);
-       args.unshift(this);
-       return Q.nbind.apply(void 0, args);
-   };
+   Promise.prototype.nbind = function (/*thisp, ...args*/) {};

[Survived] BlockStatement
q.js:1993:41
-   Q.npost = function (object, name, args) {
-       return Q(object).npost(name, args);
-   };
+   Q.npost = function (object, name, args) {};

[Survived] BlockStatement
q.js:1998:49
-   Promise.prototype.npost = function (name, args) {
-       var nodeArgs = array_slice(args || []);
-       var deferred = defer();
-       nodeArgs.push(deferred.makeNodeResolver());
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-       return deferred.promise;
-   };
+   Promise.prototype.npost = function (name, args) {};

[Survived] ConditionalExpression
q.js:1999:32
-       var nodeArgs = array_slice(args || []);
+       var nodeArgs = array_slice(true);

[Survived] ConditionalExpression
q.js:1999:32
-       var nodeArgs = array_slice(args || []);
+       var nodeArgs = array_slice(false);

[Survived] ArrayDeclaration
q.js:1999:40
-       var nodeArgs = array_slice(args || []);
+       var nodeArgs = array_slice(args || ["Stryker was here"]);

[Survived] StringLiteral
q.js:2002:19
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       this.dispatch("", [name, nodeArgs]).fail(deferred.reject);

[Survived] ArrayDeclaration
q.js:2002:27
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       this.dispatch("post", []).fail(deferred.reject);

[Survived] BlockStatement
q.js:2018:49
-   Q.ninvoke = function (object, name /*...args*/) {
-       var nodeArgs = array_slice(arguments, 2);
-       var deferred = defer();
-       nodeArgs.push(deferred.makeNodeResolver());
-       Q(object).dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-       return deferred.promise;
-   };
+   Q.ninvoke = function (object, name /*...args*/) {};

[Survived] StringLiteral
q.js:2022:24
-       Q(object).dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       Q(object).dispatch("", [name, nodeArgs]).fail(deferred.reject);

[Survived] ArrayDeclaration
q.js:2022:32
-       Q(object).dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       Q(object).dispatch("post", []).fail(deferred.reject);

[Survived] BlockStatement
q.js:2028:57
-   Promise.prototype.ninvoke = function (name /*...args*/) {
-       var nodeArgs = array_slice(arguments, 1);
-       var deferred = defer();
-       nodeArgs.push(deferred.makeNodeResolver());
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-       return deferred.promise;
-   };
+   Promise.prototype.ninvoke = function (name /*...args*/) {};

[Survived] StringLiteral
q.js:2032:19
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       this.dispatch("", [name, nodeArgs]).fail(deferred.reject);

[Survived] ArrayDeclaration
q.js:2032:27
-       this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+       this.dispatch("post", []).fail(deferred.reject);

[Survived] BlockStatement
q.js:2047:36
-   function nodeify(object, nodeback) {
-       return Q(object).nodeify(nodeback);
-   }
+   function nodeify(object, nodeback) {}

[Survived] BlockStatement
q.js:2051:49
-   Promise.prototype.nodeify = function (nodeback) {
-       if (nodeback) {
-           this.then(function (value) {
-               Q.nextTick(function () {
-                   nodeback(null, value);
-               });
-           }, function (error) {
-               Q.nextTick(function () {
-                   nodeback(error);
-               });
-           });
-       } else {
-           return this;
-       }
-   };
+   Promise.prototype.nodeify = function (nodeback) {};

[Survived] BlockStatement
q.js:2052:19
-       if (nodeback) {
-           this.then(function (value) {
-               Q.nextTick(function () {
-                   nodeback(null, value);
-               });
-           }, function (error) {
-               Q.nextTick(function () {
-                   nodeback(error);
-               });
-           });
-       } else {
+       if (nodeback) {} else {

[Survived] BlockStatement
q.js:2053:36
-           this.then(function (value) {
-               Q.nextTick(function () {
-                   nodeback(null, value);
-               });
-           }, function (error) {
+           this.then(function (value) {}, function (error) {

[Survived] BlockStatement
q.js:2054:36
-               Q.nextTick(function () {
-                   nodeback(null, value);
-               });
+               Q.nextTick(function () {});

[Survived] BlockStatement
q.js:2057:29
-           }, function (error) {
-               Q.nextTick(function () {
-                   nodeback(error);
-               });
-           });
+           }, function (error) {});

[Survived] BlockStatement
q.js:2058:36
-               Q.nextTick(function () {
-                   nodeback(error);
-               });
+               Q.nextTick(function () {});

[Survived] BlockStatement
q.js:2062:12
-       } else {
-           return this;
-       }
+       } else {}

[Survived] BlockStatement
q.js:2067:27
-   Q.noConflict = function() {
-       throw new Error("Q.noConflict only works when Q is used as a global");
-   };
+   Q.noConflict = function() {};

[Survived] StringLiteral
q.js:2068:21
-       throw new Error("Q.noConflict only works when Q is used as a global");
+       throw new Error("");

[Survived] ObjectLiteral
queue.js:8:12
-       return {
-           put: function (value) {
-               var next = Q.defer();
-               ends.resolve({
-                   head: value,
-                   tail: next.promise
-               });
-               ends.resolve = next.resolve;
-           },
-           get: function () {
-               var result = ends.promise.get("head");
-               ends.promise = ends.promise.get("tail");
-               return result.fail(function (error) {
-                   closed.resolve(error);
-                   throw error;
-               });
-           },
-           closed: closed.promise,
-           close: function (error) {
-               error = error || new Error("Can't get value from closed queue");
-               var end = {head: Q.reject(error)};
-               end.tail = end;
-               ends.resolve(end);
-               return closed.promise;
-           }
-       };
+       return {};

[Survived] BlockStatement
queue.js:9:31
-           put: function (value) {
-               var next = Q.defer();
-               ends.resolve({
-                   head: value,
-                   tail: next.promise
-               });
-               ends.resolve = next.resolve;
-           },
+           put: function (value) {},

[Survived] ObjectLiteral
queue.js:11:26
-               ends.resolve({
-                   head: value,
-                   tail: next.promise
-               });
+               ends.resolve({});

[Survived] BlockStatement
queue.js:17:26
-           get: function () {
-               var result = ends.promise.get("head");
-               ends.promise = ends.promise.get("tail");
-               return result.fail(function (error) {
-                   closed.resolve(error);
-                   throw error;
-               });
-           },
+           get: function () {},

[Survived] StringLiteral
queue.js:18:43
-               var result = ends.promise.get("head");
+               var result = ends.promise.get("");

[Survived] StringLiteral
queue.js:19:45
-               ends.promise = ends.promise.get("tail");
+               ends.promise = ends.promise.get("");

[Survived] BlockStatement
queue.js:20:49
-               return result.fail(function (error) {
-                   closed.resolve(error);
-                   throw error;
-               });
+               return result.fail(function (error) {});

[Survived] BlockStatement
queue.js:26:33
-           close: function (error) {
-               error = error || new Error("Can't get value from closed queue");
-               var end = {head: Q.reject(error)};
-               end.tail = end;
-               ends.resolve(end);
-               return closed.promise;
-           }
+           close: function (error) {}

[Survived] ConditionalExpression
queue.js:27:21
-               error = error || new Error("Can't get value from closed queue");
+               error = true;

[Survived] ConditionalExpression
queue.js:27:21
-               error = error || new Error("Can't get value from closed queue");
+               error = false;

[Survived] LogicalOperator
queue.js:27:21
-               error = error || new Error("Can't get value from closed queue");
+               error = error && new Error("Can't get value from closed queue");

[Survived] StringLiteral
queue.js:27:40
-               error = error || new Error("Can't get value from closed queue");
+               error = error || new Error("");

[Survived] ObjectLiteral
queue.js:28:23
-               var end = {head: Q.reject(error)};
+               var end = {};
