[Killed] EqualityOperator
q.js:38:9
     // executed as a simple <script>, it creates a Q global instead.
 
     // Montage Require
-    if (typeof bootstrap === "function") {
+    if (typeof bootstrap !== "function") {
         bootstrap("promise", definition);
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:38:9
     // executed as a simple <script>, it creates a Q global instead.
 
     // Montage Require
-    if (typeof bootstrap === "function") {
+    if (true) {
         bootstrap("promise", definition);
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] BlockStatement
q.js:42:75
         bootstrap("promise", definition);
 
     // CommonJS
-    } else if (typeof exports === "object" && typeof module === "object") {
-        module.exports = definition();
-
-    // RequireJS
-    } else if (typeof define === "function" && define.amd) {
+    } else if (typeof exports === "object" && typeof module === "object") {} else if (typeof define === "function" && define.amd) {
         define(definition);
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:42:16
         bootstrap("promise", definition);
 
     // CommonJS
-    } else if (typeof exports === "object" && typeof module === "object") {
+    } else if (false) {
         module.exports = definition();
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] EqualityOperator
q.js:46:16
         module.exports = definition();
 
     // RequireJS
-    } else if (typeof define === "function" && define.amd) {
+    } else if (typeof define !== "function" && define.amd) {
         define(definition);
 

[Survived] ConditionalExpression
q.js:46:16
         module.exports = definition();
 
     // RequireJS
-    } else if (typeof define === "function" && define.amd) {
+    } else if (true) {
         define(definition);
 

[Survived] BlockStatement
q.js:50:44
         define(definition);
 
     // SES (Secure EcmaScript)
-    } else if (typeof ses !== "undefined") {
-        if (!ses.ok()) {
-            return;
-        } else {
-            ses.makeQ = definition;
-        }
-
-    // <script>
-    } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+    } else if (typeof ses !== "undefined") {} else if (typeof window !== "undefined" || typeof self !== "undefined") {
         // Prefer window over self for add-on scripts. Use self for
         // non-windowed contexts.

[Survived] ConditionalExpression
q.js:50:16
         define(definition);
 
     // SES (Secure EcmaScript)
-    } else if (typeof ses !== "undefined") {
+    } else if (true) {
         if (!ses.ok()) {
             return;

[Survived] BlockStatement
q.js:51:24
 
     // SES (Secure EcmaScript)
     } else if (typeof ses !== "undefined") {
-        if (!ses.ok()) {
-            return;
-        } else {
+        if (!ses.ok()) {} else {
             ses.makeQ = definition;
         }

[Survived] ConditionalExpression
q.js:51:13
 
     // SES (Secure EcmaScript)
     } else if (typeof ses !== "undefined") {
-        if (!ses.ok()) {
+        if (false) {
             return;
         } else {

[Survived] BlockStatement
q.js:53:16
     } else if (typeof ses !== "undefined") {
         if (!ses.ok()) {
             return;
-        } else {
-            ses.makeQ = definition;
-        }
+        } else {}
 
     // <script>

[Survived] LogicalOperator
q.js:58:16
         }
 
     // <script>
-    } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+    } else if (typeof window !== "undefined" && typeof self !== "undefined") {
         // Prefer window over self for add-on scripts. Use self for
         // non-windowed contexts.

[Survived] EqualityOperator
q.js:58:49
         }
 
     // <script>
-    } else if (typeof window !== "undefined" || typeof self !== "undefined") {
+    } else if (typeof window !== "undefined" || typeof self === "undefined") {
         // Prefer window over self for add-on scripts. Use self for
         // non-windowed contexts.

[Survived] ConditionalExpression
q.js:61:22
     } else if (typeof window !== "undefined" || typeof self !== "undefined") {
         // Prefer window over self for add-on scripts. Use self for
         // non-windowed contexts.
-        var global = typeof window !== "undefined" ? window : self;
+        var global = false ? window : self;
 
         // Get the `window` object, save the previous Q global

[Survived] ConditionalExpression
q.js:61:22
     } else if (typeof window !== "undefined" || typeof self !== "undefined") {
         // Prefer window over self for add-on scripts. Use self for
         // non-windowed contexts.
-        var global = typeof window !== "undefined" ? window : self;
+        var global = true ? window : self;
 
         // Get the `window` object, save the previous Q global

[Survived] BlockStatement
q.js:70:43
 
         // Add a noConflict function so Q can be removed from the
         // global namespace.
-        global.Q.noConflict = function () {
-            global.Q = previousQ;
-            return this;
-        };
+        global.Q.noConflict = function () {};
 
     } else {

[Survived] BlockStatement
q.js:75:12
             return this;
         };
 
-    } else {
-        throw new Error("This environment was not anticipated by Q. Please file a bug.");
-    }
+    } else {}
 
 })(function () {

[Survived] BooleanLiteral
q.js:82:17
 })(function () {
 "use strict";
 
-var hasStacks = false;
+var hasStacks = true;
 try {
     throw new Error();

[Survived] BlockStatement
q.js:83:5
 "use strict";
 
 var hasStacks = false;
-try {
-    throw new Error();
-} catch (e) {
+try {} catch (e) {
     hasStacks = !!e.stack;
 }

[Survived] BlockStatement
q.js:85:13
 var hasStacks = false;
 try {
     throw new Error();
-} catch (e) {
-    hasStacks = !!e.stack;
-}
+} catch (e) {}
 
 // All code after this point will be filtered from stack traces reported

[Survived] BooleanLiteral
q.js:86:18
 try {
     throw new Error();
 } catch (e) {
-    hasStacks = !!e.stack;
+    hasStacks = !e.stack;
 }
 

[Timeout] BooleanLiteral
q.js:105:20
     // linked list of tasks (single, with head node)
     var head = {task: void 0, next: null};
     var tail = head;
-    var flushing = false;
+    var flushing = true;
     var requestTick = void 0;
     var isNodeJS = false;

[Survived] BooleanLiteral
q.js:107:20
     var tail = head;
     var flushing = false;
     var requestTick = void 0;
-    var isNodeJS = false;
+    var isNodeJS = true;
     // queue for late tasks, used by unhandled rejection tracking
     var laterQueue = [];

[Survived] ArrayDeclaration
q.js:109:22
     var requestTick = void 0;
     var isNodeJS = false;
     // queue for late tasks, used by unhandled rejection tracking
-    var laterQueue = [];
+    var laterQueue = ["Stryker was here"];
 
     function flush() {

[Timeout] BlockStatement
q.js:111:22
     // queue for late tasks, used by unhandled rejection tracking
     var laterQueue = [];
 
-    function flush() {
-        /* jshint loopfunc: true */
-        var task, domain;
-
-        while (head.next) {
-            head = head.next;
-            task = head.task;
-            head.task = void 0;
-            domain = head.domain;
-
-            if (domain) {
-                head.domain = void 0;
-                domain.enter();
-            }
-            runSingle(task, domain);
-
-        }
-        while (laterQueue.length) {
-            task = laterQueue.pop();
-            runSingle(task);
-        }
-        flushing = false;
-    }
+    function flush() {}
     // runs a single function in the async queue
     function runSingle(task, domain) {

[Timeout] BlockStatement
q.js:115:27
         /* jshint loopfunc: true */
         var task, domain;
 
-        while (head.next) {
-            head = head.next;
-            task = head.task;
-            head.task = void 0;
-            domain = head.domain;
-
-            if (domain) {
-                head.domain = void 0;
-                domain.enter();
-            }
-            runSingle(task, domain);
-
-        }
+        while (head.next) {}
         while (laterQueue.length) {
             task = laterQueue.pop();

[Timeout] ConditionalExpression
q.js:115:16
         /* jshint loopfunc: true */
         var task, domain;
 
-        while (head.next) {
+        while (false) {
             head = head.next;
             task = head.task;

[Timeout] ConditionalExpression
q.js:121:17
             head.task = void 0;
             domain = head.domain;
 
-            if (domain) {
+            if (true) {
                 head.domain = void 0;
                 domain.enter();

[Survived] ConditionalExpression
q.js:121:17
             head.task = void 0;
             domain = head.domain;
 
-            if (domain) {
+            if (false) {
                 head.domain = void 0;
                 domain.enter();

[Survived] ConditionalExpression
q.js:128:16
             runSingle(task, domain);
 
         }
-        while (laterQueue.length) {
+        while (false) {
             task = laterQueue.pop();
             runSingle(task);

[Timeout] BlockStatement
q.js:128:35
             runSingle(task, domain);
 
         }
-        while (laterQueue.length) {
-            task = laterQueue.pop();
-            runSingle(task);
-        }
+        while (laterQueue.length) {}
         flushing = false;
     }

[Timeout] BooleanLiteral
q.js:132:20
             task = laterQueue.pop();
             runSingle(task);
         }
-        flushing = false;
+        flushing = true;
     }
     // runs a single function in the async queue

[Timeout] BlockStatement
q.js:136:13
     }
     // runs a single function in the async queue
     function runSingle(task, domain) {
-        try {
-            task();
-
-        } catch (e) {
+        try {} catch (e) {
             if (isNodeJS) {
                 // In node, uncaught exceptions are considered fatal errors.

[Survived] BlockStatement
q.js:140:27
             task();
 
         } catch (e) {
-            if (isNodeJS) {
-                // In node, uncaught exceptions are considered fatal errors.
-                // Re-throw them synchronously to interrupt flushing!
-
-                // Ensure continuation if the uncaught exception is suppressed
-                // listening "uncaughtException" events (as domains does).
-                // Continue in next event to avoid tick recursion.
-                if (domain) {
-                    domain.exit();
-                }
-                setTimeout(flush, 0);
-                if (domain) {
-                    domain.enter();
-                }
-
-                throw e;
-
-            } else {
+            if (isNodeJS) {} else {
                 // In browsers, uncaught exceptions are not fatal.
                 // Re-throw them asynchronously to avoid slow-downs.

[Survived] ConditionalExpression
q.js:140:17
             task();
 
         } catch (e) {
-            if (isNodeJS) {
+            if (false) {
                 // In node, uncaught exceptions are considered fatal errors.
                 // Re-throw them synchronously to interrupt flushing!

[Survived] ConditionalExpression
q.js:147:21
                 // Ensure continuation if the uncaught exception is suppressed
                 // listening "uncaughtException" events (as domains does).
                 // Continue in next event to avoid tick recursion.
-                if (domain) {
+                if (false) {
                     domain.exit();
                 }

[Survived] BlockStatement
q.js:147:29
                 // Ensure continuation if the uncaught exception is suppressed
                 // listening "uncaughtException" events (as domains does).
                 // Continue in next event to avoid tick recursion.
-                if (domain) {
-                    domain.exit();
-                }
+                if (domain) {}
                 setTimeout(flush, 0);
                 if (domain) {

[Survived] BlockStatement
q.js:151:29
                     domain.exit();
                 }
                 setTimeout(flush, 0);
-                if (domain) {
-                    domain.enter();
-                }
+                if (domain) {}
 
                 throw e;

[Survived] ConditionalExpression
q.js:151:21
                     domain.exit();
                 }
                 setTimeout(flush, 0);
-                if (domain) {
+                if (false) {
                     domain.enter();
                 }

[Survived] BlockStatement
q.js:157:20
 
                 throw e;
 
-            } else {
-                // In browsers, uncaught exceptions are not fatal.
-                // Re-throw them asynchronously to avoid slow-downs.
-                setTimeout(function () {
-                    throw e;
-                }, 0);
-            }
+            } else {}
         }
 

[Survived] BlockStatement
q.js:160:40
             } else {
                 // In browsers, uncaught exceptions are not fatal.
                 // Re-throw them asynchronously to avoid slow-downs.
-                setTimeout(function () {
-                    throw e;
-                }, 0);
+                setTimeout(function () {}, 0);
             }
         }

[Survived] BlockStatement
q.js:166:21
             }
         }
 
-        if (domain) {
-            domain.exit();
-        }
+        if (domain) {}
     }
 

[Timeout] BlockStatement
q.js:171:32
         }
     }
 
-    nextTick = function (task) {
-        tail = tail.next = {
-            task: task,
-            domain: isNodeJS && process.domain,
-            next: null
-        };
-
-        if (!flushing) {
-            flushing = true;
-            requestTick();
-        }
-    };
+    nextTick = function (task) {};
 
     if (typeof process === "object" &&

[Timeout] ConditionalExpression
q.js:174:21
     nextTick = function (task) {
         tail = tail.next = {
             task: task,
-            domain: isNodeJS && process.domain,
+            domain: true,
             next: null
         };

[Timeout] LogicalOperator
q.js:174:21
     nextTick = function (task) {
         tail = tail.next = {
             task: task,
-            domain: isNodeJS && process.domain,
+            domain: isNodeJS || process.domain,
             next: null
         };

[Timeout] ConditionalExpression
q.js:178:13
             next: null
         };
 
-        if (!flushing) {
+        if (false) {
             flushing = true;
             requestTick();

[Survived] ConditionalExpression
q.js:178:13
             next: null
         };
 
-        if (!flushing) {
+        if (true) {
             flushing = true;
             requestTick();

[Survived] BooleanLiteral
q.js:179:24
         };
 
         if (!flushing) {
-            flushing = true;
+            flushing = false;
             requestTick();
         }

[Survived] LogicalOperator
q.js:184:9
         }
     };
 
-    if (typeof process === "object" &&
-        process.toString() === "[object process]" && process.nextTick) {
+    if (typeof process === "object" || process.toString() === "[object process]" && process.nextTick) {
         // Ensure Q is in a real Node environment, with a `process.nextTick`.
         // To see through fake Node environments:

[Survived] EqualityOperator
q.js:184:9
         }
     };
 
-    if (typeof process === "object" &&
+    if (typeof process !== "object" &&
         process.toString() === "[object process]" && process.nextTick) {
         // Ensure Q is in a real Node environment, with a `process.nextTick`.

[Killed] BlockStatement
q.js:185:72
     };
 
     if (typeof process === "object" &&
-        process.toString() === "[object process]" && process.nextTick) {
-        // Ensure Q is in a real Node environment, with a `process.nextTick`.
-        // To see through fake Node environments:
-        // * Mocha test runner - exposes a `process` global without a `nextTick`
-        // * Browserify - exposes a `process.nexTick` function that uses
-        //   `setTimeout`. In this case `setImmediate` is preferred because
-        //    it is faster. Browserify's `process.toString()` yields
-        //   "[object Object]", while in a real Node environment
-        //   `process.toString()` yields "[object process]".
-        isNodeJS = true;
-
-        requestTick = function () {
-            process.nextTick(flush);
-        };
-
-    } else if (typeof setImmediate === "function") {
+        process.toString() === "[object process]" && process.nextTick) {} else if (typeof setImmediate === "function") {
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
         if (typeof window !== "undefined") {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] EqualityOperator
q.js:185:9
     };
 
     if (typeof process === "object" &&
-        process.toString() === "[object process]" && process.nextTick) {
+        process.toString() !== "[object process]" && process.nextTick) {
         // Ensure Q is in a real Node environment, with a `process.nextTick`.
         // To see through fake Node environments:

[Survived] BooleanLiteral
q.js:194:20
         //    it is faster. Browserify's `process.toString()` yields
         //   "[object Object]", while in a real Node environment
         //   `process.toString()` yields "[object process]".
-        isNodeJS = true;
+        isNodeJS = false;
 
         requestTick = function () {

[Timeout] BlockStatement
q.js:196:35
         //   `process.toString()` yields "[object process]".
         isNodeJS = true;
 
-        requestTick = function () {
-            process.nextTick(flush);
-        };
+        requestTick = function () {};
 
     } else if (typeof setImmediate === "function") {

[Survived] ConditionalExpression
q.js:200:16
             process.nextTick(flush);
         };
 
-    } else if (typeof setImmediate === "function") {
+    } else if (true) {
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
         if (typeof window !== "undefined") {

[Survived] ConditionalExpression
q.js:200:16
             process.nextTick(flush);
         };
 
-    } else if (typeof setImmediate === "function") {
+    } else if (false) {
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
         if (typeof window !== "undefined") {

[Survived] ConditionalExpression
q.js:202:13
 
     } else if (typeof setImmediate === "function") {
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
-        if (typeof window !== "undefined") {
+        if (true) {
             requestTick = setImmediate.bind(window, flush);
         } else {

[Survived] BlockStatement
q.js:202:44
 
     } else if (typeof setImmediate === "function") {
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
-        if (typeof window !== "undefined") {
-            requestTick = setImmediate.bind(window, flush);
-        } else {
+        if (typeof window !== "undefined") {} else {
             requestTick = function () {
                 setImmediate(flush);

[Survived] BlockStatement
q.js:204:16
         // In IE10, Node.js 0.9+, or https://github.com/NobleJS/setImmediate
         if (typeof window !== "undefined") {
             requestTick = setImmediate.bind(window, flush);
-        } else {
-            requestTick = function () {
-                setImmediate(flush);
-            };
-        }
+        } else {}
 
     } else if (typeof MessageChannel !== "undefined") {

[Survived] BlockStatement
q.js:205:39
         if (typeof window !== "undefined") {
             requestTick = setImmediate.bind(window, flush);
         } else {
-            requestTick = function () {
-                setImmediate(flush);
-            };
+            requestTick = function () {};
         }
 

[Survived] ConditionalExpression
q.js:210:16
             };
         }
 
-    } else if (typeof MessageChannel !== "undefined") {
+    } else if (false) {
         // modern browsers
         // http://www.nonblocking.io/2011/06/windownexttick.html

[Survived] ConditionalExpression
q.js:210:16
             };
         }
 
-    } else if (typeof MessageChannel !== "undefined") {
+    } else if (true) {
         // modern browsers
         // http://www.nonblocking.io/2011/06/windownexttick.html

[Survived] BlockStatement
q.js:216:47
         var channel = new MessageChannel();
         // At least Safari Version 6.0.5 (8536.30.1) intermittently cannot create
         // working message ports the first time a page loads.
-        channel.port1.onmessage = function () {
-            requestTick = requestPortTick;
-            channel.port1.onmessage = flush;
-            flush();
-        };
+        channel.port1.onmessage = function () {};
         var requestPortTick = function () {
             // Opera requires us to provide a message payload, regardless of

[Survived] BlockStatement
q.js:221:43
             channel.port1.onmessage = flush;
             flush();
         };
-        var requestPortTick = function () {
-            // Opera requires us to provide a message payload, regardless of
-            // whether we use it.
-            channel.port2.postMessage(0);
-        };
+        var requestPortTick = function () {};
         requestTick = function () {
             setTimeout(flush, 0);

[Survived] BlockStatement
q.js:226:35
             // whether we use it.
             channel.port2.postMessage(0);
         };
-        requestTick = function () {
-            setTimeout(flush, 0);
-            requestPortTick();
-        };
+        requestTick = function () {};
 
     } else {

[Survived] BlockStatement
q.js:231:12
             requestPortTick();
         };
 
-    } else {
-        // old browsers
-        requestTick = function () {
-            setTimeout(flush, 0);
-        };
-    }
+    } else {}
     // runs a task after all other tasks have been run
     // this is useful for unhandled rejection tracking that needs to happen

[Survived] BlockStatement
q.js:233:35
 
     } else {
         // old browsers
-        requestTick = function () {
-            setTimeout(flush, 0);
-        };
+        requestTick = function () {};
     }
     // runs a task after all other tasks have been run

[Survived] BlockStatement
q.js:240:41
     // runs a task after all other tasks have been run
     // this is useful for unhandled rejection tracking that needs to happen
     // after all `then`d tasks have been run.
-    nextTick.runAfter = function (task) {
-        laterQueue.push(task);
-        if (!flushing) {
-            flushing = true;
-            requestTick();
-        }
-    };
+    nextTick.runAfter = function (task) {};
     return nextTick;
 })();

[Survived] BlockStatement
q.js:242:24
     // after all `then`d tasks have been run.
     nextTick.runAfter = function (task) {
         laterQueue.push(task);
-        if (!flushing) {
-            flushing = true;
-            requestTick();
-        }
+        if (!flushing) {}
     };
     return nextTick;

[Survived] BooleanLiteral
q.js:242:13
     // after all `then`d tasks have been run.
     nextTick.runAfter = function (task) {
         laterQueue.push(task);
-        if (!flushing) {
+        if (flushing) {
             flushing = true;
             requestTick();

[Killed] BlockStatement
q.js:261:25
 // See Mark Miller’s explanation of what this does.
 // http://wiki.ecmascript.org/doku.php?id=conventions:safe_meta_programming
 var call = Function.call;
-function uncurryThis(f) {
-    return function () {
-        return call.apply(f, arguments);
-    };
-}
+function uncurryThis(f) {}
 // This is equivalent, but slower:
 // uncurryThis = Function_bind.bind(Function_bind.call);
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] BlockStatement
q.js:262:24
 // http://wiki.ecmascript.org/doku.php?id=conventions:safe_meta_programming
 var call = Function.call;
 function uncurryThis(f) {
-    return function () {
-        return call.apply(f, arguments);
-    };
+    return function () {};
 }
 // This is equivalent, but slower:

[Survived] EqualityOperator
q.js:277:13
         var index = 0,
             length = this.length;
         // concerning the initial value, if one is not provided
-        if (arguments.length === 1) {
+        if (arguments.length !== 1) {
             // seek to the first value in the array, accounting
             // for the possibility that is is a sparse array

[Survived] ConditionalExpression
q.js:277:13
         var index = 0,
             length = this.length;
         // concerning the initial value, if one is not provided
-        if (arguments.length === 1) {
+        if (true) {
             // seek to the first value in the array, accounting
             // for the possibility that is is a sparse array

[Survived] BlockStatement
q.js:280:16
         if (arguments.length === 1) {
             // seek to the first value in the array, accounting
             // for the possibility that is is a sparse array
-            do {
-                if (index in this) {
-                    basis = this[index++];
-                    break;
-                }
-                if (++index >= length) {
-                    throw new TypeError();
-                }
-            } while (1);
+            do {} while (1);
         }
         // reduce

[Survived] BlockStatement
q.js:281:36
             // seek to the first value in the array, accounting
             // for the possibility that is is a sparse array
             do {
-                if (index in this) {
-                    basis = this[index++];
-                    break;
-                }
+                if (index in this) {}
                 if (++index >= length) {
                     throw new TypeError();

[Survived] ConditionalExpression
q.js:281:21
             // seek to the first value in the array, accounting
             // for the possibility that is is a sparse array
             do {
-                if (index in this) {
+                if (false) {
                     basis = this[index++];
                     break;

[Survived] UpdateOperator
q.js:282:34
             // for the possibility that is is a sparse array
             do {
                 if (index in this) {
-                    basis = this[index++];
+                    basis = this[index--];
                     break;
                 }

[Survived] BlockStatement
q.js:285:40
                     basis = this[index++];
                     break;
                 }
-                if (++index >= length) {
-                    throw new TypeError();
-                }
+                if (++index >= length) {}
             } while (1);
         }

[Survived] ConditionalExpression
q.js:285:21
                     basis = this[index++];
                     break;
                 }
-                if (++index >= length) {
+                if (true) {
                     throw new TypeError();
                 }

[Survived] ConditionalExpression
q.js:288:22
                 if (++index >= length) {
                     throw new TypeError();
                 }
-            } while (1);
+            } while (false);
         }
         // reduce

[Survived] EqualityOperator
q.js:291:16
             } while (1);
         }
         // reduce
-        for (; index < length; index++) {
+        for (; index >= length; index++) {
             // account for the possibility that the array is sparse
             if (index in this) {

[Survived] EqualityOperator
q.js:291:16
             } while (1);
         }
         // reduce
-        for (; index < length; index++) {
+        for (; index <= length; index++) {
             // account for the possibility that the array is sparse
             if (index in this) {
