[Survived] BlockStatement
q.js:293:32
         // reduce
         for (; index < length; index++) {
             // account for the possibility that the array is sparse
-            if (index in this) {
-                basis = callback(basis, this[index], index);
-            }
+            if (index in this) {}
         }
         return basis;

[Survived] ConditionalExpression
q.js:293:17
         // reduce
         for (; index < length; index++) {
             // account for the possibility that the array is sparse
-            if (index in this) {
+            if (false) {
                 basis = callback(basis, this[index], index);
             }

[Killed] ConditionalExpression
q.js:302:5
 );
 
 var array_indexOf = uncurryThis(
-    Array.prototype.indexOf || function (value) {
-        // not a very good shim, but good enough for our one use of it
-        for (var i = 0; i < this.length; i++) {
-            if (this[i] === value) {
-                return i;
-            }
-        }
-        return -1;
-    }
+    false
 );
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:302:5
 );
 
 var array_indexOf = uncurryThis(
-    Array.prototype.indexOf || function (value) {
-        // not a very good shim, but good enough for our one use of it
-        for (var i = 0; i < this.length; i++) {
-            if (this[i] === value) {
-                return i;
-            }
-        }
-        return -1;
-    }
+    true
 );
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] ConditionalExpression
q.js:304:25
 var array_indexOf = uncurryThis(
     Array.prototype.indexOf || function (value) {
         // not a very good shim, but good enough for our one use of it
-        for (var i = 0; i < this.length; i++) {
+        for (var i = 0; false; i++) {
             if (this[i] === value) {
                 return i;

[Survived] BlockStatement
q.js:304:47
 var array_indexOf = uncurryThis(
     Array.prototype.indexOf || function (value) {
         // not a very good shim, but good enough for our one use of it
-        for (var i = 0; i < this.length; i++) {
-            if (this[i] === value) {
-                return i;
-            }
-        }
+        for (var i = 0; i < this.length; i++) {}
         return -1;
     }

[Survived] ConditionalExpression
q.js:305:17
     Array.prototype.indexOf || function (value) {
         // not a very good shim, but good enough for our one use of it
         for (var i = 0; i < this.length; i++) {
-            if (this[i] === value) {
+            if (false) {
                 return i;
             }

[Survived] EqualityOperator
q.js:305:17
     Array.prototype.indexOf || function (value) {
         // not a very good shim, but good enough for our one use of it
         for (var i = 0; i < this.length; i++) {
-            if (this[i] === value) {
+            if (this[i] !== value) {
                 return i;
             }

[Survived] ConditionalExpression
q.js:314:5
 );
 
 var array_map = uncurryThis(
-    Array.prototype.map || function (callback, thisp) {
-        var self = this;
-        var collect = [];
-        array_reduce(self, function (undefined, value, index) {
-            collect.push(callback.call(thisp, value, index, self));
-        }, void 0);
-        return collect;
-    }
+    false
 );
 

[Survived] LogicalOperator
q.js:314:5
 );
 
 var array_map = uncurryThis(
-    Array.prototype.map || function (callback, thisp) {
-        var self = this;
-        var collect = [];
-        array_reduce(self, function (undefined, value, index) {
-            collect.push(callback.call(thisp, value, index, self));
-        }, void 0);
-        return collect;
-    }
+    Array.prototype.map && function (callback, thisp) {
+  var self = this;
+  var collect = [];
+  array_reduce(self, function (undefined, value, index) {
+    collect.push(callback.call(thisp, value, index, self));
+  }, void 0);
+  return collect;
+}
 );
 

[Survived] BlockStatement
q.js:317:63
     Array.prototype.map || function (callback, thisp) {
         var self = this;
         var collect = [];
-        array_reduce(self, function (undefined, value, index) {
-            collect.push(callback.call(thisp, value, index, self));
-        }, void 0);
+        array_reduce(self, function (undefined, value, index) {}, void 0);
         return collect;
     }

[Killed] ConditionalExpression
q.js:324:21
     }
 );
 
-var object_create = Object.create || function (prototype) {
-    function Type() { }
-    Type.prototype = prototype;
-    return new Type();
-};
+var object_create = false;
 
 var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:324:21
     }
 );
 
-var object_create = Object.create || function (prototype) {
-    function Type() { }
-    Type.prototype = prototype;
-    return new Type();
-};
+var object_create = true;
 
 var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] ConditionalExpression
q.js:330:29
     return new Type();
 };
 
-var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-    obj[prop] = descriptor.value;
-    return obj;
-};
+var object_defineProperty = false;
 
 var object_hasOwnProperty = uncurryThis(Object.prototype.hasOwnProperty);

[Survived] ConditionalExpression
q.js:330:29
     return new Type();
 };
 
-var object_defineProperty = Object.defineProperty || function (obj, prop, descriptor) {
-    obj[prop] = descriptor.value;
-    return obj;
-};
+var object_defineProperty = true;
 
 var object_hasOwnProperty = uncurryThis(Object.prototype.hasOwnProperty);

[Survived] ConditionalExpression
q.js:337:19
 
 var object_hasOwnProperty = uncurryThis(Object.prototype.hasOwnProperty);
 
-var object_keys = Object.keys || function (object) {
-    var keys = [];
-    for (var key in object) {
-        if (object_hasOwnProperty(object, key)) {
-            keys.push(key);
-        }
-    }
-    return keys;
-};
+var object_keys = true;
 
 var object_toString = uncurryThis(Object.prototype.toString);

[Survived] BlockStatement
q.js:337:52
 
 var object_hasOwnProperty = uncurryThis(Object.prototype.hasOwnProperty);
 
-var object_keys = Object.keys || function (object) {
-    var keys = [];
-    for (var key in object) {
-        if (object_hasOwnProperty(object, key)) {
-            keys.push(key);
-        }
-    }
-    return keys;
-};
+var object_keys = Object.keys || function (object) {};
 
 var object_toString = uncurryThis(Object.prototype.toString);

[Survived] BlockStatement
q.js:339:29
 
 var object_keys = Object.keys || function (object) {
     var keys = [];
-    for (var key in object) {
-        if (object_hasOwnProperty(object, key)) {
-            keys.push(key);
-        }
-    }
+    for (var key in object) {}
     return keys;
 };

[Survived] BlockStatement
q.js:340:49
 var object_keys = Object.keys || function (object) {
     var keys = [];
     for (var key in object) {
-        if (object_hasOwnProperty(object, key)) {
-            keys.push(key);
-        }
+        if (object_hasOwnProperty(object, key)) {}
     }
     return keys;

[Survived] ConditionalExpression
q.js:340:13
 var object_keys = Object.keys || function (object) {
     var keys = [];
     for (var key in object) {
-        if (object_hasOwnProperty(object, key)) {
+        if (true) {
             keys.push(key);
         }

[Killed] BlockStatement
q.js:349:26
 
 var object_toString = uncurryThis(Object.prototype.toString);
 
-function isObject(value) {
-    return value === Object(value);
-}
+function isObject(value) {}
 
 // generator related shims
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] EqualityOperator
q.js:350:12
 var object_toString = uncurryThis(Object.prototype.toString);
 
 function isObject(value) {
-    return value === Object(value);
+    return value !== Object(value);
 }
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:350:12
 var object_toString = uncurryThis(Object.prototype.toString);
 
 function isObject(value) {
-    return value === Object(value);
+    return true;
 }
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:356:37
 // generator related shims
 
 // FIXME: Remove this function once ES6 generators are in SpiderMonkey.
-function isStopIteration(exception) {
-    return (
-        object_toString(exception) === "[object StopIteration]" ||
-        exception instanceof QReturnValue
-    );
-}
+function isStopIteration(exception) {}
 
 // FIXME: Remove this helper and Q.return once ES6 generators are in

[Survived] ConditionalExpression
q.js:358:9
 // FIXME: Remove this function once ES6 generators are in SpiderMonkey.
 function isStopIteration(exception) {
     return (
-        object_toString(exception) === "[object StopIteration]" ||
-        exception instanceof QReturnValue
+        false
     );
 }

[Survived] ConditionalExpression
q.js:358:9
 // FIXME: Remove this function once ES6 generators are in SpiderMonkey.
 function isStopIteration(exception) {
     return (
-        object_toString(exception) === "[object StopIteration]" ||
+        false ||
         exception instanceof QReturnValue
     );

[Killed] ConditionalExpression
q.js:366:5
 // FIXME: Remove this helper and Q.return once ES6 generators are in
 // SpiderMonkey.
 var QReturnValue;
-if (typeof ReturnValue !== "undefined") {
+if (true) {
     QReturnValue = ReturnValue;
 } else {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] EqualityOperator
q.js:366:5
 // FIXME: Remove this helper and Q.return once ES6 generators are in
 // SpiderMonkey.
 var QReturnValue;
-if (typeof ReturnValue !== "undefined") {
+if (typeof ReturnValue === "undefined") {
     QReturnValue = ReturnValue;
 } else {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:368:8
 var QReturnValue;
 if (typeof ReturnValue !== "undefined") {
     QReturnValue = ReturnValue;
-} else {
-    QReturnValue = function (value) {
-        this.value = value;
-    };
-}
+} else {}
 
 // long stack traces

[Survived] BlockStatement
q.js:369:37
 if (typeof ReturnValue !== "undefined") {
     QReturnValue = ReturnValue;
 } else {
-    QReturnValue = function (value) {
-        this.value = value;
-    };
+    QReturnValue = function (value) {};
 }
 

[Survived] StringLiteral
q.js:376:28
 
 // long stack traces
 
-var STACK_JUMP_SEPARATOR = "From previous event:";
+var STACK_JUMP_SEPARATOR = "";
 
 function makeStackTraceLong(error, promise) {

[Survived] BlockStatement
q.js:378:45
 
 var STACK_JUMP_SEPARATOR = "From previous event:";
 
-function makeStackTraceLong(error, promise) {
-    // If possible, transform the error stack trace by removing Node and Q
-    // cruft, then concatenating with the stack trace of `promise`. See #57.
-    if (hasStacks &&
-        promise.stack &&
-        typeof error === "object" &&
-        error !== null &&
-        error.stack
-    ) {
-        var stacks = [];
-        for (var p = promise; !!p; p = p.source) {
-            if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                stacks.unshift(p.stack);
-            }
-        }
-        stacks.unshift(error.stack);
-
-        var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
-        var stack = filterStackString(concatedStacks);
-        object_defineProperty(error, "stack", {value: stack, configurable: true});
-    }
-}
+function makeStackTraceLong(error, promise) {}
 
 function filterStackString(stackString) {

[Killed] LogicalOperator
q.js:381:9
 function makeStackTraceLong(error, promise) {
     // If possible, transform the error stack trace by removing Node and Q
     // cruft, then concatenating with the stack trace of `promise`. See #57.
-    if (hasStacks &&
-        promise.stack &&
-        typeof error === "object" &&
-        error !== null &&
-        error.stack
+    if (hasStacks && promise.stack && typeof error === "object" && error !== null || error.stack
     ) {
         var stacks = [];
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:381:9
 function makeStackTraceLong(error, promise) {
     // If possible, transform the error stack trace by removing Node and Q
     // cruft, then concatenating with the stack trace of `promise`. See #57.
-    if (hasStacks &&
-        promise.stack &&
-        typeof error === "object" &&
-        error !== null &&
-        error.stack
+    if (true
     ) {
         var stacks = [];
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] ConditionalExpression
q.js:383:9
     // cruft, then concatenating with the stack trace of `promise`. See #57.
     if (hasStacks &&
         promise.stack &&
-        typeof error === "object" &&
+        true &&
         error !== null &&
         error.stack

[Survived] EqualityOperator
q.js:383:9
     // cruft, then concatenating with the stack trace of `promise`. See #57.
     if (hasStacks &&
         promise.stack &&
-        typeof error === "object" &&
+        typeof error !== "object" &&
         error !== null &&
         error.stack

[Survived] BlockStatement
q.js:386:7
         typeof error === "object" &&
         error !== null &&
         error.stack
-    ) {
-        var stacks = [];
-        for (var p = promise; !!p; p = p.source) {
-            if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                stacks.unshift(p.stack);
-            }
-        }
-        stacks.unshift(error.stack);
-
-        var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
-        var stack = filterStackString(concatedStacks);
-        object_defineProperty(error, "stack", {value: stack, configurable: true});
-    }
+    ) {}
 }
 

[Survived] BlockStatement
q.js:388:50
         error.stack
     ) {
         var stacks = [];
-        for (var p = promise; !!p; p = p.source) {
-            if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
-                stacks.unshift(p.stack);
-            }
-        }
+        for (var p = promise; !!p; p = p.source) {}
         stacks.unshift(error.stack);
 

[Survived] ConditionalExpression
q.js:388:31
         error.stack
     ) {
         var stacks = [];
-        for (var p = promise; !!p; p = p.source) {
+        for (var p = promise; false; p = p.source) {
             if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
                 object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});

[Survived] LogicalOperator
q.js:389:29
     ) {
         var stacks = [];
         for (var p = promise; !!p; p = p.source) {
-            if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+            if (p.stack && (!error.__minimumStackCounter__ && error.__minimumStackCounter__ > p.stackCounter)) {
                 object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
                 stacks.unshift(p.stack);

[Survived] LogicalOperator
q.js:389:17
     ) {
         var stacks = [];
         for (var p = promise; !!p; p = p.source) {
-            if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
+            if (p.stack || !error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter) {
                 object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
                 stacks.unshift(p.stack);

[Survived] BooleanLiteral
q.js:390:111
         var stacks = [];
         for (var p = promise; !!p; p = p.source) {
             if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
+                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: false});
                 stacks.unshift(p.stack);
             }

[Survived] ObjectLiteral
q.js:390:73
         var stacks = [];
         for (var p = promise; !!p; p = p.source) {
             if (p.stack && (!error.__minimumStackCounter__ || error.__minimumStackCounter__ > p.stackCounter)) {
-                object_defineProperty(error, "__minimumStackCounter__", {value: p.stackCounter, configurable: true});
+                object_defineProperty(error, "__minimumStackCounter__", {});
                 stacks.unshift(p.stack);
             }

[Survived] BooleanLiteral
q.js:398:76
 
         var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
         var stack = filterStackString(concatedStacks);
-        object_defineProperty(error, "stack", {value: stack, configurable: true});
+        object_defineProperty(error, "stack", {value: stack, configurable: false});
     }
 }

[Survived] ObjectLiteral
q.js:398:47
 
         var concatedStacks = stacks.join("\n" + STACK_JUMP_SEPARATOR + "\n");
         var stack = filterStackString(concatedStacks);
-        object_defineProperty(error, "stack", {value: stack, configurable: true});
+        object_defineProperty(error, "stack", {});
     }
 }

[Survived] BlockStatement
q.js:402:41
     }
 }
 
-function filterStackString(stackString) {
-    var lines = stackString.split("\n");
-    var desiredLines = [];
-    for (var i = 0; i < lines.length; ++i) {
-        var line = lines[i];
-
-        if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
-            desiredLines.push(line);
-        }
-    }
-    return desiredLines.join("\n");
-}
+function filterStackString(stackString) {}
 
 function isNodeFrame(stackLine) {

[Survived] ConditionalExpression
q.js:405:21
 function filterStackString(stackString) {
     var lines = stackString.split("\n");
     var desiredLines = [];
-    for (var i = 0; i < lines.length; ++i) {
+    for (var i = 0; false; ++i) {
         var line = lines[i];
 

[Survived] BlockStatement
q.js:405:44
 function filterStackString(stackString) {
     var lines = stackString.split("\n");
     var desiredLines = [];
-    for (var i = 0; i < lines.length; ++i) {
-        var line = lines[i];
-
-        if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
-            desiredLines.push(line);
-        }
-    }
+    for (var i = 0; i < lines.length; ++i) {}
     return desiredLines.join("\n");
 }

[Survived] ConditionalExpression
q.js:408:13
     for (var i = 0; i < lines.length; ++i) {
         var line = lines[i];
 
-        if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+        if (false) {
             desiredLines.push(line);
         }

[Survived] ConditionalExpression
q.js:408:13
     for (var i = 0; i < lines.length; ++i) {
         var line = lines[i];
 
-        if (!isInternalFrame(line) && !isNodeFrame(line) && line) {
+        if (true) {
             desiredLines.push(line);
         }

[Survived] BlockStatement
q.js:415:33
     return desiredLines.join("\n");
 }
 
-function isNodeFrame(stackLine) {
-    return stackLine.indexOf("(module.js:") !== -1 ||
-           stackLine.indexOf("(node.js:") !== -1;
-}
+function isNodeFrame(stackLine) {}
 
 function getFileNameAndLineNumber(stackLine) {

[Survived] EqualityOperator
q.js:416:12
 }
 
 function isNodeFrame(stackLine) {
-    return stackLine.indexOf("(module.js:") !== -1 ||
+    return stackLine.indexOf("(module.js:") === -1 ||
            stackLine.indexOf("(node.js:") !== -1;
 }

[Survived] UnaryOperator
q.js:416:49
 }
 
 function isNodeFrame(stackLine) {
-    return stackLine.indexOf("(module.js:") !== -1 ||
+    return stackLine.indexOf("(module.js:") !== +1 ||
            stackLine.indexOf("(node.js:") !== -1;
 }

[Survived] EqualityOperator
q.js:417:12
 
 function isNodeFrame(stackLine) {
     return stackLine.indexOf("(module.js:") !== -1 ||
-           stackLine.indexOf("(node.js:") !== -1;
+           stackLine.indexOf("(node.js:") === -1;
 }
 

[Survived] UnaryOperator
q.js:417:47
 
 function isNodeFrame(stackLine) {
     return stackLine.indexOf("(module.js:") !== -1 ||
-           stackLine.indexOf("(node.js:") !== -1;
+           stackLine.indexOf("(node.js:") !== +1;
 }
 

[Survived] BlockStatement
q.js:420:46
            stackLine.indexOf("(node.js:") !== -1;
 }
 
-function getFileNameAndLineNumber(stackLine) {
-    // Named functions: "at functionName (filename:lineNumber:columnNumber)"
-    // In IE10 function name can have spaces ("Anonymous function") O_o
-    var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
-    if (attempt1) {
-        return [attempt1[1], Number(attempt1[2])];
-    }
-
-    // Anonymous functions: "at filename:lineNumber:columnNumber"
-    var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
-    if (attempt2) {
-        return [attempt2[1], Number(attempt2[2])];
-    }
-
-    // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
-    var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
-    if (attempt3) {
-        return [attempt3[1], Number(attempt3[2])];
-    }
-}
+function getFileNameAndLineNumber(stackLine) {}
 
 function isInternalFrame(stackLine) {

[Survived] Regex
q.js:423:20
 function getFileNameAndLineNumber(stackLine) {
     // Named functions: "at functionName (filename:lineNumber:columnNumber)"
     // In IE10 function name can have spaces ("Anonymous function") O_o
-    var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+    var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)/.exec(stackLine);
     if (attempt1) {
         return [attempt1[1], Number(attempt1[2])];

[Survived] Regex
q.js:423:20
 function getFileNameAndLineNumber(stackLine) {
     // Named functions: "at functionName (filename:lineNumber:columnNumber)"
     // In IE10 function name can have spaces ("Anonymous function") O_o
-    var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
+    var attempt1 = /at .+ \((.+):(\d+):(?:\d)\)$/.exec(stackLine);
     if (attempt1) {
         return [attempt1[1], Number(attempt1[2])];

[Killed] ConditionalExpression
q.js:424:9
     // Named functions: "at functionName (filename:lineNumber:columnNumber)"
     // In IE10 function name can have spaces ("Anonymous function") O_o
     var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
-    if (attempt1) {
+    if (true) {
         return [attempt1[1], Number(attempt1[2])];
     }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] ConditionalExpression
q.js:424:9
     // Named functions: "at functionName (filename:lineNumber:columnNumber)"
     // In IE10 function name can have spaces ("Anonymous function") O_o
     var attempt1 = /at .+ \((.+):(\d+):(?:\d+)\)$/.exec(stackLine);
-    if (attempt1) {
+    if (false) {
         return [attempt1[1], Number(attempt1[2])];
     }

[Survived] BlockStatement
q.js:430:19
 
     // Anonymous functions: "at filename:lineNumber:columnNumber"
     var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
-    if (attempt2) {
-        return [attempt2[1], Number(attempt2[2])];
-    }
+    if (attempt2) {}
 
     // Firefox style: "function@filename:lineNumber or @filename:lineNumber"

[Survived] ConditionalExpression
q.js:430:9
 
     // Anonymous functions: "at filename:lineNumber:columnNumber"
     var attempt2 = /at ([^ ]+):(\d+):(?:\d+)$/.exec(stackLine);
-    if (attempt2) {
+    if (false) {
         return [attempt2[1], Number(attempt2[2])];
     }

[Survived] Regex
q.js:435:20
     }
 
     // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
-    var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+    var attempt3 = /.*@(.+):(\D+)$/.exec(stackLine);
     if (attempt3) {
         return [attempt3[1], Number(attempt3[2])];

[Survived] Regex
q.js:435:20
     }
 
     // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
-    var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
+    var attempt3 = /.*@(.+):(\d+)/.exec(stackLine);
     if (attempt3) {
         return [attempt3[1], Number(attempt3[2])];

[Survived] ConditionalExpression
q.js:436:9
 
     // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
     var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
-    if (attempt3) {
+    if (true) {
         return [attempt3[1], Number(attempt3[2])];
     }

[Survived] ConditionalExpression
q.js:436:9
 
     // Firefox style: "function@filename:lineNumber or @filename:lineNumber"
     var attempt3 = /.*@(.+):(\d+)$/.exec(stackLine);
-    if (attempt3) {
+    if (false) {
         return [attempt3[1], Number(attempt3[2])];
     }

[Survived] BlockStatement
q.js:441:37
     }
 }
 
-function isInternalFrame(stackLine) {
-    var fileNameAndLineNumber = getFileNameAndLineNumber(stackLine);
-
-    if (!fileNameAndLineNumber) {
-        return false;
-    }
-
-    var fileName = fileNameAndLineNumber[0];
-    var lineNumber = fileNameAndLineNumber[1];
-
-    return fileName === qFileName &&
-        lineNumber >= qStartingLine &&
-        lineNumber <= qEndingLine;
-}
+function isInternalFrame(stackLine) {}
 
 // discover own file name and line number range for filtering stack

[Survived] BlockStatement
q.js:444:33
 function isInternalFrame(stackLine) {
     var fileNameAndLineNumber = getFileNameAndLineNumber(stackLine);
 
-    if (!fileNameAndLineNumber) {
-        return false;
-    }
+    if (!fileNameAndLineNumber) {}
 
     var fileName = fileNameAndLineNumber[0];
