[Survived] ConditionalExpression
q.js:444:9
 function isInternalFrame(stackLine) {
     var fileNameAndLineNumber = getFileNameAndLineNumber(stackLine);
 
-    if (!fileNameAndLineNumber) {
+    if (true) {
         return false;
     }

[Survived] BooleanLiteral
q.js:445:16
     var fileNameAndLineNumber = getFileNameAndLineNumber(stackLine);
 
     if (!fileNameAndLineNumber) {
-        return false;
+        return true;
     }
 

[Survived] LogicalOperator
q.js:451:12
     var fileName = fileNameAndLineNumber[0];
     var lineNumber = fileNameAndLineNumber[1];
 
-    return fileName === qFileName &&
-        lineNumber >= qStartingLine &&
-        lineNumber <= qEndingLine;
+    return fileName === qFileName && lineNumber >= qStartingLine || lineNumber <= qEndingLine;
 }
 

[Survived] LogicalOperator
q.js:451:12
     var fileName = fileNameAndLineNumber[0];
     var lineNumber = fileNameAndLineNumber[1];
 
-    return fileName === qFileName &&
-        lineNumber >= qStartingLine &&
+    return fileName === qFileName || lineNumber >= qStartingLine &&
         lineNumber <= qEndingLine;
 }

[Survived] EqualityOperator
q.js:452:9
     var lineNumber = fileNameAndLineNumber[1];
 
     return fileName === qFileName &&
-        lineNumber >= qStartingLine &&
+        lineNumber > qStartingLine &&
         lineNumber <= qEndingLine;
 }

[Survived] EqualityOperator
q.js:452:9
     var lineNumber = fileNameAndLineNumber[1];
 
     return fileName === qFileName &&
-        lineNumber >= qStartingLine &&
+        lineNumber < qStartingLine &&
         lineNumber <= qEndingLine;
 }

[Survived] EqualityOperator
q.js:453:9
 
     return fileName === qFileName &&
         lineNumber >= qStartingLine &&
-        lineNumber <= qEndingLine;
+        lineNumber > qEndingLine;
 }
 

[Survived] ConditionalExpression
q.js:453:9
 
     return fileName === qFileName &&
         lineNumber >= qStartingLine &&
-        lineNumber <= qEndingLine;
+        true;
 }
 

[Survived] BlockStatement
q.js:458:24
 
 // discover own file name and line number range for filtering stack
 // traces
-function captureLine() {
-    if (!hasStacks) {
-        return;
-    }
-
-    try {
-        throw new Error();
-    } catch (e) {
-        var lines = e.stack.split("\n");
-        var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
-        var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-        if (!fileNameAndLineNumber) {
-            return;
-        }
-
-        qFileName = fileNameAndLineNumber[0];
-        return fileNameAndLineNumber[1];
-    }
-}
+function captureLine() {}
 
 function deprecate(callback, name, alternative) {

[Survived] BlockStatement
q.js:459:21
 // discover own file name and line number range for filtering stack
 // traces
 function captureLine() {
-    if (!hasStacks) {
-        return;
-    }
+    if (!hasStacks) {}
 
     try {

[Survived] ConditionalExpression
q.js:459:9
 // discover own file name and line number range for filtering stack
 // traces
 function captureLine() {
-    if (!hasStacks) {
+    if (false) {
         return;
     }

[Survived] BlockStatement
q.js:463:9
         return;
     }
 
-    try {
-        throw new Error();
-    } catch (e) {
+    try {} catch (e) {
         var lines = e.stack.split("\n");
         var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];

[Survived] BlockStatement
q.js:465:17
 
     try {
         throw new Error();
-    } catch (e) {
-        var lines = e.stack.split("\n");
-        var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
-        var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-        if (!fileNameAndLineNumber) {
-            return;
-        }
-
-        qFileName = fileNameAndLineNumber[0];
-        return fileNameAndLineNumber[1];
-    }
+    } catch (e) {}
 }
 

[Survived] StringLiteral
q.js:466:35
     try {
         throw new Error();
     } catch (e) {
-        var lines = e.stack.split("\n");
+        var lines = e.stack.split("");
         var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
         var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);

[Survived] EqualityOperator
q.js:467:25
         throw new Error();
     } catch (e) {
         var lines = e.stack.split("\n");
-        var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+        var firstLine = lines[0].indexOf("@") >= 0 ? lines[1] : lines[2];
         var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
         if (!fileNameAndLineNumber) {

[Survived] ConditionalExpression
q.js:467:25
         throw new Error();
     } catch (e) {
         var lines = e.stack.split("\n");
-        var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
+        var firstLine = false ? lines[1] : lines[2];
         var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
         if (!fileNameAndLineNumber) {

[Survived] BooleanLiteral
q.js:469:13
         var lines = e.stack.split("\n");
         var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
         var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-        if (!fileNameAndLineNumber) {
+        if (fileNameAndLineNumber) {
             return;
         }

[Survived] BlockStatement
q.js:469:37
         var lines = e.stack.split("\n");
         var firstLine = lines[0].indexOf("@") > 0 ? lines[1] : lines[2];
         var fileNameAndLineNumber = getFileNameAndLineNumber(firstLine);
-        if (!fileNameAndLineNumber) {
-            return;
-        }
+        if (!fileNameAndLineNumber) {}
 
         qFileName = fileNameAndLineNumber[0];

[Survived] BlockStatement
q.js:478:49
     }
 }
 
-function deprecate(callback, name, alternative) {
-    return function () {
-        if (typeof console !== "undefined" &&
-            typeof console.warn === "function") {
-            console.warn(name + " is deprecated, use " + alternative +
-                         " instead.", new Error("").stack);
-        }
-        return callback.apply(callback, arguments);
-    };
-}
+function deprecate(callback, name, alternative) {}
 
 // end of shims

[Survived] BlockStatement
q.js:479:24
 }
 
 function deprecate(callback, name, alternative) {
-    return function () {
-        if (typeof console !== "undefined" &&
-            typeof console.warn === "function") {
-            console.warn(name + " is deprecated, use " + alternative +
-                         " instead.", new Error("").stack);
-        }
-        return callback.apply(callback, arguments);
-    };
+    return function () {};
 }
 

[Survived] LogicalOperator
q.js:480:13
 
 function deprecate(callback, name, alternative) {
     return function () {
-        if (typeof console !== "undefined" &&
-            typeof console.warn === "function") {
+        if (typeof console !== "undefined" || typeof console.warn === "function") {
             console.warn(name + " is deprecated, use " + alternative +
                          " instead.", new Error("").stack);

[Survived] EqualityOperator
q.js:480:13
 
 function deprecate(callback, name, alternative) {
     return function () {
-        if (typeof console !== "undefined" &&
+        if (typeof console === "undefined" &&
             typeof console.warn === "function") {
             console.warn(name + " is deprecated, use " + alternative +

[Survived] BlockStatement
q.js:481:49
 function deprecate(callback, name, alternative) {
     return function () {
         if (typeof console !== "undefined" &&
-            typeof console.warn === "function") {
-            console.warn(name + " is deprecated, use " + alternative +
-                         " instead.", new Error("").stack);
-        }
+            typeof console.warn === "function") {}
         return callback.apply(callback, arguments);
     };

[Survived] EqualityOperator
q.js:481:13
 function deprecate(callback, name, alternative) {
     return function () {
         if (typeof console !== "undefined" &&
-            typeof console.warn === "function") {
+            typeof console.warn !== "function") {
             console.warn(name + " is deprecated, use " + alternative +
                          " instead.", new Error("").stack);

[Survived] StringLiteral
q.js:483:49
         if (typeof console !== "undefined" &&
             typeof console.warn === "function") {
             console.warn(name + " is deprecated, use " + alternative +
-                         " instead.", new Error("").stack);
+                         " instead.", new Error("Stryker was here!").stack);
         }
         return callback.apply(callback, arguments);

[Killed] BlockStatement
q.js:497:19
  * coerces promises from different systems.
  * @param value immediate reference or promise
  */
-function Q(value) {
-    // If the object is already a Promise, return it directly.  This enables
-    // the resolve function to both be used to created references from objects,
-    // but to tolerably coerce non-promises to promises.
-    if (value instanceof Promise) {
-        return value;
-    }
-
-    // assimilate thenables
-    if (isPromiseAlike(value)) {
-        return coerce(value);
-    } else {
-        return fulfill(value);
-    }
-}
+function Q(value) {}
 Q.resolve = Q;
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:501:9
     // If the object is already a Promise, return it directly.  This enables
     // the resolve function to both be used to created references from objects,
     // but to tolerably coerce non-promises to promises.
-    if (value instanceof Promise) {
+    if (true) {
         return value;
     }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:501:35
     // If the object is already a Promise, return it directly.  This enables
     // the resolve function to both be used to created references from objects,
     // but to tolerably coerce non-promises to promises.
-    if (value instanceof Promise) {
-        return value;
-    }
+    if (value instanceof Promise) {}
 
     // assimilate thenables

[Killed] BlockStatement
q.js:506:32
     }
 
     // assimilate thenables
-    if (isPromiseAlike(value)) {
-        return coerce(value);
-    } else {
+    if (isPromiseAlike(value)) {} else {
         return fulfill(value);
     }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:506:9
     }
 
     // assimilate thenables
-    if (isPromiseAlike(value)) {
+    if (false) {
         return coerce(value);
     } else {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] BlockStatement
q.js:508:12
     // assimilate thenables
     if (isPromiseAlike(value)) {
         return coerce(value);
-    } else {
-        return fulfill(value);
-    }
+    } else {}
 }
 Q.resolve = Q;
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BooleanLiteral
q.js:523:22
 /**
  * Controls whether or not long stack traces will be on
  */
-Q.longStackSupport = false;
+Q.longStackSupport = true;
 
 /**

[Survived] BlockStatement
q.js:534:83
 var longStackCounter = 1;
 
 // enable long stacks if Q_DEBUG is set
-if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
-    Q.longStackSupport = true;
-}
+if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {}
 
 /**

[Survived] EqualityOperator
q.js:534:5
 var longStackCounter = 1;
 
 // enable long stacks if Q_DEBUG is set
-if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
+if (typeof process !== "object" && process && process.env && process.env.Q_DEBUG) {
     Q.longStackSupport = true;
 }

[Survived] BooleanLiteral
q.js:535:26
 
 // enable long stacks if Q_DEBUG is set
 if (typeof process === "object" && process && process.env && process.env.Q_DEBUG) {
-    Q.longStackSupport = true;
+    Q.longStackSupport = false;
 }
 

[Timeout] BlockStatement
q.js:561:64
     var deferred = object_create(defer.prototype);
     var promise = object_create(Promise.prototype);
 
-    promise.promiseDispatch = function (resolve, op, operands) {
-        var args = array_slice(arguments);
-        if (messages) {
-            messages.push(args);
-            if (op === "when" && operands[1]) { // progress operand
-                progressListeners.push(operands[1]);
-            }
-        } else {
-            Q.nextTick(function () {
-                resolvedPromise.promiseDispatch.apply(resolvedPromise, args);
-            });
-        }
-    };
+    promise.promiseDispatch = function (resolve, op, operands) {};
 
     // XXX deprecated

[Killed] ConditionalExpression
q.js:563:13
 
     promise.promiseDispatch = function (resolve, op, operands) {
         var args = array_slice(arguments);
-        if (messages) {
+        if (true) {
             messages.push(args);
             if (op === "when" && operands[1]) { // progress operand
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:563:13
 
     promise.promiseDispatch = function (resolve, op, operands) {
         var args = array_slice(arguments);
-        if (messages) {
+        if (false) {
             messages.push(args);
             if (op === "when" && operands[1]) { // progress operand
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:565:47
         var args = array_slice(arguments);
         if (messages) {
             messages.push(args);
-            if (op === "when" && operands[1]) { // progress operand
-                progressListeners.push(operands[1]);
-            }
+            if (op === "when" && operands[1]) {}
         } else {
             Q.nextTick(function () {

[Survived] ConditionalExpression
q.js:565:17
         var args = array_slice(arguments);
         if (messages) {
             messages.push(args);
-            if (op === "when" && operands[1]) { // progress operand
+            if (false) { // progress operand
                 progressListeners.push(operands[1]);
             }

[Timeout] BlockStatement
q.js:568:16
             if (op === "when" && operands[1]) { // progress operand
                 progressListeners.push(operands[1]);
             }
-        } else {
-            Q.nextTick(function () {
-                resolvedPromise.promiseDispatch.apply(resolvedPromise, args);
-            });
-        }
+        } else {}
     };
 

[Timeout] BlockStatement
q.js:569:36
                 progressListeners.push(operands[1]);
             }
         } else {
-            Q.nextTick(function () {
-                resolvedPromise.promiseDispatch.apply(resolvedPromise, args);
-            });
+            Q.nextTick(function () {});
         }
     };

[Survived] BlockStatement
q.js:576:35
     };
 
     // XXX deprecated
-    promise.valueOf = function () {
-        if (messages) {
-            return promise;
-        }
-        var nearerValue = nearer(resolvedPromise);
-        if (isPromise(nearerValue)) {
-            resolvedPromise = nearerValue; // shorten chain
-        }
-        return nearerValue;
-    };
+    promise.valueOf = function () {};
 
     promise.inspect = function () {

[Survived] ConditionalExpression
q.js:577:13
 
     // XXX deprecated
     promise.valueOf = function () {
-        if (messages) {
+        if (false) {
             return promise;
         }

[Survived] ConditionalExpression
q.js:577:13
 
     // XXX deprecated
     promise.valueOf = function () {
-        if (messages) {
+        if (true) {
             return promise;
         }

[Survived] ConditionalExpression
q.js:581:13
             return promise;
         }
         var nearerValue = nearer(resolvedPromise);
-        if (isPromise(nearerValue)) {
+        if (false) {
             resolvedPromise = nearerValue; // shorten chain
         }

[Survived] ConditionalExpression
q.js:581:13
             return promise;
         }
         var nearerValue = nearer(resolvedPromise);
-        if (isPromise(nearerValue)) {
+        if (true) {
             resolvedPromise = nearerValue; // shorten chain
         }

[Survived] BlockStatement
q.js:587:35
         return nearerValue;
     };
 
-    promise.inspect = function () {
-        if (!resolvedPromise) {
-            return { state: "pending" };
-        }
-        return resolvedPromise.inspect();
-    };
+    promise.inspect = function () {};
 
     if (Q.longStackSupport && hasStacks) {

[Survived] ConditionalExpression
q.js:588:13
     };
 
     promise.inspect = function () {
-        if (!resolvedPromise) {
+        if (false) {
             return { state: "pending" };
         }

[Survived] BooleanLiteral
q.js:588:13
     };
 
     promise.inspect = function () {
-        if (!resolvedPromise) {
+        if (resolvedPromise) {
             return { state: "pending" };
         }

[Survived] BlockStatement
q.js:594:42
         return resolvedPromise.inspect();
     };
 
-    if (Q.longStackSupport && hasStacks) {
-        try {
-            throw new Error();
-        } catch (e) {
-            // NOTE: don't try to use `Error.captureStackTrace` or transfer the
-            // accessor around; that causes memory leaks as per GH-111. Just
-            // reify the stack trace as a string ASAP.
-            //
-            // At the same time, cut off the first line; it's always just
-            // "[object Promise]\n", as per the `toString`.
-            promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
-            promise.stackCounter = longStackCounter++;
-        }
-    }
+    if (Q.longStackSupport && hasStacks) {}
 
     // NOTE: we do the checks for `resolvedPromise` in each method, instead of

[Survived] ConditionalExpression
q.js:594:9
         return resolvedPromise.inspect();
     };
 
-    if (Q.longStackSupport && hasStacks) {
+    if (true) {
         try {
             throw new Error();

[Survived] BlockStatement
q.js:595:13
     };
 
     if (Q.longStackSupport && hasStacks) {
-        try {
-            throw new Error();
-        } catch (e) {
+        try {} catch (e) {
             // NOTE: don't try to use `Error.captureStackTrace` or transfer the
             // accessor around; that causes memory leaks as per GH-111. Just

[Survived] BlockStatement
q.js:597:21
     if (Q.longStackSupport && hasStacks) {
         try {
             throw new Error();
-        } catch (e) {
-            // NOTE: don't try to use `Error.captureStackTrace` or transfer the
-            // accessor around; that causes memory leaks as per GH-111. Just
-            // reify the stack trace as a string ASAP.
-            //
-            // At the same time, cut off the first line; it's always just
-            // "[object Promise]\n", as per the `toString`.
-            promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
-            promise.stackCounter = longStackCounter++;
-        }
+        } catch (e) {}
     }
 

[Survived] MethodExpression
q.js:604:29
             //
             // At the same time, cut off the first line; it's always just
             // "[object Promise]\n", as per the `toString`.
-            promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
+            promise.stack = e.stack;
             promise.stackCounter = longStackCounter++;
         }

[Survived] ArithmeticOperator
q.js:604:47
             //
             // At the same time, cut off the first line; it's always just
             // "[object Promise]\n", as per the `toString`.
-            promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
+            promise.stack = e.stack.substring(e.stack.indexOf("\n") - 1);
             promise.stackCounter = longStackCounter++;
         }

[Survived] UpdateOperator
q.js:605:36
             // At the same time, cut off the first line; it's always just
             // "[object Promise]\n", as per the `toString`.
             promise.stack = e.stack.substring(e.stack.indexOf("\n") + 1);
-            promise.stackCounter = longStackCounter++;
+            promise.stackCounter = longStackCounter--;
         }
     }

[Timeout] BlockStatement
q.js:613:33
     // consolidating them into `become`, since otherwise we'd create new
     // promises with the lines `become(whatever(value))`. See e.g. GH-252.
 
-    function become(newPromise) {
-        resolvedPromise = newPromise;
-
-        if (Q.longStackSupport && hasStacks) {
-            // Only hold a reference to the new promise if long stacks
-            // are enabled to reduce memory usage
-            promise.source = newPromise;
-        }
-
-        array_reduce(messages, function (undefined, message) {
-            Q.nextTick(function () {
-                newPromise.promiseDispatch.apply(newPromise, message);
-            });
-        }, void 0);
-
-        messages = void 0;
-        progressListeners = void 0;
-    }
+    function become(newPromise) {}
 
     deferred.promise = promise;

[Survived] LogicalOperator
q.js:616:13
     function become(newPromise) {
         resolvedPromise = newPromise;
 
-        if (Q.longStackSupport && hasStacks) {
+        if (Q.longStackSupport || hasStacks) {
             // Only hold a reference to the new promise if long stacks
             // are enabled to reduce memory usage

[Timeout] BlockStatement
q.js:622:62
             promise.source = newPromise;
         }
 
-        array_reduce(messages, function (undefined, message) {
-            Q.nextTick(function () {
-                newPromise.promiseDispatch.apply(newPromise, message);
-            });
-        }, void 0);
+        array_reduce(messages, function (undefined, message) {}, void 0);
 
         messages = void 0;

[Timeout] BlockStatement
q.js:623:36
         }
 
         array_reduce(messages, function (undefined, message) {
-            Q.nextTick(function () {
-                newPromise.promiseDispatch.apply(newPromise, message);
-            });
+            Q.nextTick(function () {});
         }, void 0);
 

[Timeout] BlockStatement
q.js:633:41
     }
 
     deferred.promise = promise;
-    deferred.resolve = function (value) {
-        if (resolvedPromise) {
-            return;
-        }
-
-        become(Q(value));
-    };
+    deferred.resolve = function (value) {};
 
     deferred.fulfill = function (value) {

[Killed] BlockStatement
q.js:634:30
 
     deferred.promise = promise;
     deferred.resolve = function (value) {
-        if (resolvedPromise) {
-            return;
-        }
+        if (resolvedPromise) {}
 
         become(Q(value));
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:634:13
 
     deferred.promise = promise;
     deferred.resolve = function (value) {
-        if (resolvedPromise) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:641:41
         become(Q(value));
     };
 
-    deferred.fulfill = function (value) {
-        if (resolvedPromise) {
-            return;
-        }
-
-        become(fulfill(value));
-    };
+    deferred.fulfill = function (value) {};
     deferred.reject = function (reason) {
         if (resolvedPromise) {

[Survived] ConditionalExpression
q.js:642:13
     };
 
     deferred.fulfill = function (value) {
-        if (resolvedPromise) {
+        if (true) {
             return;
         }

[Survived] BlockStatement
q.js:642:30
     };
 
     deferred.fulfill = function (value) {
-        if (resolvedPromise) {
-            return;
-        }
+        if (resolvedPromise) {}
 
         become(fulfill(value));

[Timeout] BlockStatement
q.js:648:41
 
         become(fulfill(value));
     };
-    deferred.reject = function (reason) {
-        if (resolvedPromise) {
-            return;
-        }
-
-        become(reject(reason));
-    };
+    deferred.reject = function (reason) {};
     deferred.notify = function (progress) {
         if (resolvedPromise) {

[Killed] ConditionalExpression
q.js:649:13
         become(fulfill(value));
     };
     deferred.reject = function (reason) {
-        if (resolvedPromise) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] BlockStatement
q.js:649:30
         become(fulfill(value));
     };
     deferred.reject = function (reason) {
-        if (resolvedPromise) {
-            return;
-        }
+        if (resolvedPromise) {}
 
         become(reject(reason));
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:655:43
 
         become(reject(reason));
     };
-    deferred.notify = function (progress) {
-        if (resolvedPromise) {
-            return;
-        }
-
-        array_reduce(progressListeners, function (undefined, progressListener) {
-            Q.nextTick(function () {
-                progressListener(progress);
-            });
-        }, void 0);
-    };
+    deferred.notify = function (progress) {};
 
     return deferred;

[Survived] BlockStatement
q.js:656:30
         become(reject(reason));
     };
     deferred.notify = function (progress) {
-        if (resolvedPromise) {
-            return;
-        }
+        if (resolvedPromise) {}
 
         array_reduce(progressListeners, function (undefined, progressListener) {

[Survived] ConditionalExpression
q.js:656:13
         become(reject(reason));
     };
     deferred.notify = function (progress) {
-        if (resolvedPromise) {
+        if (true) {
             return;
         }

[Survived] BlockStatement
q.js:660:80
             return;
         }
 
-        array_reduce(progressListeners, function (undefined, progressListener) {
-            Q.nextTick(function () {
-                progressListener(progress);
-            });
-        }, void 0);
+        array_reduce(progressListeners, function (undefined, progressListener) {}, void 0);
     };
 

[Survived] BlockStatement
q.js:661:36
         }
 
         array_reduce(progressListeners, function (undefined, progressListener) {
-            Q.nextTick(function () {
-                progressListener(progress);
-            });
+            Q.nextTick(function () {});
         }, void 0);
     };
