[Survived] BlockStatement
q.js:675:48
  * promise.
  * @returns a nodeback
  */
-defer.prototype.makeNodeResolver = function () {
-    var self = this;
-    return function (error, value) {
-        if (error) {
-            self.reject(error);
-        } else if (arguments.length > 2) {
-            self.resolve(array_slice(arguments, 1));
-        } else {
-            self.resolve(value);
-        }
-    };
-};
+defer.prototype.makeNodeResolver = function () {};
 
 /**

[Survived] BlockStatement
q.js:677:36
  */
 defer.prototype.makeNodeResolver = function () {
     var self = this;
-    return function (error, value) {
-        if (error) {
-            self.reject(error);
-        } else if (arguments.length > 2) {
-            self.resolve(array_slice(arguments, 1));
-        } else {
-            self.resolve(value);
-        }
-    };
+    return function (error, value) {};
 };
 

[Survived] ConditionalExpression
q.js:678:13
 defer.prototype.makeNodeResolver = function () {
     var self = this;
     return function (error, value) {
-        if (error) {
+        if (false) {
             self.reject(error);
         } else if (arguments.length > 2) {

[Survived] BlockStatement
q.js:678:20
 defer.prototype.makeNodeResolver = function () {
     var self = this;
     return function (error, value) {
-        if (error) {
-            self.reject(error);
-        } else if (arguments.length > 2) {
+        if (error) {} else if (arguments.length > 2) {
             self.resolve(array_slice(arguments, 1));
         } else {

[Survived] ConditionalExpression
q.js:680:20
     return function (error, value) {
         if (error) {
             self.reject(error);
-        } else if (arguments.length > 2) {
+        } else if (true) {
             self.resolve(array_slice(arguments, 1));
         } else {

[Survived] BlockStatement
q.js:680:42
     return function (error, value) {
         if (error) {
             self.reject(error);
-        } else if (arguments.length > 2) {
-            self.resolve(array_slice(arguments, 1));
-        } else {
+        } else if (arguments.length > 2) {} else {
             self.resolve(value);
         }

[Survived] BlockStatement
q.js:682:16
             self.reject(error);
         } else if (arguments.length > 2) {
             self.resolve(array_slice(arguments, 1));
-        } else {
-            self.resolve(value);
-        }
+        } else {}
     };
 };

[Survived] BlockStatement
q.js:696:28
  */
 Q.Promise = promise; // ES6
 Q.promise = promise;
-function promise(resolver) {
-    if (typeof resolver !== "function") {
-        throw new TypeError("resolver must be a function.");
-    }
-    var deferred = defer();
-    try {
-        resolver(deferred.resolve, deferred.reject, deferred.notify);
-    } catch (reason) {
-        deferred.reject(reason);
-    }
-    return deferred.promise;
-}
+function promise(resolver) {}
 
 promise.race = race; // ES6

[Survived] ConditionalExpression
q.js:697:9
 Q.Promise = promise; // ES6
 Q.promise = promise;
 function promise(resolver) {
-    if (typeof resolver !== "function") {
+    if (false) {
         throw new TypeError("resolver must be a function.");
     }

[Survived] EqualityOperator
q.js:697:9
 Q.Promise = promise; // ES6
 Q.promise = promise;
 function promise(resolver) {
-    if (typeof resolver !== "function") {
+    if (typeof resolver === "function") {
         throw new TypeError("resolver must be a function.");
     }

[Survived] StringLiteral
q.js:698:29
 Q.promise = promise;
 function promise(resolver) {
     if (typeof resolver !== "function") {
-        throw new TypeError("resolver must be a function.");
+        throw new TypeError("");
     }
     var deferred = defer();

[Survived] BlockStatement
q.js:701:9
         throw new TypeError("resolver must be a function.");
     }
     var deferred = defer();
-    try {
-        resolver(deferred.resolve, deferred.reject, deferred.notify);
-    } catch (reason) {
+    try {} catch (reason) {
         deferred.reject(reason);
     }

[Survived] BlockStatement
q.js:703:22
     var deferred = defer();
     try {
         resolver(deferred.resolve, deferred.reject, deferred.notify);
-    } catch (reason) {
-        deferred.reject(reason);
-    }
+    } catch (reason) {}
     return deferred.promise;
 }

[Survived] BlockStatement
q.js:717:34
 // XXX experimental.  This method is a way to denote that a local value is
 // serializable and should be immediately dispatched to a remote upon request,
 // instead of passing a reference.
-Q.passByCopy = function (object) {
-    //freeze(object);
-    //passByCopies.set(object, true);
-    return object;
-};
+Q.passByCopy = function (object) {};
 
 Promise.prototype.passByCopy = function () {

[Survived] BlockStatement
q.js:723:44
     return object;
 };
 
-Promise.prototype.passByCopy = function () {
-    //freeze(object);
-    //passByCopies.set(object, true);
-    return this;
-};
+Promise.prototype.passByCopy = function () {};
 
 /**

[Survived] BlockStatement
q.js:738:26
  * otherwise.
  *
  */
-Q.join = function (x, y) {
-    return Q(x).join(y);
-};
+Q.join = function (x, y) {};
 
 Promise.prototype.join = function (that) {

[Survived] BlockStatement
q.js:742:42
     return Q(x).join(y);
 };
 
-Promise.prototype.join = function (that) {
-    return Q([this, that]).spread(function (x, y) {
-        if (x === y) {
-            // TODO: "===" should be Object.is or equiv
-            return x;
-        } else {
-            throw new Error("Q can't join: not the same: " + x + " " + y);
-        }
-    });
-};
+Promise.prototype.join = function (that) {};
 
 /**

[Survived] BlockStatement
q.js:743:51
 };
 
 Promise.prototype.join = function (that) {
-    return Q([this, that]).spread(function (x, y) {
-        if (x === y) {
-            // TODO: "===" should be Object.is or equiv
-            return x;
-        } else {
-            throw new Error("Q can't join: not the same: " + x + " " + y);
-        }
-    });
+    return Q([this, that]).spread(function (x, y) {});
 };
 

[Survived] ArrayDeclaration
q.js:743:14
 };
 
 Promise.prototype.join = function (that) {
-    return Q([this, that]).spread(function (x, y) {
+    return Q([]).spread(function (x, y) {
         if (x === y) {
             // TODO: "===" should be Object.is or equiv

[Survived] EqualityOperator
q.js:744:13
 
 Promise.prototype.join = function (that) {
     return Q([this, that]).spread(function (x, y) {
-        if (x === y) {
+        if (x !== y) {
             // TODO: "===" should be Object.is or equiv
             return x;

[Survived] BlockStatement
q.js:744:22
 
 Promise.prototype.join = function (that) {
     return Q([this, that]).spread(function (x, y) {
-        if (x === y) {
-            // TODO: "===" should be Object.is or equiv
-            return x;
-        } else {
+        if (x === y) {} else {
             throw new Error("Q can't join: not the same: " + x + " " + y);
         }

[Survived] BlockStatement
q.js:747:16
         if (x === y) {
             // TODO: "===" should be Object.is or equiv
             return x;
-        } else {
-            throw new Error("Q can't join: not the same: " + x + " " + y);
-        }
+        } else {}
     });
 };

[Survived] BlockStatement
q.js:759:25
  * @returns {Any*} the first promise to be settled
  */
 Q.race = race;
-function race(answerPs) {
-    return promise(function (resolve, reject) {
-        // Switch to this once we can assume at least ES5
-        // answerPs.forEach(function (answerP) {
-        //     Q(answerP).then(resolve, reject);
-        // });
-        // Use this in the meantime
-        for (var i = 0, len = answerPs.length; i < len; i++) {
-            Q(answerPs[i]).then(resolve, reject);
-        }
-    });
-}
+function race(answerPs) {}
 
 Promise.prototype.race = function () {

[Survived] BlockStatement
q.js:760:47
  */
 Q.race = race;
 function race(answerPs) {
-    return promise(function (resolve, reject) {
-        // Switch to this once we can assume at least ES5
-        // answerPs.forEach(function (answerP) {
-        //     Q(answerP).then(resolve, reject);
-        // });
-        // Use this in the meantime
-        for (var i = 0, len = answerPs.length; i < len; i++) {
-            Q(answerPs[i]).then(resolve, reject);
-        }
-    });
+    return promise(function (resolve, reject) {});
 }
 

[Survived] BlockStatement
q.js:766:62
         //     Q(answerP).then(resolve, reject);
         // });
         // Use this in the meantime
-        for (var i = 0, len = answerPs.length; i < len; i++) {
-            Q(answerPs[i]).then(resolve, reject);
-        }
+        for (var i = 0, len = answerPs.length; i < len; i++) {}
     });
 }

[Survived] ConditionalExpression
q.js:766:48
         //     Q(answerP).then(resolve, reject);
         // });
         // Use this in the meantime
-        for (var i = 0, len = answerPs.length; i < len; i++) {
+        for (var i = 0, len = answerPs.length; false; i++) {
             Q(answerPs[i]).then(resolve, reject);
         }

[Survived] BlockStatement
q.js:772:38
     });
 }
 
-Promise.prototype.race = function () {
-    return this.then(Q.race);
-};
+Promise.prototype.race = function () {};
 
 /**

[Survived] ConditionalExpression
q.js:789:9
  */
 Q.makePromise = Promise;
 function Promise(descriptor, fallback, inspect) {
-    if (fallback === void 0) {
+    if (true) {
         fallback = function (op) {
             return reject(new Error(

[Survived] EqualityOperator
q.js:789:9
  */
 Q.makePromise = Promise;
 function Promise(descriptor, fallback, inspect) {
-    if (fallback === void 0) {
+    if (fallback !== void 0) {
         fallback = function (op) {
             return reject(new Error(

[Survived] BlockStatement
q.js:790:34
 Q.makePromise = Promise;
 function Promise(descriptor, fallback, inspect) {
     if (fallback === void 0) {
-        fallback = function (op) {
-            return reject(new Error(
-                "Promise does not support operation: " + op
-            ));
-        };
+        fallback = function (op) {};
     }
     if (inspect === void 0) {

[Survived] ConditionalExpression
q.js:796:9
             ));
         };
     }
-    if (inspect === void 0) {
+    if (false) {
         inspect = function () {
             return {state: "unknown"};

[Survived] ConditionalExpression
q.js:796:9
             ));
         };
     }
-    if (inspect === void 0) {
+    if (true) {
         inspect = function () {
             return {state: "unknown"};

[Survived] BlockStatement
q.js:797:31
         };
     }
     if (inspect === void 0) {
-        inspect = function () {
-            return {state: "unknown"};
-        };
+        inspect = function () {};
     }
 

[Survived] StringLiteral
q.js:798:28
     }
     if (inspect === void 0) {
         inspect = function () {
-            return {state: "unknown"};
+            return {state: ""};
         };
     }

[Timeout] BlockStatement
q.js:804:60
 
     var promise = object_create(Promise.prototype);
 
-    promise.promiseDispatch = function (resolve, op, args) {
-        var result;
-        try {
-            if (descriptor[op]) {
-                result = descriptor[op].apply(promise, args);
-            } else {
-                result = fallback.call(promise, op, args);
-            }
-        } catch (exception) {
-            result = reject(exception);
-        }
-        if (resolve) {
-            resolve(result);
-        }
-    };
+    promise.promiseDispatch = function (resolve, op, args) {};
 
     promise.inspect = inspect;

[Timeout] BlockStatement
q.js:806:13
 
     promise.promiseDispatch = function (resolve, op, args) {
         var result;
-        try {
-            if (descriptor[op]) {
-                result = descriptor[op].apply(promise, args);
-            } else {
-                result = fallback.call(promise, op, args);
-            }
-        } catch (exception) {
+        try {} catch (exception) {
             result = reject(exception);
         }

[Survived] ConditionalExpression
q.js:807:17
     promise.promiseDispatch = function (resolve, op, args) {
         var result;
         try {
-            if (descriptor[op]) {
+            if (true) {
                 result = descriptor[op].apply(promise, args);
             } else {

[Timeout] ConditionalExpression
q.js:807:17
     promise.promiseDispatch = function (resolve, op, args) {
         var result;
         try {
-            if (descriptor[op]) {
+            if (false) {
                 result = descriptor[op].apply(promise, args);
             } else {

[Survived] BlockStatement
q.js:809:20
         try {
             if (descriptor[op]) {
                 result = descriptor[op].apply(promise, args);
-            } else {
-                result = fallback.call(promise, op, args);
-            }
+            } else {}
         } catch (exception) {
             result = reject(exception);

[Survived] BlockStatement
q.js:812:29
             } else {
                 result = fallback.call(promise, op, args);
             }
-        } catch (exception) {
-            result = reject(exception);
-        }
+        } catch (exception) {}
         if (resolve) {
             resolve(result);

[Killed] ConditionalExpression
q.js:815:13
         } catch (exception) {
             result = reject(exception);
         }
-        if (resolve) {
+        if (true) {
             resolve(result);
         }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] BlockStatement
q.js:815:22
         } catch (exception) {
             result = reject(exception);
         }
-        if (resolve) {
-            resolve(result);
-        }
+        if (resolve) {}
     };
 

[Survived] BlockStatement
q.js:823:18
     promise.inspect = inspect;
 
     // XXX deprecated `valueOf` and `exception` support
-    if (inspect) {
-        var inspected = inspect();
-        if (inspected.state === "rejected") {
-            promise.exception = inspected.reason;
-        }
-
-        promise.valueOf = function () {
-            var inspected = inspect();
-            if (inspected.state === "pending" ||
-                inspected.state === "rejected") {
-                return promise;
-            }
-            return inspected.value;
-        };
-    }
+    if (inspect) {}
 
     return promise;

[Survived] ConditionalExpression
q.js:823:9
     promise.inspect = inspect;
 
     // XXX deprecated `valueOf` and `exception` support
-    if (inspect) {
+    if (false) {
         var inspected = inspect();
         if (inspected.state === "rejected") {

[Survived] ConditionalExpression
q.js:825:13
     // XXX deprecated `valueOf` and `exception` support
     if (inspect) {
         var inspected = inspect();
-        if (inspected.state === "rejected") {
+        if (true) {
             promise.exception = inspected.reason;
         }

[Survived] BlockStatement
q.js:825:45
     // XXX deprecated `valueOf` and `exception` support
     if (inspect) {
         var inspected = inspect();
-        if (inspected.state === "rejected") {
-            promise.exception = inspected.reason;
-        }
+        if (inspected.state === "rejected") {}
 
         promise.valueOf = function () {

[Survived] BlockStatement
q.js:829:39
             promise.exception = inspected.reason;
         }
 
-        promise.valueOf = function () {
-            var inspected = inspect();
-            if (inspected.state === "pending" ||
-                inspected.state === "rejected") {
-                return promise;
-            }
-            return inspected.value;
-        };
+        promise.valueOf = function () {};
     }
 

[Survived] ConditionalExpression
q.js:831:17
 
         promise.valueOf = function () {
             var inspected = inspect();
-            if (inspected.state === "pending" ||
-                inspected.state === "rejected") {
+            if (false) {
                 return promise;
             }

[Survived] ConditionalExpression
q.js:831:17
 
         promise.valueOf = function () {
             var inspected = inspect();
-            if (inspected.state === "pending" ||
+            if (false ||
                 inspected.state === "rejected") {
                 return promise;

[Survived] BlockStatement
q.js:832:49
         promise.valueOf = function () {
             var inspected = inspect();
             if (inspected.state === "pending" ||
-                inspected.state === "rejected") {
-                return promise;
-            }
+                inspected.state === "rejected") {}
             return inspected.value;
         };

[Survived] ConditionalExpression
q.js:832:17
         promise.valueOf = function () {
             var inspected = inspect();
             if (inspected.state === "pending" ||
-                inspected.state === "rejected") {
+                false) {
                 return promise;
             }

[Survived] BlockStatement
q.js:842:42
     return promise;
 }
 
-Promise.prototype.toString = function () {
-    return "[object Promise]";
-};
+Promise.prototype.toString = function () {};
 
 Promise.prototype.then = function (fulfilled, rejected, progressed) {

[Timeout] BooleanLiteral
q.js:849:16
 Promise.prototype.then = function (fulfilled, rejected, progressed) {
     var self = this;
     var deferred = defer();
-    var done = false;   // ensure the untrusted promise makes at most a
+    var done = true;   // ensure the untrusted promise makes at most a
                         // single call to one of the callbacks
 

[Timeout] BlockStatement
q.js:852:32
     var done = false;   // ensure the untrusted promise makes at most a
                         // single call to one of the callbacks
 
-    function _fulfilled(value) {
-        try {
-            return typeof fulfilled === "function" ? fulfilled(value) : value;
-        } catch (exception) {
-            return reject(exception);
-        }
-    }
+    function _fulfilled(value) {}
 
     function _rejected(exception) {

[Timeout] BlockStatement
q.js:853:13
                         // single call to one of the callbacks
 
     function _fulfilled(value) {
-        try {
-            return typeof fulfilled === "function" ? fulfilled(value) : value;
-        } catch (exception) {
+        try {} catch (exception) {
             return reject(exception);
         }

[Killed] ConditionalExpression
q.js:854:20
 
     function _fulfilled(value) {
         try {
-            return typeof fulfilled === "function" ? fulfilled(value) : value;
+            return true ? fulfilled(value) : value;
         } catch (exception) {
             return reject(exception);
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] EqualityOperator
q.js:854:20
 
     function _fulfilled(value) {
         try {
-            return typeof fulfilled === "function" ? fulfilled(value) : value;
+            return typeof fulfilled !== "function" ? fulfilled(value) : value;
         } catch (exception) {
             return reject(exception);

[Killed] BlockStatement
q.js:855:29
     function _fulfilled(value) {
         try {
             return typeof fulfilled === "function" ? fulfilled(value) : value;
-        } catch (exception) {
-            return reject(exception);
-        }
+        } catch (exception) {}
     }
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] BlockStatement
q.js:860:35
         }
     }
 
-    function _rejected(exception) {
-        if (typeof rejected === "function") {
-            makeStackTraceLong(exception, self);
-            try {
-                return rejected(exception);
-            } catch (newException) {
-                return reject(newException);
-            }
-        }
-        return reject(exception);
-    }
+    function _rejected(exception) {}
 
     function _progressed(value) {

[Killed] ConditionalExpression
q.js:861:13
     }
 
     function _rejected(exception) {
-        if (typeof rejected === "function") {
+        if (true) {
             makeStackTraceLong(exception, self);
             try {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] EqualityOperator
q.js:861:13
     }
 
     function _rejected(exception) {
-        if (typeof rejected === "function") {
+        if (typeof rejected !== "function") {
             makeStackTraceLong(exception, self);
             try {

[Timeout] BlockStatement
q.js:863:17
     function _rejected(exception) {
         if (typeof rejected === "function") {
             makeStackTraceLong(exception, self);
-            try {
-                return rejected(exception);
-            } catch (newException) {
+            try {} catch (newException) {
                 return reject(newException);
             }

[Killed] BlockStatement
q.js:865:36
             makeStackTraceLong(exception, self);
             try {
                 return rejected(exception);
-            } catch (newException) {
-                return reject(newException);
-            }
+            } catch (newException) {}
         }
         return reject(exception);
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:872:33
         return reject(exception);
     }
 
-    function _progressed(value) {
-        return typeof progressed === "function" ? progressed(value) : value;
-    }
+    function _progressed(value) {}
 
     Q.nextTick(function () {

[Survived] ConditionalExpression
q.js:873:16
     }
 
     function _progressed(value) {
-        return typeof progressed === "function" ? progressed(value) : value;
+        return false ? progressed(value) : value;
     }
 

[Survived] EqualityOperator
q.js:873:16
     }
 
     function _progressed(value) {
-        return typeof progressed === "function" ? progressed(value) : value;
+        return typeof progressed !== "function" ? progressed(value) : value;
     }
 

[Timeout] BlockStatement
q.js:876:28
         return typeof progressed === "function" ? progressed(value) : value;
     }
 
-    Q.nextTick(function () {
-        self.promiseDispatch(function (value) {
-            if (done) {
-                return;
-            }
-            done = true;
-
-            deferred.resolve(_fulfilled(value));
-        }, "when", [function (exception) {
-            if (done) {
-                return;
-            }
-            done = true;
-
-            deferred.resolve(_rejected(exception));
-        }]);
-    });
+    Q.nextTick(function () {});
 
     // Progress propagator need to be attached in the current tick.

[Timeout] BlockStatement
q.js:877:47
     }
 
     Q.nextTick(function () {
-        self.promiseDispatch(function (value) {
-            if (done) {
-                return;
-            }
-            done = true;
-
-            deferred.resolve(_fulfilled(value));
-        }, "when", [function (exception) {
+        self.promiseDispatch(function (value) {}, "when", [function (exception) {
             if (done) {
                 return;

[Killed] BlockStatement
q.js:878:23
 
     Q.nextTick(function () {
         self.promiseDispatch(function (value) {
-            if (done) {
-                return;
-            }
+            if (done) {}
             done = true;
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:878:17
 
     Q.nextTick(function () {
         self.promiseDispatch(function (value) {
-            if (done) {
+            if (false) {
                 return;
             }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BooleanLiteral
q.js:881:20
             if (done) {
                 return;
             }
-            done = true;
+            done = false;
 
             deferred.resolve(_fulfilled(value));

[Timeout] BlockStatement
q.js:884:42
             done = true;
 
             deferred.resolve(_fulfilled(value));
-        }, "when", [function (exception) {
-            if (done) {
-                return;
-            }
-            done = true;
-
-            deferred.resolve(_rejected(exception));
-        }]);
+        }, "when", [function (exception) {}]);
     });
 

[Survived] BlockStatement
q.js:885:23
 
             deferred.resolve(_fulfilled(value));
         }, "when", [function (exception) {
-            if (done) {
-                return;
-            }
+            if (done) {}
             done = true;
 

[Survived] ConditionalExpression
q.js:885:17
 
             deferred.resolve(_fulfilled(value));
         }, "when", [function (exception) {
-            if (done) {
+            if (false) {
                 return;
             }

[Survived] BlockStatement
q.js:895:68
     });
 
     // Progress propagator need to be attached in the current tick.
-    self.promiseDispatch(void 0, "when", [void 0, function (value) {
-        var newValue;
-        var threw = false;
-        try {
-            newValue = _progressed(value);
-        } catch (e) {
-            threw = true;
-            if (Q.onerror) {
-                Q.onerror(e);
-            } else {
-                throw e;
-            }
-        }
-
-        if (!threw) {
-            deferred.notify(newValue);
-        }
-    }]);
+    self.promiseDispatch(void 0, "when", [void 0, function (value) {}]);
 
     return deferred.promise;

[Survived] BooleanLiteral
q.js:897:21
     // Progress propagator need to be attached in the current tick.
     self.promiseDispatch(void 0, "when", [void 0, function (value) {
         var newValue;
-        var threw = false;
+        var threw = true;
         try {
             newValue = _progressed(value);

[Survived] BlockStatement
q.js:898:13
     self.promiseDispatch(void 0, "when", [void 0, function (value) {
         var newValue;
         var threw = false;
-        try {
-            newValue = _progressed(value);
-        } catch (e) {
+        try {} catch (e) {
             threw = true;
             if (Q.onerror) {

[Survived] BlockStatement
q.js:900:21
         var threw = false;
         try {
             newValue = _progressed(value);
-        } catch (e) {
-            threw = true;
-            if (Q.onerror) {
-                Q.onerror(e);
-            } else {
-                throw e;
-            }
-        }
+        } catch (e) {}
 
         if (!threw) {

[Survived] BooleanLiteral
q.js:901:21
         try {
             newValue = _progressed(value);
         } catch (e) {
-            threw = true;
+            threw = false;
             if (Q.onerror) {
                 Q.onerror(e);

[Survived] ConditionalExpression
q.js:902:17
             newValue = _progressed(value);
         } catch (e) {
             threw = true;
-            if (Q.onerror) {
+            if (true) {
                 Q.onerror(e);
             } else {

[Survived] BlockStatement
q.js:902:28
             newValue = _progressed(value);
         } catch (e) {
             threw = true;
-            if (Q.onerror) {
-                Q.onerror(e);
-            } else {
+            if (Q.onerror) {} else {
                 throw e;
             }

[Survived] BlockStatement
q.js:904:20
             threw = true;
             if (Q.onerror) {
                 Q.onerror(e);
-            } else {
-                throw e;
-            }
+            } else {}
         }
 

[Survived] BooleanLiteral
q.js:909:13
             }
         }
 
-        if (!threw) {
+        if (threw) {
             deferred.notify(newValue);
         }

[Survived] BlockStatement
q.js:909:21
             }
         }
 
-        if (!threw) {
-            deferred.notify(newValue);
-        }
+        if (!threw) {}
     }]);
 
