[Survived] BlockStatement
q.js:917:38
     return deferred.promise;
 };
 
-Q.tap = function (promise, callback) {
-    return Q(promise).tap(callback);
-};
+Q.tap = function (promise, callback) {};
 
 /**

[Survived] BlockStatement
q.js:933:45
  *   .tap(console.log)
  *   .then(...);
  */
-Promise.prototype.tap = function (callback) {
-    callback = Q(callback);
-
-    return this.then(function (value) {
-        return callback.fcall(value).thenResolve(value);
-    });
-};
+Promise.prototype.tap = function (callback) {};
 
 /**

[Survived] BlockStatement
q.js:936:39
 Promise.prototype.tap = function (callback) {
     callback = Q(callback);
 
-    return this.then(function (value) {
-        return callback.fcall(value).thenResolve(value);
-    });
+    return this.then(function (value) {});
 };
 

[Survived] BlockStatement
q.js:958:55
  * @return promise for the return value from the invoked callback
  */
 Q.when = when;
-function when(value, fulfilled, rejected, progressed) {
-    return Q(value).then(fulfilled, rejected, progressed);
-}
+function when(value, fulfilled, rejected, progressed) {}
 
 Promise.prototype.thenResolve = function (value) {

[Survived] BlockStatement
q.js:962:50
     return Q(value).then(fulfilled, rejected, progressed);
 }
 
-Promise.prototype.thenResolve = function (value) {
-    return this.then(function () { return value; });
-};
+Promise.prototype.thenResolve = function (value) {};
 
 Q.thenResolve = function (promise, value) {

[Survived] BlockStatement
q.js:963:34
 }
 
 Promise.prototype.thenResolve = function (value) {
-    return this.then(function () { return value; });
+    return this.then(function () {});
 };
 

[Survived] BlockStatement
q.js:966:43
     return this.then(function () { return value; });
 };
 
-Q.thenResolve = function (promise, value) {
-    return Q(promise).thenResolve(value);
-};
+Q.thenResolve = function (promise, value) {};
 
 Promise.prototype.thenReject = function (reason) {

[Survived] BlockStatement
q.js:970:50
     return Q(promise).thenResolve(value);
 };
 
-Promise.prototype.thenReject = function (reason) {
-    return this.then(function () { throw reason; });
-};
+Promise.prototype.thenReject = function (reason) {};
 
 Q.thenReject = function (promise, reason) {

[Survived] BlockStatement
q.js:971:34
 };
 
 Promise.prototype.thenReject = function (reason) {
-    return this.then(function () { throw reason; });
+    return this.then(function () {});
 };
 

[Survived] BlockStatement
q.js:974:43
     return this.then(function () { throw reason; });
 };
 
-Q.thenReject = function (promise, reason) {
-    return Q(promise).thenReject(reason);
-};
+Q.thenReject = function (promise, reason) {};
 
 /**

[Survived] BlockStatement
q.js:990:24
 
 // XXX should we re-do this?
 Q.nearer = nearer;
-function nearer(value) {
-    if (isPromise(value)) {
-        var inspected = value.inspect();
-        if (inspected.state === "fulfilled") {
-            return inspected.value;
-        }
-    }
-    return value;
-}
+function nearer(value) {}
 
 /**

[Survived] ConditionalExpression
q.js:991:9
 // XXX should we re-do this?
 Q.nearer = nearer;
 function nearer(value) {
-    if (isPromise(value)) {
+    if (false) {
         var inspected = value.inspect();
         if (inspected.state === "fulfilled") {

[Survived] ConditionalExpression
q.js:991:9
 // XXX should we re-do this?
 Q.nearer = nearer;
 function nearer(value) {
-    if (isPromise(value)) {
+    if (true) {
         var inspected = value.inspect();
         if (inspected.state === "fulfilled") {

[Survived] ConditionalExpression
q.js:993:13
 function nearer(value) {
     if (isPromise(value)) {
         var inspected = value.inspect();
-        if (inspected.state === "fulfilled") {
+        if (true) {
             return inspected.value;
         }

[Survived] EqualityOperator
q.js:993:13
 function nearer(value) {
     if (isPromise(value)) {
         var inspected = value.inspect();
-        if (inspected.state === "fulfilled") {
+        if (inspected.state !== "fulfilled") {
             return inspected.value;
         }

[Survived] BlockStatement
q.js:1005:28
  * Otherwise it is a fulfilled value.
  */
 Q.isPromise = isPromise;
-function isPromise(object) {
-    return object instanceof Promise;
-}
+function isPromise(object) {}
 
 Q.isPromiseAlike = isPromiseAlike;

[Killed] BlockStatement
q.js:1010:33
 }
 
 Q.isPromiseAlike = isPromiseAlike;
-function isPromiseAlike(object) {
-    return isObject(object) && typeof object.then === "function";
-}
+function isPromiseAlike(object) {}
 
 /**
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] ConditionalExpression
q.js:1011:12
 
 Q.isPromiseAlike = isPromiseAlike;
 function isPromiseAlike(object) {
-    return isObject(object) && typeof object.then === "function";
+    return false;
 }
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] EqualityOperator
q.js:1011:32
 
 Q.isPromiseAlike = isPromiseAlike;
 function isPromiseAlike(object) {
-    return isObject(object) && typeof object.then === "function";
+    return isObject(object) && typeof object.then !== "function";
 }
 

[Survived] BlockStatement
q.js:1019:28
  * fulfilled or rejected.
  */
 Q.isPending = isPending;
-function isPending(object) {
-    return isPromise(object) && object.inspect().state === "pending";
-}
+function isPending(object) {}
 
 Promise.prototype.isPending = function () {

[Survived] ConditionalExpression
q.js:1020:12
  */
 Q.isPending = isPending;
 function isPending(object) {
-    return isPromise(object) && object.inspect().state === "pending";
+    return true;
 }
 

[Survived] EqualityOperator
q.js:1020:33
  */
 Q.isPending = isPending;
 function isPending(object) {
-    return isPromise(object) && object.inspect().state === "pending";
+    return isPromise(object) && object.inspect().state !== "pending";
 }
 

[Survived] BlockStatement
q.js:1023:43
     return isPromise(object) && object.inspect().state === "pending";
 }
 
-Promise.prototype.isPending = function () {
-    return this.inspect().state === "pending";
-};
+Promise.prototype.isPending = function () {};
 
 /**

[Survived] ConditionalExpression
q.js:1024:12
 }
 
 Promise.prototype.isPending = function () {
-    return this.inspect().state === "pending";
+    return true;
 };
 

[Survived] EqualityOperator
q.js:1024:12
 }
 
 Promise.prototype.isPending = function () {
-    return this.inspect().state === "pending";
+    return this.inspect().state !== "pending";
 };
 

[Survived] BlockStatement
q.js:1032:30
  * promise.
  */
 Q.isFulfilled = isFulfilled;
-function isFulfilled(object) {
-    return !isPromise(object) || object.inspect().state === "fulfilled";
-}
+function isFulfilled(object) {}
 
 Promise.prototype.isFulfilled = function () {

[Survived] ConditionalExpression
q.js:1033:34
  */
 Q.isFulfilled = isFulfilled;
 function isFulfilled(object) {
-    return !isPromise(object) || object.inspect().state === "fulfilled";
+    return !isPromise(object) || false;
 }
 

[Survived] ConditionalExpression
q.js:1033:12
  */
 Q.isFulfilled = isFulfilled;
 function isFulfilled(object) {
-    return !isPromise(object) || object.inspect().state === "fulfilled";
+    return true;
 }
 

[Survived] BlockStatement
q.js:1036:45
     return !isPromise(object) || object.inspect().state === "fulfilled";
 }
 
-Promise.prototype.isFulfilled = function () {
-    return this.inspect().state === "fulfilled";
-};
+Promise.prototype.isFulfilled = function () {};
 
 /**

[Survived] ConditionalExpression
q.js:1037:12
 }
 
 Promise.prototype.isFulfilled = function () {
-    return this.inspect().state === "fulfilled";
+    return true;
 };
 

[Survived] EqualityOperator
q.js:1037:12
 }
 
 Promise.prototype.isFulfilled = function () {
-    return this.inspect().state === "fulfilled";
+    return this.inspect().state !== "fulfilled";
 };
 

[Survived] BlockStatement
q.js:1044:29
  * @returns whether the given object is a rejected promise.
  */
 Q.isRejected = isRejected;
-function isRejected(object) {
-    return isPromise(object) && object.inspect().state === "rejected";
-}
+function isRejected(object) {}
 
 Promise.prototype.isRejected = function () {

[Survived] LogicalOperator
q.js:1045:12
  */
 Q.isRejected = isRejected;
 function isRejected(object) {
-    return isPromise(object) && object.inspect().state === "rejected";
+    return isPromise(object) || object.inspect().state === "rejected";
 }
 

[Survived] ConditionalExpression
q.js:1045:12
  */
 Q.isRejected = isRejected;
 function isRejected(object) {
-    return isPromise(object) && object.inspect().state === "rejected";
+    return false;
 }
 

[Survived] BlockStatement
q.js:1048:44
     return isPromise(object) && object.inspect().state === "rejected";
 }
 
-Promise.prototype.isRejected = function () {
-    return this.inspect().state === "rejected";
-};
+Promise.prototype.isRejected = function () {};
 
 //// BEGIN UNHANDLED REJECTION TRACKING

[Survived] EqualityOperator
q.js:1049:12
 }
 
 Promise.prototype.isRejected = function () {
-    return this.inspect().state === "rejected";
+    return this.inspect().state !== "rejected";
 };
 

[Survived] ConditionalExpression
q.js:1049:12
 }
 
 Promise.prototype.isRejected = function () {
-    return this.inspect().state === "rejected";
+    return true;
 };
 

[Survived] ArrayDeclaration
q.js:1059:27
 // they are created, and removed when they are handled.  Note that in ES6 or
 // shimmed environments, this would naturally be a `Set`.
 var unhandledReasons = [];
-var unhandledRejections = [];
+var unhandledRejections = ["Stryker was here"];
 var reportedUnhandledRejections = [];
 var trackUnhandledRejections = true;

[Survived] BooleanLiteral
q.js:1061:32
 var unhandledReasons = [];
 var unhandledRejections = [];
 var reportedUnhandledRejections = [];
-var trackUnhandledRejections = true;
+var trackUnhandledRejections = false;
 
 function resetUnhandledRejections() {

[Survived] BlockStatement
q.js:1063:37
 var reportedUnhandledRejections = [];
 var trackUnhandledRejections = true;
 
-function resetUnhandledRejections() {
-    unhandledReasons.length = 0;
-    unhandledRejections.length = 0;
-
-    if (!trackUnhandledRejections) {
-        trackUnhandledRejections = true;
-    }
-}
+function resetUnhandledRejections() {}
 
 function trackRejection(promise, reason) {

[Survived] ConditionalExpression
q.js:1067:9
     unhandledReasons.length = 0;
     unhandledRejections.length = 0;
 
-    if (!trackUnhandledRejections) {
+    if (false) {
         trackUnhandledRejections = true;
     }

[Survived] ConditionalExpression
q.js:1067:9
     unhandledReasons.length = 0;
     unhandledRejections.length = 0;
 
-    if (!trackUnhandledRejections) {
+    if (true) {
         trackUnhandledRejections = true;
     }

[Survived] BooleanLiteral
q.js:1068:36
     unhandledRejections.length = 0;
 
     if (!trackUnhandledRejections) {
-        trackUnhandledRejections = true;
+        trackUnhandledRejections = false;
     }
 }

[Survived] BlockStatement
q.js:1072:42
     }
 }
 
-function trackRejection(promise, reason) {
-    if (!trackUnhandledRejections) {
-        return;
-    }
-    if (typeof process === "object" && typeof process.emit === "function") {
-        Q.nextTick.runAfter(function () {
-            if (array_indexOf(unhandledRejections, promise) !== -1) {
-                process.emit("unhandledRejection", reason, promise);
-                reportedUnhandledRejections.push(promise);
-            }
-        });
-    }
-
-    unhandledRejections.push(promise);
-    if (reason && typeof reason.stack !== "undefined") {
-        unhandledReasons.push(reason.stack);
-    } else {
-        unhandledReasons.push("(no stack) " + reason);
-    }
-}
+function trackRejection(promise, reason) {}
 
 function untrackRejection(promise) {

[Survived] ConditionalExpression
q.js:1073:9
 }
 
 function trackRejection(promise, reason) {
-    if (!trackUnhandledRejections) {
+    if (true) {
         return;
     }

[Survived] BlockStatement
q.js:1073:36
 }
 
 function trackRejection(promise, reason) {
-    if (!trackUnhandledRejections) {
-        return;
-    }
+    if (!trackUnhandledRejections) {}
     if (typeof process === "object" && typeof process.emit === "function") {
         Q.nextTick.runAfter(function () {

[Survived] ConditionalExpression
q.js:1076:40
     if (!trackUnhandledRejections) {
         return;
     }
-    if (typeof process === "object" && typeof process.emit === "function") {
+    if (typeof process === "object" && true) {
         Q.nextTick.runAfter(function () {
             if (array_indexOf(unhandledRejections, promise) !== -1) {

[Survived] ConditionalExpression
q.js:1076:9
     if (!trackUnhandledRejections) {
         return;
     }
-    if (typeof process === "object" && typeof process.emit === "function") {
+    if (false) {
         Q.nextTick.runAfter(function () {
             if (array_indexOf(unhandledRejections, promise) !== -1) {

[Survived] BlockStatement
q.js:1077:41
         return;
     }
     if (typeof process === "object" && typeof process.emit === "function") {
-        Q.nextTick.runAfter(function () {
-            if (array_indexOf(unhandledRejections, promise) !== -1) {
-                process.emit("unhandledRejection", reason, promise);
-                reportedUnhandledRejections.push(promise);
-            }
-        });
+        Q.nextTick.runAfter(function () {});
     }
 

[Survived] ConditionalExpression
q.js:1078:17
     }
     if (typeof process === "object" && typeof process.emit === "function") {
         Q.nextTick.runAfter(function () {
-            if (array_indexOf(unhandledRejections, promise) !== -1) {
+            if (true) {
                 process.emit("unhandledRejection", reason, promise);
                 reportedUnhandledRejections.push(promise);

[Survived] ConditionalExpression
q.js:1078:17
     }
     if (typeof process === "object" && typeof process.emit === "function") {
         Q.nextTick.runAfter(function () {
-            if (array_indexOf(unhandledRejections, promise) !== -1) {
+            if (false) {
                 process.emit("unhandledRejection", reason, promise);
                 reportedUnhandledRejections.push(promise);

[Killed] ConditionalExpression
q.js:1086:9
     }
 
     unhandledRejections.push(promise);
-    if (reason && typeof reason.stack !== "undefined") {
+    if (true) {
         unhandledReasons.push(reason.stack);
     } else {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] LogicalOperator
q.js:1086:9
     }
 
     unhandledRejections.push(promise);
-    if (reason && typeof reason.stack !== "undefined") {
+    if (reason || typeof reason.stack !== "undefined") {
         unhandledReasons.push(reason.stack);
     } else {
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:1088:12
     unhandledRejections.push(promise);
     if (reason && typeof reason.stack !== "undefined") {
         unhandledReasons.push(reason.stack);
-    } else {
-        unhandledReasons.push("(no stack) " + reason);
-    }
+    } else {}
 }
 

[Survived] BlockStatement
q.js:1093:36
     }
 }
 
-function untrackRejection(promise) {
-    if (!trackUnhandledRejections) {
-        return;
-    }
-
-    var at = array_indexOf(unhandledRejections, promise);
-    if (at !== -1) {
-        if (typeof process === "object" && typeof process.emit === "function") {
-            Q.nextTick.runAfter(function () {
-                var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                if (atReport !== -1) {
-                    process.emit("rejectionHandled", unhandledReasons[at], promise);
-                    reportedUnhandledRejections.splice(atReport, 1);
-                }
-            });
-        }
-        unhandledRejections.splice(at, 1);
-        unhandledReasons.splice(at, 1);
-    }
-}
+function untrackRejection(promise) {}
 
 Q.resetUnhandledRejections = resetUnhandledRejections;

[Survived] ConditionalExpression
q.js:1094:9
 }
 
 function untrackRejection(promise) {
-    if (!trackUnhandledRejections) {
+    if (false) {
         return;
     }

[Survived] ConditionalExpression
q.js:1094:9
 }
 
 function untrackRejection(promise) {
-    if (!trackUnhandledRejections) {
+    if (true) {
         return;
     }

[Survived] ConditionalExpression
q.js:1099:9
     }
 
     var at = array_indexOf(unhandledRejections, promise);
-    if (at !== -1) {
+    if (false) {
         if (typeof process === "object" && typeof process.emit === "function") {
             Q.nextTick.runAfter(function () {

[Survived] UnaryOperator
q.js:1099:16
     }
 
     var at = array_indexOf(unhandledRejections, promise);
-    if (at !== -1) {
+    if (at !== +1) {
         if (typeof process === "object" && typeof process.emit === "function") {
             Q.nextTick.runAfter(function () {

[Survived] LogicalOperator
q.js:1100:13
 
     var at = array_indexOf(unhandledRejections, promise);
     if (at !== -1) {
-        if (typeof process === "object" && typeof process.emit === "function") {
+        if (typeof process === "object" || typeof process.emit === "function") {
             Q.nextTick.runAfter(function () {
                 var atReport = array_indexOf(reportedUnhandledRejections, promise);

[Survived] ConditionalExpression
q.js:1100:13
 
     var at = array_indexOf(unhandledRejections, promise);
     if (at !== -1) {
-        if (typeof process === "object" && typeof process.emit === "function") {
+        if (false) {
             Q.nextTick.runAfter(function () {
                 var atReport = array_indexOf(reportedUnhandledRejections, promise);

[Survived] BlockStatement
q.js:1101:45
     var at = array_indexOf(unhandledRejections, promise);
     if (at !== -1) {
         if (typeof process === "object" && typeof process.emit === "function") {
-            Q.nextTick.runAfter(function () {
-                var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                if (atReport !== -1) {
-                    process.emit("rejectionHandled", unhandledReasons[at], promise);
-                    reportedUnhandledRejections.splice(atReport, 1);
-                }
-            });
+            Q.nextTick.runAfter(function () {});
         }
         unhandledRejections.splice(at, 1);

[Survived] BlockStatement
q.js:1103:38
         if (typeof process === "object" && typeof process.emit === "function") {
             Q.nextTick.runAfter(function () {
                 var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                if (atReport !== -1) {
-                    process.emit("rejectionHandled", unhandledReasons[at], promise);
-                    reportedUnhandledRejections.splice(atReport, 1);
-                }
+                if (atReport !== -1) {}
             });
         }

[Survived] UnaryOperator
q.js:1103:34
         if (typeof process === "object" && typeof process.emit === "function") {
             Q.nextTick.runAfter(function () {
                 var atReport = array_indexOf(reportedUnhandledRejections, promise);
-                if (atReport !== -1) {
+                if (atReport !== +1) {
                     process.emit("rejectionHandled", unhandledReasons[at], promise);
                     reportedUnhandledRejections.splice(atReport, 1);

[Survived] BlockStatement
q.js:1116:37
 
 Q.resetUnhandledRejections = resetUnhandledRejections;
 
-Q.getUnhandledReasons = function () {
-    // Make a copy so that consumers can't interfere with our internal state.
-    return unhandledReasons.slice();
-};
+Q.getUnhandledReasons = function () {};
 
 Q.stopUnhandledRejectionTracking = function () {

[Survived] MethodExpression
q.js:1118:12
 
 Q.getUnhandledReasons = function () {
     // Make a copy so that consumers can't interfere with our internal state.
-    return unhandledReasons.slice();
+    return unhandledReasons;
 };
 

[Survived] BlockStatement
q.js:1121:48
     return unhandledReasons.slice();
 };
 
-Q.stopUnhandledRejectionTracking = function () {
-    resetUnhandledRejections();
-    trackUnhandledRejections = false;
-};
+Q.stopUnhandledRejectionTracking = function () {};
 
 resetUnhandledRejections();

[Survived] BooleanLiteral
q.js:1123:32
 
 Q.stopUnhandledRejectionTracking = function () {
     resetUnhandledRejections();
-    trackUnhandledRejections = false;
+    trackUnhandledRejections = true;
 };
 

[Killed] BlockStatement
q.js:1135:25
  * @param reason value describing the failure
  */
 Q.reject = reject;
-function reject(reason) {
-    var rejection = Promise({
-        "when": function (rejected) {
-            // note that the error has been handled
-            if (rejected) {
-                untrackRejection(this);
-            }
-            return rejected ? rejected(reason) : this;
-        }
-    }, function fallback() {
-        return this;
-    }, function inspect() {
-        return { state: "rejected", reason: reason };
-    });
-
-    // Note that the reason has not been handled.
-    trackRejection(rejection, reason);
-
-    return rejection;
-}
+function reject(reason) {}
 
 /**
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Timeout] BlockStatement
q.js:1137:37
 Q.reject = reject;
 function reject(reason) {
     var rejection = Promise({
-        "when": function (rejected) {
-            // note that the error has been handled
-            if (rejected) {
-                untrackRejection(this);
-            }
-            return rejected ? rejected(reason) : this;
-        }
+        "when": function (rejected) {}
     }, function fallback() {
         return this;

[Survived] ConditionalExpression
q.js:1139:17
     var rejection = Promise({
         "when": function (rejected) {
             // note that the error has been handled
-            if (rejected) {
+            if (false) {
                 untrackRejection(this);
             }

[Survived] ConditionalExpression
q.js:1139:17
     var rejection = Promise({
         "when": function (rejected) {
             // note that the error has been handled
-            if (rejected) {
+            if (true) {
                 untrackRejection(this);
             }

[Survived] BlockStatement
q.js:1144:28
             }
             return rejected ? rejected(reason) : this;
         }
-    }, function fallback() {
-        return this;
-    }, function inspect() {
+    }, function fallback() {}, function inspect() {
         return { state: "rejected", reason: reason };
     });

[Killed] BlockStatement
q.js:1146:27
         }
     }, function fallback() {
         return this;
-    }, function inspect() {
-        return { state: "rejected", reason: reason };
-    });
+    }, function inspect() {});
 
     // Note that the reason has not been handled.
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] StringLiteral
q.js:1147:25
     }, function fallback() {
         return this;
     }, function inspect() {
-        return { state: "rejected", reason: reason };
+        return { state: "", reason: reason };
     });
 

[Timeout] BlockStatement
q.js:1163:29
 Q.fulfill = fulfill;
 function fulfill(value) {
     return Promise({
-        "when": function () {
-            return value;
-        },
+        "when": function () {},
         "get": function (name) {
             return value[name];

[Survived] BlockStatement
q.js:1166:32
         "when": function () {
             return value;
         },
-        "get": function (name) {
-            return value[name];
-        },
+        "get": function (name) {},
         "set": function (name, rhs) {
             value[name] = rhs;

[Survived] BlockStatement
q.js:1169:37
         "get": function (name) {
             return value[name];
         },
-        "set": function (name, rhs) {
-            value[name] = rhs;
-        },
+        "set": function (name, rhs) {},
         "delete": function (name) {
             delete value[name];

[Survived] BlockStatement
q.js:1172:35
         "set": function (name, rhs) {
             value[name] = rhs;
         },
-        "delete": function (name) {
-            delete value[name];
-        },
+        "delete": function (name) {},
         "post": function (name, args) {
             // Mark Miller proposes that post with no name should apply a

[Survived] BlockStatement
q.js:1175:39
         "delete": function (name) {
             delete value[name];
         },
-        "post": function (name, args) {
-            // Mark Miller proposes that post with no name should apply a
-            // promised function.
-            if (name === null || name === void 0) {
-                return value.apply(void 0, args);
-            } else {
-                return value[name].apply(value, args);
-            }
-        },
+        "post": function (name, args) {},
         "apply": function (thisp, args) {
             return value.apply(thisp, args);

[Survived] BlockStatement
q.js:1178:51
         "post": function (name, args) {
             // Mark Miller proposes that post with no name should apply a
             // promised function.
-            if (name === null || name === void 0) {
-                return value.apply(void 0, args);
-            } else {
+            if (name === null || name === void 0) {} else {
                 return value[name].apply(value, args);
             }

[Survived] ConditionalExpression
q.js:1178:17
         "post": function (name, args) {
             // Mark Miller proposes that post with no name should apply a
             // promised function.
-            if (name === null || name === void 0) {
+            if (true) {
                 return value.apply(void 0, args);
             } else {

[Survived] BlockStatement
q.js:1180:20
             // promised function.
             if (name === null || name === void 0) {
                 return value.apply(void 0, args);
-            } else {
-                return value[name].apply(value, args);
-            }
+            } else {}
         },
         "apply": function (thisp, args) {

[Survived] BlockStatement
q.js:1184:41
                 return value[name].apply(value, args);
             }
         },
-        "apply": function (thisp, args) {
-            return value.apply(thisp, args);
-        },
+        "apply": function (thisp, args) {},
         "keys": function () {
             return object_keys(value);

[Survived] BlockStatement
q.js:1187:29
         "apply": function (thisp, args) {
             return value.apply(thisp, args);
         },
-        "keys": function () {
-            return object_keys(value);
-        }
+        "keys": function () {}
     }, void 0, function inspect() {
         return { state: "fulfilled", value: value };

[Killed] BlockStatement
q.js:1190:35
         "keys": function () {
             return object_keys(value);
         }
-    }, void 0, function inspect() {
-        return { state: "fulfilled", value: value };
-    });
+    }, void 0, function inspect() {});
 }
 
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] StringLiteral
q.js:1191:25
             return object_keys(value);
         }
     }, void 0, function inspect() {
-        return { state: "fulfilled", value: value };
+        return { state: "", value: value };
     });
 }
