[Killed] BlockStatement
q.js:1200:26
  * @param promise thenable promise
  * @returns a Q promise
  */
-function coerce(promise) {
-    var deferred = defer();
-    Q.nextTick(function () {
-        try {
-            promise.then(deferred.resolve, deferred.reject, deferred.notify);
-        } catch (exception) {
-            deferred.reject(exception);
-        }
-    });
-    return deferred.promise;
-}
+function coerce(promise) {}
 
 /**
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] BlockStatement
q.js:1202:28
  */
 function coerce(promise) {
     var deferred = defer();
-    Q.nextTick(function () {
-        try {
-            promise.then(deferred.resolve, deferred.reject, deferred.notify);
-        } catch (exception) {
-            deferred.reject(exception);
-        }
-    });
+    Q.nextTick(function () {});
     return deferred.promise;
 }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Killed] BlockStatement
q.js:1203:13
 function coerce(promise) {
     var deferred = defer();
     Q.nextTick(function () {
-        try {
-            promise.then(deferred.resolve, deferred.reject, deferred.notify);
-        } catch (exception) {
+        try {} catch (exception) {
             deferred.reject(exception);
         }
killedBy: All tests
statusReason: > q@1.5.1 test
> npm ls -s && jasmine-node spec && promises-aplus-tests spec/aplus-adapter


q@1.5.1 /home/runner/work/llm-mutation-testing/llm-mutation-testing/q/.stryker-tmp/sandbox1216418
├── @ampproject/remapping@2.3.0 extraneous
├── @babel/code-frame@7.24.2 extraneous
├── @babel/compat-data@7.24.4 extraneous

[Survived] BlockStatement
q.js:1205:29
     Q.nextTick(function () {
         try {
             promise.then(deferred.resolve, deferred.reject, deferred.notify);
-        } catch (exception) {
-            deferred.reject(exception);
-        }
+        } catch (exception) {}
     });
     return deferred.promise;

[Survived] BlockStatement
q.js:1222:25
  * without a rejection.
  */
 Q.master = master;
-function master(object) {
-    return Promise({
-        "isDef": function () {}
-    }, function fallback(op, args) {
-        return dispatch(object, op, args);
-    }, function () {
-        return Q(object).inspect();
-    });
-}
+function master(object) {}
 
 /**

[Survived] ObjectLiteral
q.js:1223:20
  */
 Q.master = master;
 function master(object) {
-    return Promise({
-        "isDef": function () {}
-    }, function fallback(op, args) {
+    return Promise({}, function fallback(op, args) {
         return dispatch(object, op, args);
     }, function () {

[Survived] BlockStatement
q.js:1225:36
 function master(object) {
     return Promise({
         "isDef": function () {}
-    }, function fallback(op, args) {
-        return dispatch(object, op, args);
-    }, function () {
+    }, function fallback(op, args) {}, function () {
         return Q(object).inspect();
     });

[Survived] BlockStatement
q.js:1227:20
         "isDef": function () {}
     }, function fallback(op, args) {
         return dispatch(object, op, args);
-    }, function () {
-        return Q(object).inspect();
-    });
+    }, function () {});
 }
 

[Survived] BlockStatement
q.js:1243:45
  * either callback.
  */
 Q.spread = spread;
-function spread(value, fulfilled, rejected) {
-    return Q(value).spread(fulfilled, rejected);
-}
+function spread(value, fulfilled, rejected) {}
 
 Promise.prototype.spread = function (fulfilled, rejected) {

[Survived] BlockStatement
q.js:1247:59
     return Q(value).spread(fulfilled, rejected);
 }
 
-Promise.prototype.spread = function (fulfilled, rejected) {
-    return this.all().then(function (array) {
-        return fulfilled.apply(void 0, array);
-    }, rejected);
-};
+Promise.prototype.spread = function (fulfilled, rejected) {};
 
 /**

[Survived] BlockStatement
q.js:1248:45
 }
 
 Promise.prototype.spread = function (fulfilled, rejected) {
-    return this.all().then(function (array) {
-        return fulfilled.apply(void 0, array);
-    }, rejected);
+    return this.all().then(function (array) {}, rejected);
 };
 

[Survived] BlockStatement
q.js:1295:55
             // we also support Python-style generators.  At some point we can remove
             // this block.
 
-            if (typeof StopIteration === "undefined") {
-                // ES6 Generators
-                try {
-                    result = generator[verb](arg);
-                } catch (exception) {
-                    return reject(exception);
-                }
-                if (result.done) {
-                    return Q(result.value);
-                } else {
-                    return when(result.value, callback, errback);
-                }
-            } else {
+            if (typeof StopIteration === "undefined") {} else {
                 // SpiderMonkey Generators
                 // FIXME: Remove this case when SM does ES6 generators.

[Survived] ConditionalExpression
q.js:1295:17
             // we also support Python-style generators.  At some point we can remove
             // this block.
 
-            if (typeof StopIteration === "undefined") {
+            if (false) {
                 // ES6 Generators
                 try {

[Survived] BlockStatement
q.js:1297:21
 
             if (typeof StopIteration === "undefined") {
                 // ES6 Generators
-                try {
-                    result = generator[verb](arg);
-                } catch (exception) {
+                try {} catch (exception) {
                     return reject(exception);
                 }

[Survived] BlockStatement
q.js:1299:37
                 // ES6 Generators
                 try {
                     result = generator[verb](arg);
-                } catch (exception) {
-                    return reject(exception);
-                }
+                } catch (exception) {}
                 if (result.done) {
                     return Q(result.value);

[Survived] ConditionalExpression
q.js:1302:21
                 } catch (exception) {
                     return reject(exception);
                 }
-                if (result.done) {
+                if (false) {
                     return Q(result.value);
                 } else {

[Survived] ConditionalExpression
q.js:1302:21
                 } catch (exception) {
                     return reject(exception);
                 }
-                if (result.done) {
+                if (true) {
                     return Q(result.value);
                 } else {

[Survived] BlockStatement
q.js:1304:24
                 }
                 if (result.done) {
                     return Q(result.value);
-                } else {
-                    return when(result.value, callback, errback);
-                }
+                } else {}
             } else {
                 // SpiderMonkey Generators

[Survived] BlockStatement
q.js:1307:20
                 } else {
                     return when(result.value, callback, errback);
                 }
-            } else {
-                // SpiderMonkey Generators
-                // FIXME: Remove this case when SM does ES6 generators.
-                try {
-                    result = generator[verb](arg);
-                } catch (exception) {
-                    if (isStopIteration(exception)) {
-                        return Q(exception.value);
-                    } else {
-                        return reject(exception);
-                    }
-                }
-                return when(result, callback, errback);
-            }
+            } else {}
         }
         var generator = makeGenerator.apply(this, arguments);

[Survived] BlockStatement
q.js:1310:21
             } else {
                 // SpiderMonkey Generators
                 // FIXME: Remove this case when SM does ES6 generators.
-                try {
-                    result = generator[verb](arg);
-                } catch (exception) {
+                try {} catch (exception) {
                     if (isStopIteration(exception)) {
                         return Q(exception.value);

[Survived] BlockStatement
q.js:1312:37
                 // FIXME: Remove this case when SM does ES6 generators.
                 try {
                     result = generator[verb](arg);
-                } catch (exception) {
-                    if (isStopIteration(exception)) {
-                        return Q(exception.value);
-                    } else {
-                        return reject(exception);
-                    }
-                }
+                } catch (exception) {}
                 return when(result, callback, errback);
             }

[Survived] ConditionalExpression
q.js:1313:25
                 try {
                     result = generator[verb](arg);
                 } catch (exception) {
-                    if (isStopIteration(exception)) {
+                    if (false) {
                         return Q(exception.value);
                     } else {

[Survived] BlockStatement
q.js:1313:53
                 try {
                     result = generator[verb](arg);
                 } catch (exception) {
-                    if (isStopIteration(exception)) {
-                        return Q(exception.value);
-                    } else {
+                    if (isStopIteration(exception)) {} else {
                         return reject(exception);
                     }

[Survived] BlockStatement
q.js:1315:28
                 } catch (exception) {
                     if (isStopIteration(exception)) {
                         return Q(exception.value);
-                    } else {
-                        return reject(exception);
-                    }
+                    } else {}
                 }
                 return when(result, callback, errback);

[Survived] StringLiteral
q.js:1324:49
         }
         var generator = makeGenerator.apply(this, arguments);
         var callback = continuer.bind(continuer, "next");
-        var errback = continuer.bind(continuer, "throw");
+        var errback = continuer.bind(continuer, "");
         return callback();
     };

[Survived] BlockStatement
q.js:1337:31
  * generators at the top-level to work with libraries.
  */
 Q.spawn = spawn;
-function spawn(makeGenerator) {
-    Q.done(Q.async(makeGenerator)());
-}
+function spawn(makeGenerator) {}
 
 // FIXME: Remove this interface once ES6 generators are in SpiderMonkey.

[Survived] BlockStatement
q.js:1367:25
  * })
  */
 Q["return"] = _return;
-function _return(value) {
-    throw new QReturnValue(value);
-}
+function _return(value) {}
 
 /**

[Survived] BlockStatement
q.js:1387:29
  * @returns {function} a function that has been decorated.
  */
 Q.promised = promised;
-function promised(callback) {
-    return function () {
-        return spread([this, all(arguments)], function (self, args) {
-            return callback.apply(self, args);
-        });
-    };
-}
+function promised(callback) {}
 
 /**

[Survived] BlockStatement
q.js:1388:24
  */
 Q.promised = promised;
 function promised(callback) {
-    return function () {
-        return spread([this, all(arguments)], function (self, args) {
-            return callback.apply(self, args);
-        });
-    };
+    return function () {};
 }
 

[Survived] BlockStatement
q.js:1389:69
 Q.promised = promised;
 function promised(callback) {
     return function () {
-        return spread([this, all(arguments)], function (self, args) {
-            return callback.apply(self, args);
-        });
+        return spread([this, all(arguments)], function (self, args) {});
     };
 }

[Survived] BlockStatement
q.js:1403:37
  * @returns result {Promise} a promise for the result of the operation
  */
 Q.dispatch = dispatch;
-function dispatch(object, op, args) {
-    return Q(object).dispatch(op, args);
-}
+function dispatch(object, op, args) {}
 
 Promise.prototype.dispatch = function (op, args) {

[Survived] BlockStatement
q.js:1407:50
     return Q(object).dispatch(op, args);
 }
 
-Promise.prototype.dispatch = function (op, args) {
-    var self = this;
-    var deferred = defer();
-    Q.nextTick(function () {
-        self.promiseDispatch(deferred.resolve, op, args);
-    });
-    return deferred.promise;
-};
+Promise.prototype.dispatch = function (op, args) {};
 
 /**

[Survived] BlockStatement
q.js:1410:28
 Promise.prototype.dispatch = function (op, args) {
     var self = this;
     var deferred = defer();
-    Q.nextTick(function () {
-        self.promiseDispatch(deferred.resolve, op, args);
-    });
+    Q.nextTick(function () {});
     return deferred.promise;
 };

[Survived] BlockStatement
q.js:1422:32
  * @param name      name of property to get
  * @return promise for the property value
  */
-Q.get = function (object, key) {
-    return Q(object).dispatch("get", [key]);
-};
+Q.get = function (object, key) {};
 
 Promise.prototype.get = function (key) {

[Survived] StringLiteral
q.js:1423:31
  * @return promise for the property value
  */
 Q.get = function (object, key) {
-    return Q(object).dispatch("get", [key]);
+    return Q(object).dispatch("", [key]);
 };
 

[Survived] ArrayDeclaration
q.js:1423:38
  * @return promise for the property value
  */
 Q.get = function (object, key) {
-    return Q(object).dispatch("get", [key]);
+    return Q(object).dispatch("get", []);
 };
 

[Survived] BlockStatement
q.js:1426:40
     return Q(object).dispatch("get", [key]);
 };
 
-Promise.prototype.get = function (key) {
-    return this.dispatch("get", [key]);
-};
+Promise.prototype.get = function (key) {};
 
 /**

[Survived] StringLiteral
q.js:1427:26
 };
 
 Promise.prototype.get = function (key) {
-    return this.dispatch("get", [key]);
+    return this.dispatch("", [key]);
 };
 

[Survived] BlockStatement
q.js:1437:39
  * @param value     new value of property
  * @return promise for the return value
  */
-Q.set = function (object, key, value) {
-    return Q(object).dispatch("set", [key, value]);
-};
+Q.set = function (object, key, value) {};
 
 Promise.prototype.set = function (key, value) {

[Survived] BlockStatement
q.js:1441:47
     return Q(object).dispatch("set", [key, value]);
 };
 
-Promise.prototype.set = function (key, value) {
-    return this.dispatch("set", [key, value]);
-};
+Promise.prototype.set = function (key, value) {};
 
 /**

[Survived] BlockStatement
q.js:1452:38
  * @return promise for the return value
  */
 Q.del = // XXX legacy
-Q["delete"] = function (object, key) {
-    return Q(object).dispatch("delete", [key]);
-};
+Q["delete"] = function (object, key) {};
 
 Promise.prototype.del = // XXX legacy

[Survived] BlockStatement
q.js:1457:46
 };
 
 Promise.prototype.del = // XXX legacy
-Promise.prototype["delete"] = function (key) {
-    return this.dispatch("delete", [key]);
-};
+Promise.prototype["delete"] = function (key) {};
 
 /**

[Survived] BlockStatement
q.js:1475:40
  */
 // bound locally because it is used by other methods
 Q.mapply = // XXX As proposed by "Redsandro"
-Q.post = function (object, name, args) {
-    return Q(object).dispatch("post", [name, args]);
-};
+Q.post = function (object, name, args) {};
 
 Promise.prototype.mapply = // XXX As proposed by "Redsandro"

[Survived] ArrayDeclaration
q.js:1476:39
 // bound locally because it is used by other methods
 Q.mapply = // XXX As proposed by "Redsandro"
 Q.post = function (object, name, args) {
-    return Q(object).dispatch("post", [name, args]);
+    return Q(object).dispatch("post", []);
 };
 

[Survived] BlockStatement
q.js:1480:48
 };
 
 Promise.prototype.mapply = // XXX As proposed by "Redsandro"
-Promise.prototype.post = function (name, args) {
-    return this.dispatch("post", [name, args]);
-};
+Promise.prototype.post = function (name, args) {};
 
 /**

[Survived] StringLiteral
q.js:1481:26
 
 Promise.prototype.mapply = // XXX As proposed by "Redsandro"
 Promise.prototype.post = function (name, args) {
-    return this.dispatch("post", [name, args]);
+    return this.dispatch("", [name, args]);
 };
 

[Survived] BlockStatement
q.js:1493:48
  */
 Q.send = // XXX Mark Miller's proposed parlance
 Q.mcall = // XXX As proposed by "Redsandro"
-Q.invoke = function (object, name /*...args*/) {
-    return Q(object).dispatch("post", [name, array_slice(arguments, 2)]);
-};
+Q.invoke = function (object, name /*...args*/) {};
 
 Promise.prototype.send = // XXX Mark Miller's proposed parlance

[Survived] StringLiteral
q.js:1494:31
 Q.send = // XXX Mark Miller's proposed parlance
 Q.mcall = // XXX As proposed by "Redsandro"
 Q.invoke = function (object, name /*...args*/) {
-    return Q(object).dispatch("post", [name, array_slice(arguments, 2)]);
+    return Q(object).dispatch("", [name, array_slice(arguments, 2)]);
 };
 

[Survived] BlockStatement
q.js:1499:56
 
 Promise.prototype.send = // XXX Mark Miller's proposed parlance
 Promise.prototype.mcall = // XXX As proposed by "Redsandro"
-Promise.prototype.invoke = function (name /*...args*/) {
-    return this.dispatch("post", [name, array_slice(arguments, 1)]);
-};
+Promise.prototype.invoke = function (name /*...args*/) {};
 
 /**

[Survived] ArrayDeclaration
q.js:1500:34
 Promise.prototype.send = // XXX Mark Miller's proposed parlance
 Promise.prototype.mcall = // XXX As proposed by "Redsandro"
 Promise.prototype.invoke = function (name /*...args*/) {
-    return this.dispatch("post", [name, array_slice(arguments, 1)]);
+    return this.dispatch("post", []);
 };
 

[Survived] StringLiteral
q.js:1500:26
 Promise.prototype.send = // XXX Mark Miller's proposed parlance
 Promise.prototype.mcall = // XXX As proposed by "Redsandro"
 Promise.prototype.invoke = function (name /*...args*/) {
-    return this.dispatch("post", [name, array_slice(arguments, 1)]);
+    return this.dispatch("", [name, array_slice(arguments, 1)]);
 };
 

[Survived] BlockStatement
q.js:1508:36
  * @param object    promise or immediate reference for target function
  * @param args      array of application arguments
  */
-Q.fapply = function (object, args) {
-    return Q(object).dispatch("apply", [void 0, args]);
-};
+Q.fapply = function (object, args) {};
 
 Promise.prototype.fapply = function (args) {

[Survived] BlockStatement
q.js:1512:44
     return Q(object).dispatch("apply", [void 0, args]);
 };
 
-Promise.prototype.fapply = function (args) {
-    return this.dispatch("apply", [void 0, args]);
-};
+Promise.prototype.fapply = function (args) {};
 
 /**

[Survived] StringLiteral
q.js:1513:26
 };
 
 Promise.prototype.fapply = function (args) {
-    return this.dispatch("apply", [void 0, args]);
+    return this.dispatch("", [void 0, args]);
 };
 

[Survived] BlockStatement
q.js:1522:42
  * @param ...args   array of application arguments
  */
 Q["try"] =
-Q.fcall = function (object /* ...args*/) {
-    return Q(object).dispatch("apply", [void 0, array_slice(arguments, 1)]);
-};
+Q.fcall = function (object /* ...args*/) {};
 
 Promise.prototype.fcall = function (/*...args*/) {

[Survived] BlockStatement
q.js:1526:50
     return Q(object).dispatch("apply", [void 0, array_slice(arguments, 1)]);
 };
 
-Promise.prototype.fcall = function (/*...args*/) {
-    return this.dispatch("apply", [void 0, array_slice(arguments)]);
-};
+Promise.prototype.fcall = function (/*...args*/) {};
 
 /**

[Survived] BlockStatement
q.js:1536:41
  * @param object    promise or immediate reference for target function
  * @param ...args   array of application arguments
  */
-Q.fbind = function (object /*...args*/) {
-    var promise = Q(object);
-    var args = array_slice(arguments, 1);
-    return function fbound() {
-        return promise.dispatch("apply", [
-            this,
-            args.concat(array_slice(arguments))
-        ]);
-    };
-};
+Q.fbind = function (object /*...args*/) {};
 Promise.prototype.fbind = function (/*...args*/) {
     var promise = this;

[Survived] BlockStatement
q.js:1539:30
 Q.fbind = function (object /*...args*/) {
     var promise = Q(object);
     var args = array_slice(arguments, 1);
-    return function fbound() {
-        return promise.dispatch("apply", [
-            this,
-            args.concat(array_slice(arguments))
-        ]);
-    };
+    return function fbound() {};
 };
 Promise.prototype.fbind = function (/*...args*/) {

[Survived] StringLiteral
q.js:1540:33
     var promise = Q(object);
     var args = array_slice(arguments, 1);
     return function fbound() {
-        return promise.dispatch("apply", [
+        return promise.dispatch("", [
             this,
             args.concat(array_slice(arguments))

[Survived] BlockStatement
q.js:1546:50
         ]);
     };
 };
-Promise.prototype.fbind = function (/*...args*/) {
-    var promise = this;
-    var args = array_slice(arguments);
-    return function fbound() {
-        return promise.dispatch("apply", [
-            this,
-            args.concat(array_slice(arguments))
-        ]);
-    };
-};
+Promise.prototype.fbind = function (/*...args*/) {};
 
 /**

[Survived] BlockStatement
q.js:1549:30
 Promise.prototype.fbind = function (/*...args*/) {
     var promise = this;
     var args = array_slice(arguments);
-    return function fbound() {
-        return promise.dispatch("apply", [
-            this,
-            args.concat(array_slice(arguments))
-        ]);
-    };
+    return function fbound() {};
 };
 

[Survived] BlockStatement
q.js:1563:28
  * @param object    promise or immediate reference for target object
  * @return promise for the keys of the eventually settled object
  */
-Q.keys = function (object) {
-    return Q(object).dispatch("keys", []);
-};
+Q.keys = function (object) {};
 
 Promise.prototype.keys = function () {

[Survived] BlockStatement
q.js:1567:38
     return Q(object).dispatch("keys", []);
 };
 
-Promise.prototype.keys = function () {
-    return this.dispatch("keys", []);
-};
+Promise.prototype.keys = function () {};
 
 /**

[Survived] BlockStatement
q.js:1585:69
     return when(promises, function (promises) {
         var pendingCount = 0;
         var deferred = defer();
-        array_reduce(promises, function (undefined, promise, index) {
-            var snapshot;
-            if (
-                isPromise(promise) &&
-                (snapshot = promise.inspect()).state === "fulfilled"
-            ) {
-                promises[index] = snapshot.value;
-            } else {
-                ++pendingCount;
-                when(
-                    promise,
-                    function (value) {
-                        promises[index] = value;
-                        if (--pendingCount === 0) {
-                            deferred.resolve(promises);
-                        }
-                    },
-                    deferred.reject,
-                    function (progress) {
-                        deferred.notify({ index: index, value: progress });
-                    }
-                );
-            }
-        }, void 0);
+        array_reduce(promises, function (undefined, promise, index) {}, void 0);
         if (pendingCount === 0) {
             deferred.resolve(promises);

[Survived] ConditionalExpression
q.js:1588:17
         array_reduce(promises, function (undefined, promise, index) {
             var snapshot;
             if (
-                isPromise(promise) &&
-                (snapshot = promise.inspect()).state === "fulfilled"
+                false
             ) {
                 promises[index] = snapshot.value;

[Survived] ConditionalExpression
q.js:1588:17
         array_reduce(promises, function (undefined, promise, index) {
             var snapshot;
             if (
-                isPromise(promise) &&
-                (snapshot = promise.inspect()).state === "fulfilled"
+                true
             ) {
                 promises[index] = snapshot.value;

[Survived] ConditionalExpression
q.js:1589:17
             var snapshot;
             if (
                 isPromise(promise) &&
-                (snapshot = promise.inspect()).state === "fulfilled"
+                true
             ) {
                 promises[index] = snapshot.value;

[Survived] EqualityOperator
q.js:1589:17
             var snapshot;
             if (
                 isPromise(promise) &&
-                (snapshot = promise.inspect()).state === "fulfilled"
+                (snapshot = promise.inspect()).state !== "fulfilled"
             ) {
                 promises[index] = snapshot.value;

[Survived] BlockStatement
q.js:1590:15
             if (
                 isPromise(promise) &&
                 (snapshot = promise.inspect()).state === "fulfilled"
-            ) {
-                promises[index] = snapshot.value;
-            } else {
+            ) {} else {
                 ++pendingCount;
                 when(

[Survived] BlockStatement
q.js:1592:20
                 (snapshot = promise.inspect()).state === "fulfilled"
             ) {
                 promises[index] = snapshot.value;
-            } else {
-                ++pendingCount;
-                when(
-                    promise,
-                    function (value) {
-                        promises[index] = value;
-                        if (--pendingCount === 0) {
-                            deferred.resolve(promises);
-                        }
-                    },
-                    deferred.reject,
-                    function (progress) {
-                        deferred.notify({ index: index, value: progress });
-                    }
-                );
-            }
+            } else {}
         }, void 0);
         if (pendingCount === 0) {

[Survived] UpdateOperator
q.js:1593:17
             ) {
                 promises[index] = snapshot.value;
             } else {
-                ++pendingCount;
+                --pendingCount;
                 when(
                     promise,

[Survived] BlockStatement
q.js:1596:38
                 ++pendingCount;
                 when(
                     promise,
-                    function (value) {
-                        promises[index] = value;
-                        if (--pendingCount === 0) {
-                            deferred.resolve(promises);
-                        }
-                    },
+                    function (value) {},
                     deferred.reject,
                     function (progress) {

[Survived] BlockStatement
q.js:1598:51
                     promise,
                     function (value) {
                         promises[index] = value;
-                        if (--pendingCount === 0) {
-                            deferred.resolve(promises);
-                        }
+                        if (--pendingCount === 0) {}
                     },
                     deferred.reject,

[Survived] ConditionalExpression
q.js:1598:29
                     promise,
                     function (value) {
                         promises[index] = value;
-                        if (--pendingCount === 0) {
+                        if (false) {
                             deferred.resolve(promises);
                         }

[Survived] BlockStatement
q.js:1603:41
                         }
                     },
                     deferred.reject,
-                    function (progress) {
-                        deferred.notify({ index: index, value: progress });
-                    }
+                    function (progress) {}
                 );
             }

[Survived] ObjectLiteral
q.js:1604:41
                     },
                     deferred.reject,
                     function (progress) {
-                        deferred.notify({ index: index, value: progress });
+                        deferred.notify({});
                     }
                 );

[Survived] ConditionalExpression
q.js:1609:13
                 );
             }
         }, void 0);
-        if (pendingCount === 0) {
+        if (true) {
             deferred.resolve(promises);
         }

[Survived] EqualityOperator
q.js:1609:13
                 );
             }
         }, void 0);
-        if (pendingCount === 0) {
+        if (pendingCount !== 0) {
             deferred.resolve(promises);
         }

[Survived] BlockStatement
q.js:1616:37
     });
 }
 
-Promise.prototype.all = function () {
-    return all(this);
-};
+Promise.prototype.all = function () {};
 
 /**

[Survived] BlockStatement
q.js:1630:32
 Q.any = any;
 
 function any(promises) {
-    if (promises.length === 0) {
-        return Q.resolve();
-    }
+    if (promises.length === 0) {}
 
     var deferred = Q.defer();

[Survived] ConditionalExpression
q.js:1630:9
 Q.any = any;
 
 function any(promises) {
-    if (promises.length === 0) {
+    if (true) {
         return Q.resolve();
     }

[Survived] UpdateOperator
q.js:1639:9
     array_reduce(promises, function (prev, current, index) {
         var promise = promises[index];
 
-        pendingCount++;
+        pendingCount--;
 
         when(promise, onFulfilled, onRejected, onProgress);

[Survived] BlockStatement
q.js:1642:38
         pendingCount++;
 
         when(promise, onFulfilled, onRejected, onProgress);
-        function onFulfilled(result) {
-            deferred.resolve(result);
-        }
+        function onFulfilled(result) {}
         function onRejected(err) {
             pendingCount--;
