[Survived] BlockStatement
q.js:1645:34
         function onFulfilled(result) {
             deferred.resolve(result);
         }
-        function onRejected(err) {
-            pendingCount--;
-            if (pendingCount === 0) {
-                var rejection = err || new Error("" + err);
-
-                rejection.message = ("Q can't get fulfillment value from any promise, all " +
-                    "promises were rejected. Last error message: " + rejection.message);
-
-                deferred.reject(rejection);
-            }
-        }
+        function onRejected(err) {}
         function onProgress(progress) {
             deferred.notify({

[Survived] UpdateOperator
q.js:1646:13
             deferred.resolve(result);
         }
         function onRejected(err) {
-            pendingCount--;
+            pendingCount++;
             if (pendingCount === 0) {
                 var rejection = err || new Error("" + err);

[Survived] BlockStatement
q.js:1647:37
         }
         function onRejected(err) {
             pendingCount--;
-            if (pendingCount === 0) {
-                var rejection = err || new Error("" + err);
-
-                rejection.message = ("Q can't get fulfillment value from any promise, all " +
-                    "promises were rejected. Last error message: " + rejection.message);
-
-                deferred.reject(rejection);
-            }
+            if (pendingCount === 0) {}
         }
         function onProgress(progress) {

[Survived] ConditionalExpression
q.js:1647:17
         }
         function onRejected(err) {
             pendingCount--;
-            if (pendingCount === 0) {
+            if (true) {
                 var rejection = err || new Error("" + err);
 

[Survived] LogicalOperator
q.js:1648:33
         function onRejected(err) {
             pendingCount--;
             if (pendingCount === 0) {
-                var rejection = err || new Error("" + err);
+                var rejection = err && new Error("" + err);
 
                 rejection.message = ("Q can't get fulfillment value from any promise, all " +

[Survived] ConditionalExpression
q.js:1648:33
         function onRejected(err) {
             pendingCount--;
             if (pendingCount === 0) {
-                var rejection = err || new Error("" + err);
+                var rejection = false;
 
                 rejection.message = ("Q can't get fulfillment value from any promise, all " +

[Survived] BlockStatement
q.js:1656:39
                 deferred.reject(rejection);
             }
         }
-        function onProgress(progress) {
-            deferred.notify({
-                index: index,
-                value: progress
-            });
-        }
+        function onProgress(progress) {}
     }, undefined);
 

[Survived] BlockStatement
q.js:1667:37
     return deferred.promise;
 }
 
-Promise.prototype.any = function () {
-    return any(this);
-};
+Promise.prototype.any = function () {};
 
 /**

[Survived] BlockStatement
q.js:1681:32
  * @return a promise for an array of promises
  */
 Q.allResolved = deprecate(allResolved, "allResolved", "allSettled");
-function allResolved(promises) {
-    return when(promises, function (promises) {
-        promises = array_map(promises, Q);
-        return when(all(array_map(promises, function (promise) {
-            return when(promise, noop, noop);
-        })), function () {
-            return promises;
-        });
-    });
-}
+function allResolved(promises) {}
 
 Promise.prototype.allResolved = function () {

[Survived] BlockStatement
q.js:1682:47
  */
 Q.allResolved = deprecate(allResolved, "allResolved", "allSettled");
 function allResolved(promises) {
-    return when(promises, function (promises) {
-        promises = array_map(promises, Q);
-        return when(all(array_map(promises, function (promise) {
-            return when(promise, noop, noop);
-        })), function () {
-            return promises;
-        });
-    });
+    return when(promises, function (promises) {});
 }
 

[Survived] BlockStatement
q.js:1684:64
 function allResolved(promises) {
     return when(promises, function (promises) {
         promises = array_map(promises, Q);
-        return when(all(array_map(promises, function (promise) {
-            return when(promise, noop, noop);
-        })), function () {
+        return when(all(array_map(promises, function (promise) {})), function () {
             return promises;
         });

[Survived] BlockStatement
q.js:1686:26
         promises = array_map(promises, Q);
         return when(all(array_map(promises, function (promise) {
             return when(promise, noop, noop);
-        })), function () {
-            return promises;
-        });
+        })), function () {});
     });
 }

[Survived] BlockStatement
q.js:1692:45
     });
 }
 
-Promise.prototype.allResolved = function () {
-    return allResolved(this);
-};
+Promise.prototype.allResolved = function () {};
 
 /**

[Survived] BlockStatement
q.js:1700:31
  * @see Promise#allSettled
  */
 Q.allSettled = allSettled;
-function allSettled(promises) {
-    return Q(promises).allSettled();
-}
+function allSettled(promises) {}
 
 /**

[Survived] BlockStatement
q.js:1711:44
  * promises for values)
  * @returns {Array[State]} an array of states for the respective values.
  */
-Promise.prototype.allSettled = function () {
-    return this.then(function (promises) {
-        return all(array_map(promises, function (promise) {
-            promise = Q(promise);
-            function regardless() {
-                return promise.inspect();
-            }
-            return promise.then(regardless, regardless);
-        }));
-    });
-};
+Promise.prototype.allSettled = function () {};
 
 /**

[Survived] BlockStatement
q.js:1712:42
  * @returns {Array[State]} an array of states for the respective values.
  */
 Promise.prototype.allSettled = function () {
-    return this.then(function (promises) {
-        return all(array_map(promises, function (promise) {
-            promise = Q(promise);
-            function regardless() {
-                return promise.inspect();
-            }
-            return promise.then(regardless, regardless);
-        }));
-    });
+    return this.then(function (promises) {});
 };
 

[Survived] BlockStatement
q.js:1713:59
  */
 Promise.prototype.allSettled = function () {
     return this.then(function (promises) {
-        return all(array_map(promises, function (promise) {
-            promise = Q(promise);
-            function regardless() {
-                return promise.inspect();
-            }
-            return promise.then(regardless, regardless);
-        }));
+        return all(array_map(promises, function (promise) {}));
     });
 };

[Survived] BlockStatement
q.js:1715:35
     return this.then(function (promises) {
         return all(array_map(promises, function (promise) {
             promise = Q(promise);
-            function regardless() {
-                return promise.inspect();
-            }
+            function regardless() {}
             return promise.then(regardless, regardless);
         }));

[Survived] BlockStatement
q.js:1733:42
  * @returns a promise for the return value of the callback
  */
 Q.fail = // XXX legacy
-Q["catch"] = function (object, rejected) {
-    return Q(object).then(void 0, rejected);
-};
+Q["catch"] = function (object, rejected) {};
 
 Promise.prototype.fail = // XXX legacy

[Survived] BlockStatement
q.js:1738:50
 };
 
 Promise.prototype.fail = // XXX legacy
-Promise.prototype["catch"] = function (rejected) {
-    return this.then(void 0, rejected);
-};
+Promise.prototype["catch"] = function (rejected) {};
 
 /**

[Survived] StringLiteral
q.js:1738:19
 };
 
 Promise.prototype.fail = // XXX legacy
-Promise.prototype["catch"] = function (rejected) {
+Promise.prototype[""] = function (rejected) {
     return this.then(void 0, rejected);
 };

[Survived] BlockStatement
q.js:1751:39
  * @returns the given promise, unchanged
  */
 Q.progress = progress;
-function progress(object, progressed) {
-    return Q(object).then(void 0, void 0, progressed);
-}
+function progress(object, progressed) {}
 
 Promise.prototype.progress = function (progressed) {

[Survived] BlockStatement
q.js:1755:52
     return Q(object).then(void 0, void 0, progressed);
 }
 
-Promise.prototype.progress = function (progressed) {
-    return this.then(void 0, void 0, progressed);
-};
+Promise.prototype.progress = function (progressed) {};
 
 /**

[Survived] BlockStatement
q.js:1771:44
  * ``fin`` is done.
  */
 Q.fin = // XXX legacy
-Q["finally"] = function (object, callback) {
-    return Q(object)["finally"](callback);
-};
+Q["finally"] = function (object, callback) {};
 
 Promise.prototype.fin = // XXX legacy

[Survived] StringLiteral
q.js:1771:3
  * ``fin`` is done.
  */
 Q.fin = // XXX legacy
-Q["finally"] = function (object, callback) {
+Q[""] = function (object, callback) {
     return Q(object)["finally"](callback);
 };

[Survived] BlockStatement
q.js:1776:52
 };
 
 Promise.prototype.fin = // XXX legacy
-Promise.prototype["finally"] = function (callback) {
-    if (!callback || typeof callback.apply !== "function") {
-        throw new Error("Q can't apply finally callback");
-    }
-    callback = Q(callback);
-    return this.then(function (value) {
-        return callback.fcall().then(function () {
-            return value;
-        });
-    }, function (reason) {
-        // TODO attempt to recycle the rejection with "this".
-        return callback.fcall().then(function () {
-            throw reason;
-        });
-    });
-};
+Promise.prototype["finally"] = function (callback) {};
 
 /**

[Survived] StringLiteral
q.js:1776:19
 };
 
 Promise.prototype.fin = // XXX legacy
-Promise.prototype["finally"] = function (callback) {
+Promise.prototype[""] = function (callback) {
     if (!callback || typeof callback.apply !== "function") {
         throw new Error("Q can't apply finally callback");

[Survived] ConditionalExpression
q.js:1777:9
 
 Promise.prototype.fin = // XXX legacy
 Promise.prototype["finally"] = function (callback) {
-    if (!callback || typeof callback.apply !== "function") {
+    if (false) {
         throw new Error("Q can't apply finally callback");
     }

[Survived] ConditionalExpression
q.js:1777:9
 
 Promise.prototype.fin = // XXX legacy
 Promise.prototype["finally"] = function (callback) {
-    if (!callback || typeof callback.apply !== "function") {
+    if (true) {
         throw new Error("Q can't apply finally callback");
     }

[Survived] BlockStatement
q.js:1781:39
         throw new Error("Q can't apply finally callback");
     }
     callback = Q(callback);
-    return this.then(function (value) {
-        return callback.fcall().then(function () {
-            return value;
-        });
-    }, function (reason) {
+    return this.then(function (value) {}, function (reason) {
         // TODO attempt to recycle the rejection with "this".
         return callback.fcall().then(function () {

[Survived] BlockStatement
q.js:1782:50
     }
     callback = Q(callback);
     return this.then(function (value) {
-        return callback.fcall().then(function () {
-            return value;
-        });
+        return callback.fcall().then(function () {});
     }, function (reason) {
         // TODO attempt to recycle the rejection with "this".

[Survived] BlockStatement
q.js:1785:26
         return callback.fcall().then(function () {
             return value;
         });
-    }, function (reason) {
-        // TODO attempt to recycle the rejection with "this".
-        return callback.fcall().then(function () {
-            throw reason;
-        });
-    });
+    }, function (reason) {});
 };
 

[Survived] BlockStatement
q.js:1787:50
         });
     }, function (reason) {
         // TODO attempt to recycle the rejection with "this".
-        return callback.fcall().then(function () {
-            throw reason;
-        });
+        return callback.fcall().then(function () {});
     });
 };

[Survived] BlockStatement
q.js:1799:59
  * @param {Any*} promise at the end of a chain of promises
  * @returns nothing
  */
-Q.done = function (object, fulfilled, rejected, progress) {
-    return Q(object).done(fulfilled, rejected, progress);
-};
+Q.done = function (object, fulfilled, rejected, progress) {};
 
 Promise.prototype.done = function (fulfilled, rejected, progress) {

[Survived] BlockStatement
q.js:1803:67
     return Q(object).done(fulfilled, rejected, progress);
 };
 
-Promise.prototype.done = function (fulfilled, rejected, progress) {
-    var onUnhandledError = function (error) {
-        // forward to a future turn so that ``when``
-        // does not catch it and turn it into a rejection.
-        Q.nextTick(function () {
-            makeStackTraceLong(error, promise);
-            if (Q.onerror) {
-                Q.onerror(error);
-            } else {
-                throw error;
-            }
-        });
-    };
-
-    // Avoid unnecessary `nextTick`ing via an unnecessary `when`.
-    var promise = fulfilled || rejected || progress ?
-        this.then(fulfilled, rejected, progress) :
-        this;
-
-    if (typeof process === "object" && process && process.domain) {
-        onUnhandledError = process.domain.bind(onUnhandledError);
-    }
-
-    promise.then(void 0, onUnhandledError);
-};
+Promise.prototype.done = function (fulfilled, rejected, progress) {};
 
 /**

[Survived] BlockStatement
q.js:1804:45
 };
 
 Promise.prototype.done = function (fulfilled, rejected, progress) {
-    var onUnhandledError = function (error) {
-        // forward to a future turn so that ``when``
-        // does not catch it and turn it into a rejection.
-        Q.nextTick(function () {
-            makeStackTraceLong(error, promise);
-            if (Q.onerror) {
-                Q.onerror(error);
-            } else {
-                throw error;
-            }
-        });
-    };
+    var onUnhandledError = function (error) {};
 
     // Avoid unnecessary `nextTick`ing via an unnecessary `when`.

[Survived] BlockStatement
q.js:1807:32
     var onUnhandledError = function (error) {
         // forward to a future turn so that ``when``
         // does not catch it and turn it into a rejection.
-        Q.nextTick(function () {
-            makeStackTraceLong(error, promise);
-            if (Q.onerror) {
-                Q.onerror(error);
-            } else {
-                throw error;
-            }
-        });
+        Q.nextTick(function () {});
     };
 

[Survived] ConditionalExpression
q.js:1809:17
         // does not catch it and turn it into a rejection.
         Q.nextTick(function () {
             makeStackTraceLong(error, promise);
-            if (Q.onerror) {
+            if (false) {
                 Q.onerror(error);
             } else {

[Survived] BlockStatement
q.js:1809:28
         // does not catch it and turn it into a rejection.
         Q.nextTick(function () {
             makeStackTraceLong(error, promise);
-            if (Q.onerror) {
-                Q.onerror(error);
-            } else {
+            if (Q.onerror) {} else {
                 throw error;
             }

[Survived] BlockStatement
q.js:1811:20
             makeStackTraceLong(error, promise);
             if (Q.onerror) {
                 Q.onerror(error);
-            } else {
-                throw error;
-            }
+            } else {}
         });
     };

[Survived] ConditionalExpression
q.js:1818:19
     };
 
     // Avoid unnecessary `nextTick`ing via an unnecessary `when`.
-    var promise = fulfilled || rejected || progress ?
+    var promise = true ?
         this.then(fulfilled, rejected, progress) :
         this;

[Survived] LogicalOperator
q.js:1818:19
     };
 
     // Avoid unnecessary `nextTick`ing via an unnecessary `when`.
-    var promise = fulfilled || rejected || progress ?
+    var promise = (fulfilled || rejected) && progress ?
         this.then(fulfilled, rejected, progress) :
         this;

[Survived] BlockStatement
q.js:1822:67
         this.then(fulfilled, rejected, progress) :
         this;
 
-    if (typeof process === "object" && process && process.domain) {
-        onUnhandledError = process.domain.bind(onUnhandledError);
-    }
+    if (typeof process === "object" && process && process.domain) {}
 
     promise.then(void 0, onUnhandledError);

[Survived] ConditionalExpression
q.js:1822:9
         this.then(fulfilled, rejected, progress) :
         this;
 
-    if (typeof process === "object" && process && process.domain) {
+    if (true) {
         onUnhandledError = process.domain.bind(onUnhandledError);
     }

[Survived] BlockStatement
q.js:1838:42
  * @returns a promise for the resolution of the given promise if it is
  * fulfilled before the timeout, otherwise rejected.
  */
-Q.timeout = function (object, ms, error) {
-    return Q(object).timeout(ms, error);
-};
+Q.timeout = function (object, ms, error) {};
 
 Promise.prototype.timeout = function (ms, error) {

[Survived] BlockStatement
q.js:1842:50
     return Q(object).timeout(ms, error);
 };
 
-Promise.prototype.timeout = function (ms, error) {
-    var deferred = defer();
-    var timeoutId = setTimeout(function () {
-        if (!error || "string" === typeof error) {
-            error = new Error(error || "Timed out after " + ms + " ms");
-            error.code = "ETIMEDOUT";
-        }
-        deferred.reject(error);
-    }, ms);
-
-    this.then(function (value) {
-        clearTimeout(timeoutId);
-        deferred.resolve(value);
-    }, function (exception) {
-        clearTimeout(timeoutId);
-        deferred.reject(exception);
-    }, deferred.notify);
-
-    return deferred.promise;
-};
+Promise.prototype.timeout = function (ms, error) {};
 
 /**

[Survived] BlockStatement
q.js:1844:44
 
 Promise.prototype.timeout = function (ms, error) {
     var deferred = defer();
-    var timeoutId = setTimeout(function () {
-        if (!error || "string" === typeof error) {
-            error = new Error(error || "Timed out after " + ms + " ms");
-            error.code = "ETIMEDOUT";
-        }
-        deferred.reject(error);
-    }, ms);
+    var timeoutId = setTimeout(function () {}, ms);
 
     this.then(function (value) {

[Survived] LogicalOperator
q.js:1845:13
 Promise.prototype.timeout = function (ms, error) {
     var deferred = defer();
     var timeoutId = setTimeout(function () {
-        if (!error || "string" === typeof error) {
+        if (!error && "string" === typeof error) {
             error = new Error(error || "Timed out after " + ms + " ms");
             error.code = "ETIMEDOUT";

[Survived] ConditionalExpression
q.js:1845:23
 Promise.prototype.timeout = function (ms, error) {
     var deferred = defer();
     var timeoutId = setTimeout(function () {
-        if (!error || "string" === typeof error) {
+        if (!error || false) {
             error = new Error(error || "Timed out after " + ms + " ms");
             error.code = "ETIMEDOUT";

[Survived] ConditionalExpression
q.js:1846:31
     var deferred = defer();
     var timeoutId = setTimeout(function () {
         if (!error || "string" === typeof error) {
-            error = new Error(error || "Timed out after " + ms + " ms");
+            error = new Error(true);
             error.code = "ETIMEDOUT";
         }

[Survived] ConditionalExpression
q.js:1846:31
     var deferred = defer();
     var timeoutId = setTimeout(function () {
         if (!error || "string" === typeof error) {
-            error = new Error(error || "Timed out after " + ms + " ms");
+            error = new Error(false);
             error.code = "ETIMEDOUT";
         }

[Survived] StringLiteral
q.js:1847:26
     var timeoutId = setTimeout(function () {
         if (!error || "string" === typeof error) {
             error = new Error(error || "Timed out after " + ms + " ms");
-            error.code = "ETIMEDOUT";
+            error.code = "";
         }
         deferred.reject(error);

[Survived] BlockStatement
q.js:1852:32
         deferred.reject(error);
     }, ms);
 
-    this.then(function (value) {
-        clearTimeout(timeoutId);
-        deferred.resolve(value);
-    }, function (exception) {
+    this.then(function (value) {}, function (exception) {
         clearTimeout(timeoutId);
         deferred.reject(exception);

[Survived] BlockStatement
q.js:1855:29
     this.then(function (value) {
         clearTimeout(timeoutId);
         deferred.resolve(value);
-    }, function (exception) {
-        clearTimeout(timeoutId);
-        deferred.reject(exception);
-    }, deferred.notify);
+    }, function (exception) {}, deferred.notify);
 
     return deferred.promise;

[Survived] BlockStatement
q.js:1872:38
  * time has elapsed since the resolution of the given promise.
  * If the given promise rejects, that is passed immediately.
  */
-Q.delay = function (object, timeout) {
-    if (timeout === void 0) {
-        timeout = object;
-        object = void 0;
-    }
-    return Q(object).delay(timeout);
-};
+Q.delay = function (object, timeout) {};
 
 Promise.prototype.delay = function (timeout) {

[Survived] ConditionalExpression
q.js:1873:9
  * If the given promise rejects, that is passed immediately.
  */
 Q.delay = function (object, timeout) {
-    if (timeout === void 0) {
+    if (true) {
         timeout = object;
         object = void 0;

[Survived] EqualityOperator
q.js:1873:9
  * If the given promise rejects, that is passed immediately.
  */
 Q.delay = function (object, timeout) {
-    if (timeout === void 0) {
+    if (timeout !== void 0) {
         timeout = object;
         object = void 0;

[Survived] BlockStatement
q.js:1880:46
     return Q(object).delay(timeout);
 };
 
-Promise.prototype.delay = function (timeout) {
-    return this.then(function (value) {
-        var deferred = defer();
-        setTimeout(function () {
-            deferred.resolve(value);
-        }, timeout);
-        return deferred.promise;
-    });
-};
+Promise.prototype.delay = function (timeout) {};
 
 /**

[Survived] BlockStatement
q.js:1881:39
 };
 
 Promise.prototype.delay = function (timeout) {
-    return this.then(function (value) {
-        var deferred = defer();
-        setTimeout(function () {
-            deferred.resolve(value);
-        }, timeout);
-        return deferred.promise;
-    });
+    return this.then(function (value) {});
 };
 

[Survived] BlockStatement
q.js:1883:32
 Promise.prototype.delay = function (timeout) {
     return this.then(function (value) {
         var deferred = defer();
-        setTimeout(function () {
-            deferred.resolve(value);
-        }, timeout);
+        setTimeout(function () {}, timeout);
         return deferred.promise;
     });

[Survived] BlockStatement
q.js:1899:39
  *      })
  *
  */
-Q.nfapply = function (callback, args) {
-    return Q(callback).nfapply(args);
-};
+Q.nfapply = function (callback, args) {};
 
 Promise.prototype.nfapply = function (args) {

[Survived] BlockStatement
q.js:1903:45
     return Q(callback).nfapply(args);
 };
 
-Promise.prototype.nfapply = function (args) {
-    var deferred = defer();
-    var nodeArgs = array_slice(args);
-    nodeArgs.push(deferred.makeNodeResolver());
-    this.fapply(nodeArgs).fail(deferred.reject);
-    return deferred.promise;
-};
+Promise.prototype.nfapply = function (args) {};
 
 /**

[Survived] BlockStatement
q.js:1920:44
  * })
  *
  */
-Q.nfcall = function (callback /*...args*/) {
-    var args = array_slice(arguments, 1);
-    return Q(callback).nfapply(args);
-};
+Q.nfcall = function (callback /*...args*/) {};
 
 Promise.prototype.nfcall = function (/*...args*/) {

[Survived] BlockStatement
q.js:1925:51
     return Q(callback).nfapply(args);
 };
 
-Promise.prototype.nfcall = function (/*...args*/) {
-    var nodeArgs = array_slice(arguments);
-    var deferred = defer();
-    nodeArgs.push(deferred.makeNodeResolver());
-    this.fapply(nodeArgs).fail(deferred.reject);
-    return deferred.promise;
-};
+Promise.prototype.nfcall = function (/*...args*/) {};
 
 /**

[Survived] BlockStatement
q.js:1942:47
  * .done()
  */
 Q.nfbind =
-Q.denodeify = function (callback /*...args*/) {
-    if (callback === undefined) {
-        throw new Error("Q can't wrap an undefined function");
-    }
-    var baseArgs = array_slice(arguments, 1);
-    return function () {
-        var nodeArgs = baseArgs.concat(array_slice(arguments));
-        var deferred = defer();
-        nodeArgs.push(deferred.makeNodeResolver());
-        Q(callback).fapply(nodeArgs).fail(deferred.reject);
-        return deferred.promise;
-    };
-};
+Q.denodeify = function (callback /*...args*/) {};
 
 Promise.prototype.nfbind =

[Survived] BlockStatement
q.js:1943:33
  */
 Q.nfbind =
 Q.denodeify = function (callback /*...args*/) {
-    if (callback === undefined) {
-        throw new Error("Q can't wrap an undefined function");
-    }
+    if (callback === undefined) {}
     var baseArgs = array_slice(arguments, 1);
     return function () {

[Survived] ConditionalExpression
q.js:1943:9
  */
 Q.nfbind =
 Q.denodeify = function (callback /*...args*/) {
-    if (callback === undefined) {
+    if (true) {
         throw new Error("Q can't wrap an undefined function");
     }

[Survived] BlockStatement
q.js:1947:24
         throw new Error("Q can't wrap an undefined function");
     }
     var baseArgs = array_slice(arguments, 1);
-    return function () {
-        var nodeArgs = baseArgs.concat(array_slice(arguments));
-        var deferred = defer();
-        nodeArgs.push(deferred.makeNodeResolver());
-        Q(callback).fapply(nodeArgs).fail(deferred.reject);
-        return deferred.promise;
-    };
+    return function () {};
 };
 

[Survived] BlockStatement
q.js:1957:54
 };
 
 Promise.prototype.nfbind =
-Promise.prototype.denodeify = function (/*...args*/) {
-    var args = array_slice(arguments);
-    args.unshift(this);
-    return Q.denodeify.apply(void 0, args);
-};
+Promise.prototype.denodeify = function (/*...args*/) {};
 
 Q.nbind = function (callback, thisp /*...args*/) {

[Survived] BlockStatement
q.js:1963:50
     return Q.denodeify.apply(void 0, args);
 };
 
-Q.nbind = function (callback, thisp /*...args*/) {
-    var baseArgs = array_slice(arguments, 2);
-    return function () {
-        var nodeArgs = baseArgs.concat(array_slice(arguments));
-        var deferred = defer();
-        nodeArgs.push(deferred.makeNodeResolver());
-        function bound() {
-            return callback.apply(thisp, arguments);
-        }
-        Q(bound).fapply(nodeArgs).fail(deferred.reject);
-        return deferred.promise;
-    };
-};
+Q.nbind = function (callback, thisp /*...args*/) {};
 
 Promise.prototype.nbind = function (/*thisp, ...args*/) {

[Survived] BlockStatement
q.js:1965:24
 
 Q.nbind = function (callback, thisp /*...args*/) {
     var baseArgs = array_slice(arguments, 2);
-    return function () {
-        var nodeArgs = baseArgs.concat(array_slice(arguments));
-        var deferred = defer();
-        nodeArgs.push(deferred.makeNodeResolver());
-        function bound() {
-            return callback.apply(thisp, arguments);
-        }
-        Q(bound).fapply(nodeArgs).fail(deferred.reject);
-        return deferred.promise;
-    };
+    return function () {};
 };
 

[Survived] BlockStatement
q.js:1969:26
         var nodeArgs = baseArgs.concat(array_slice(arguments));
         var deferred = defer();
         nodeArgs.push(deferred.makeNodeResolver());
-        function bound() {
-            return callback.apply(thisp, arguments);
-        }
+        function bound() {}
         Q(bound).fapply(nodeArgs).fail(deferred.reject);
         return deferred.promise;

[Survived] BlockStatement
q.js:1977:57
     };
 };
 
-Promise.prototype.nbind = function (/*thisp, ...args*/) {
-    var args = array_slice(arguments, 0);
-    args.unshift(this);
-    return Q.nbind.apply(void 0, args);
-};
+Promise.prototype.nbind = function (/*thisp, ...args*/) {};
 
 /**

[Survived] BlockStatement
q.js:1993:41
  * @returns a promise for the value or error
  */
 Q.nmapply = // XXX As proposed by "Redsandro"
-Q.npost = function (object, name, args) {
-    return Q(object).npost(name, args);
-};
+Q.npost = function (object, name, args) {};
 
 Promise.prototype.nmapply = // XXX As proposed by "Redsandro"

[Survived] BlockStatement
q.js:1998:49
 };
 
 Promise.prototype.nmapply = // XXX As proposed by "Redsandro"
-Promise.prototype.npost = function (name, args) {
-    var nodeArgs = array_slice(args || []);
-    var deferred = defer();
-    nodeArgs.push(deferred.makeNodeResolver());
-    this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-    return deferred.promise;
-};
+Promise.prototype.npost = function (name, args) {};
 
 /**

[Survived] ConditionalExpression
q.js:1999:32
 
 Promise.prototype.nmapply = // XXX As proposed by "Redsandro"
 Promise.prototype.npost = function (name, args) {
-    var nodeArgs = array_slice(args || []);
+    var nodeArgs = array_slice(false);
     var deferred = defer();
     nodeArgs.push(deferred.makeNodeResolver());

[Survived] ConditionalExpression
q.js:1999:32
 
 Promise.prototype.nmapply = // XXX As proposed by "Redsandro"
 Promise.prototype.npost = function (name, args) {
-    var nodeArgs = array_slice(args || []);
+    var nodeArgs = array_slice(true);
     var deferred = defer();
     nodeArgs.push(deferred.makeNodeResolver());

[Survived] StringLiteral
q.js:2002:19
     var nodeArgs = array_slice(args || []);
     var deferred = defer();
     nodeArgs.push(deferred.makeNodeResolver());
-    this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
+    this.dispatch("", [name, nodeArgs]).fail(deferred.reject);
     return deferred.promise;
 };
