[Survived] BlockStatement
q.js:2018:49
  */
 Q.nsend = // XXX Based on Mark Miller's proposed "send"
 Q.nmcall = // XXX Based on "Redsandro's" proposal
-Q.ninvoke = function (object, name /*...args*/) {
-    var nodeArgs = array_slice(arguments, 2);
-    var deferred = defer();
-    nodeArgs.push(deferred.makeNodeResolver());
-    Q(object).dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-    return deferred.promise;
-};
+Q.ninvoke = function (object, name /*...args*/) {};
 
 Promise.prototype.nsend = // XXX Based on Mark Miller's proposed "send"

[Survived] BlockStatement
q.js:2028:57
 
 Promise.prototype.nsend = // XXX Based on Mark Miller's proposed "send"
 Promise.prototype.nmcall = // XXX Based on "Redsandro's" proposal
-Promise.prototype.ninvoke = function (name /*...args*/) {
-    var nodeArgs = array_slice(arguments, 1);
-    var deferred = defer();
-    nodeArgs.push(deferred.makeNodeResolver());
-    this.dispatch("post", [name, nodeArgs]).fail(deferred.reject);
-    return deferred.promise;
-};
+Promise.prototype.ninvoke = function (name /*...args*/) {};
 
 /**

[Survived] BlockStatement
q.js:2047:36
  * @returns either the promise or nothing
  */
 Q.nodeify = nodeify;
-function nodeify(object, nodeback) {
-    return Q(object).nodeify(nodeback);
-}
+function nodeify(object, nodeback) {}
 
 Promise.prototype.nodeify = function (nodeback) {

[Survived] BlockStatement
q.js:2051:49
     return Q(object).nodeify(nodeback);
 }
 
-Promise.prototype.nodeify = function (nodeback) {
-    if (nodeback) {
-        this.then(function (value) {
-            Q.nextTick(function () {
-                nodeback(null, value);
-            });
-        }, function (error) {
-            Q.nextTick(function () {
-                nodeback(error);
-            });
-        });
-    } else {
-        return this;
-    }
-};
+Promise.prototype.nodeify = function (nodeback) {};
 
 Q.noConflict = function() {

[Survived] BlockStatement
q.js:2052:19
 }
 
 Promise.prototype.nodeify = function (nodeback) {
-    if (nodeback) {
-        this.then(function (value) {
-            Q.nextTick(function () {
-                nodeback(null, value);
-            });
-        }, function (error) {
-            Q.nextTick(function () {
-                nodeback(error);
-            });
-        });
-    } else {
+    if (nodeback) {} else {
         return this;
     }

[Survived] ConditionalExpression
q.js:2052:9
 }
 
 Promise.prototype.nodeify = function (nodeback) {
-    if (nodeback) {
+    if (false) {
         this.then(function (value) {
             Q.nextTick(function () {

[Survived] BlockStatement
q.js:2053:36
 
 Promise.prototype.nodeify = function (nodeback) {
     if (nodeback) {
-        this.then(function (value) {
-            Q.nextTick(function () {
-                nodeback(null, value);
-            });
-        }, function (error) {
+        this.then(function (value) {}, function (error) {
             Q.nextTick(function () {
                 nodeback(error);

[Survived] BlockStatement
q.js:2054:36
 Promise.prototype.nodeify = function (nodeback) {
     if (nodeback) {
         this.then(function (value) {
-            Q.nextTick(function () {
-                nodeback(null, value);
-            });
+            Q.nextTick(function () {});
         }, function (error) {
             Q.nextTick(function () {

[Survived] BlockStatement
q.js:2057:29
             Q.nextTick(function () {
                 nodeback(null, value);
             });
-        }, function (error) {
-            Q.nextTick(function () {
-                nodeback(error);
-            });
-        });
+        }, function (error) {});
     } else {
         return this;

[Survived] BlockStatement
q.js:2058:36
                 nodeback(null, value);
             });
         }, function (error) {
-            Q.nextTick(function () {
-                nodeback(error);
-            });
+            Q.nextTick(function () {});
         });
     } else {

[Survived] BlockStatement
q.js:2062:12
                 nodeback(error);
             });
         });
-    } else {
-        return this;
-    }
+    } else {}
 };
 

[Survived] BlockStatement
q.js:2067:27
     }
 };
 
-Q.noConflict = function() {
-    throw new Error("Q.noConflict only works when Q is used as a global");
-};
+Q.noConflict = function() {};
 
 // All code before this point will be filtered from stack traces.
