[Survived] BlockStatement
queue.js:9:31
     var ends = Q.defer();
     var closed = Q.defer();
     return {
-        put: function (value) {
-            var next = Q.defer();
-            ends.resolve({
-                head: value,
-                tail: next.promise
-            });
-            ends.resolve = next.resolve;
-        },
+        put: function (value) {},
         get: function () {
             var result = ends.promise.get("head");

[Survived] ObjectLiteral
queue.js:11:26
     return {
         put: function (value) {
             var next = Q.defer();
-            ends.resolve({
-                head: value,
-                tail: next.promise
-            });
+            ends.resolve({});
             ends.resolve = next.resolve;
         },

[Survived] BlockStatement
queue.js:17:26
             });
             ends.resolve = next.resolve;
         },
-        get: function () {
-            var result = ends.promise.get("head");
-            ends.promise = ends.promise.get("tail");
-            return result.fail(function (error) {
-                closed.resolve(error);
-                throw error;
-            });
-        },
+        get: function () {},
         closed: closed.promise,
         close: function (error) {

[Survived] StringLiteral
queue.js:19:45
         },
         get: function () {
             var result = ends.promise.get("head");
-            ends.promise = ends.promise.get("tail");
+            ends.promise = ends.promise.get("");
             return result.fail(function (error) {
                 closed.resolve(error);

[Survived] BlockStatement
queue.js:20:49
         get: function () {
             var result = ends.promise.get("head");
             ends.promise = ends.promise.get("tail");
-            return result.fail(function (error) {
-                closed.resolve(error);
-                throw error;
-            });
+            return result.fail(function (error) {});
         },
         closed: closed.promise,

[Survived] BlockStatement
queue.js:26:33
             });
         },
         closed: closed.promise,
-        close: function (error) {
-            error = error || new Error("Can't get value from closed queue");
-            var end = {head: Q.reject(error)};
-            end.tail = end;
-            ends.resolve(end);
-            return closed.promise;
-        }
+        close: function (error) {}
     };
 }

[Survived] ConditionalExpression
queue.js:27:21
         },
         closed: closed.promise,
         close: function (error) {
-            error = error || new Error("Can't get value from closed queue");
+            error = true;
             var end = {head: Q.reject(error)};
             end.tail = end;

[Survived] ConditionalExpression
queue.js:27:21
         },
         closed: closed.promise,
         close: function (error) {
-            error = error || new Error("Can't get value from closed queue");
+            error = false;
             var end = {head: Q.reject(error)};
             end.tail = end;
