[Survived] StringLiteral
src/matcher.ts:11:61
-     constructor (spec: string, version: '1' | '1.0' | '1.1' = '1.1') {
+     constructor (spec: string, version: '1' | '1.0' | '1.1' = "") {

[Survived] StringLiteral
src/matcher.ts:13:23
-         throw new Error('Path contains invalid characters')
+         throw new Error("")

[Survived] StringLiteral
src/matcher.ts:16:23
-         throw new Error('Path must begin with a slash')
+         throw new Error("")

[Survived] StringLiteral
src/matcher.ts:19:23
-         throw new Error('Path contains empty segments')
+         throw new Error("")

[Survived] Regex
src/matcher.ts:22:9
-         ? /[*+][^/]|[^/][*+]/
+         ? /[^*+][^/]|[^/][*+]/

[Survived] Regex
src/matcher.ts:22:9
-         ? /[*+][^/]|[^/][*+]/
+         ? /[*+][/]|[^/][*+]/

[Survived] Regex
src/matcher.ts:22:9
-         ? /[*+][^/]|[^/][*+]/
+         ? /[*+][^/]|[/][*+]/

[Survived] Regex
src/matcher.ts:22:9
-         ? /[*+][^/]|[^/][*+]/
+         ? /[*+][^/]|[^/][^*+]/

[Survived] StringLiteral
src/matcher.ts:24:23
-         throw new Error('Path contains malformed wildcards')
+         throw new Error("")

[Survived] StringLiteral
src/matcher.ts:27:23
-         throw new Error('Path contains malformed captures')
+         throw new Error("")

[Survived] Regex
src/matcher.ts:29:20
-       if (spec.match(/^.+\/$/) !== null) {
+       if (spec.match(/.+\/$/) !== null) {

[Survived] StringLiteral
src/matcher.ts:30:23
-         throw new Error('Path must not end with a slash')
+         throw new Error("")

[Survived] ConditionalExpression
src/matcher.ts:39:9
-       if (string.length > 1 && string.endsWith('/')) {
+       if (false) {

[Survived] BlockStatement
src/matcher.ts:39:52
-       if (string.length > 1 && string.endsWith('/')) {
-         return null
-       }
+       if (string.length > 1 && string.endsWith('/')) {}

[Survived] StringLiteral
src/matcher.ts:48:60
-     static for (spec: string, version: '1' | '1.0' | '1.1' = '1.1'): Matcher {
+     static for (spec: string, version: '1' | '1.0' | '1.1' = ""): Matcher {

[Survived] ConditionalExpression
src/matcher.ts:67:18
-         } else if (min > 0) {
+         } else if (true) {

[Survived] Regex
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:./) !== null) {

[Survived] BooleanLiteral
src/policy.ts:59:52
-     clone (name: string = this.name, deep: boolean = true): Policy {
+     clone (name: string = this.name, deep: boolean = false): Policy {

[Survived] ConditionalExpression
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (false || match[index + 1] !== prop) {
