[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude < -90 || latitude > 90 || longitude < -180 || longitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -180 || latitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -360 || latitude > 360) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!isObject(point) || point.type !== 'Point') {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!isObject(point) || !point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject(point.coordinates)) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type !== 'Point') {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type === 'Point' && !Array.isArray(point.coordinates)) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:31
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.hasOwnProperty('coordinates') || !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates)) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!isObject(object) && object.type !== 'Point') {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!isObject(object) && object.type !== 'Point' && object.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:106:15
-       const b = cos(point1Rad) * cos(point2Rad) * cos(a);
+       const b = Math.cos(point1Rad) * cos(point2Rad) * cos(a);

[Survived] PrecomputedMutator
src/geo-point.ts:106:32
-       const b = cos(point1Rad) * cos(point2Rad) * cos(a);
+       const b = cos(point1Rad) * Math.cos(point2Rad) * cos(a);

[Survived] PrecomputedMutator
src/geo-point.ts:106:49
-       const b = cos(point1Rad) * cos(point2Rad) * cos(a);
+       const b = cos(point1Rad) * cos(point2Rad) * Math.cos(a);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(sinφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ * 2), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(sin(δ));

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + Math.atan2(y, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, x * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.latitude, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(point.latitude, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(point.latitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(Math.random(), point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.latitude + point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude + point.latitude, this.longitude + point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude * point.latitude, this.longitude * point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude + this.longitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude - this.longitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(Math.sqrt(Math.pow(this.latitude, 2) + Math.pow(this.longitude, 2)), point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, Math.PI);
