[Survived] PrecomputedMutator
sinks/drain.js:14:8
-       if(abort) return sink.abort()
+       if(abort = false) return sink.abort()

[Survived] PrecomputedMutator
sinks/drain.js:14:8
-       if(abort) return sink.abort()
+       if(abort = null) return sink.abort()

[Survived] PrecomputedMutator
sinks/drain.js:27:23
-                 else if(end && end !== true) {
+                 else if(end !== false) {

[Survived] PrecomputedMutator
sinks/drain.js:28:30
-                   console.warn(doneLackingErr)
+                   console.warn(doneLackingErr = new Error('no done callback supplied'))

[Survived] PrecomputedMutator
sinks/drain.js:28:30
-                   console.warn(doneLackingErr)
+                   console.warn(doneLackingErr = null)

[Survived] PrecomputedMutator
sinks/drain.js:28:30
-                   console.warn(doneLackingErr)
+                   console.warn(doneLackingErr = undefined)

[Survived] PrecomputedMutator
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(!abort || true, done || function () {})

[Survived] PrecomputedMutator
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(abort || false, done || function () {})

[Survived] PrecomputedMutator
sinks/drain.js:34:35
-                 read(abort || true, done || function () {})
+                 read(abort || true, done || function () {
+     throw new Error('done is not a function');
+   })

[Survived] PrecomputedMutator
sinks/drain.js:34:35
-                 read(abort || true, done || function () {})
+                 read(abort || true, done || function () {
+     console.log('done is not a function');
+   })

[Survived] PrecomputedMutator
sinks/drain.js:49:8
-       if('function' == typeof err)
+       if('function' === typeof err)

[Survived] PrecomputedMutator
sinks/drain.js:52:21
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb ? function () {} : function () {})

[Survived] PrecomputedMutator
sinks/drain.js:52:33
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function () {
+     return 'Test error';
+   })

[Survived] PrecomputedMutator
sinks/drain.js:52:33
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function () {
+     console.log('Test error');
+   })

[Survived] PrecomputedMutator
sinks/find.js:15:8
-       if(test(data)) {
+       if(test(data, 1)) {

[Survived] PrecomputedMutator
sinks/find.js:15:8
-       if(test(data)) {
+       if(test(data, function () {})) {

[Survived] PrecomputedMutator
sinks/find.js:22:8
-       cb(err === true ? null : err, null)
+       cb(err === null ? null : err, null)

[Survived] PrecomputedMutator
sinks/log.js:7:17
-       console.log(data)
+       console.log(data - 1)

[Survived] PrecomputedMutator
sinks/log.js:7:17
-       console.log(data)
+       console.log(data * 2)

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end === true ? null : data)

[Survived] PrecomputedMutator
sources/count.js:6:8
-       if(end) return cb && cb(end)
+       if(end = undefined) return cb && cb(end)

[Survived] PrecomputedMutator
sources/count.js:6:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end = true)

[Survived] PrecomputedMutator
sources/count.js:6:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end = false)

[Survived] PrecomputedMutator
sources/count.js:6:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end = undefined)

[Survived] PrecomputedMutator
sources/infinite.js:5:8
-       if(end) return cb && cb(end)
+       if(end = null) return cb && cb(end)

[Survived] PrecomputedMutator
sources/infinite.js:5:8
-       if(end) return cb && cb(end)
+       if(end = undefined) return cb && cb(end)

[Survived] PrecomputedMutator
sources/infinite.js:5:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end = true)

[Survived] PrecomputedMutator
sources/infinite.js:5:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end = Math.random())

[Survived] PrecomputedMutator
sources/infinite.js:6:21
-       return cb(null, generate())
+       return cb(null, generate(generate()))

[Survived] PrecomputedMutator
sources/once.js:7:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, !abort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:22
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(null, value), abort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:22
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(value), abort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:22
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(null, value + 1), abort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abortCb(cb, true, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abortCb(cb, null, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abortCb(cb, undefined, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:33
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort(null))

[Survived] PrecomputedMutator
sources/once.js:7:33
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort(undefined))

[Survived] PrecomputedMutator
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abortCb(cb, abort, onAbort)) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(cb(true)) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(cb(null, array[i++])) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort, true)

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort, false)

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb(null, array[i++]), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb(true), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(abortCb(cb, abort, onAbort), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abortCb(cb, true, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abortCb(cb, false, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abortCb(cb, undefined, onAbort), onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:43
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort.call(this))

[Survived] PrecomputedMutator
sources/values.js:7:43
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort.apply(this, []))

[Survived] PrecomputedMutator
sources/values.js:8:17
-         return cb(true)
+         return cb(undefined)

[Survived] PrecomputedMutator
sources/values.js:16:8
-       if(abort)
+       if(abort ? true : false)

[Survived] PrecomputedMutator
sources/values.js:17:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort, true)

[Survived] PrecomputedMutator
sources/values.js:17:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort, false)

[Survived] PrecomputedMutator
sources/values.js:18:8
-       if(i >= array.length)
+       if(i === array.length)

[Survived] PrecomputedMutator
throughs/async-map.js:12:10
-         if(aborted) return cb(aborted)
+         if(aborted = false) return cb(aborted)

[Survived] PrecomputedMutator
throughs/async-map.js:12:10
-         if(aborted) return cb(aborted)
+         if(aborted = undefined) return cb(aborted)

[Survived] PrecomputedMutator
throughs/async-map.js:12:29
-         if(aborted) return cb(aborted)
+         if(aborted) return cb(aborted = true)

[Survived] PrecomputedMutator
throughs/async-map.js:12:29
-         if(aborted) return cb(aborted)
+         if(aborted) return cb(aborted = false)

[Survived] PrecomputedMutator
throughs/async-map.js:12:29
-         if(aborted) return cb(aborted)
+         if(aborted) return cb(aborted = null)

[Survived] PrecomputedMutator
throughs/async-map.js:28:14
-             if(end) cb(end)
+             if(end == true) cb(end)

[Survived] PrecomputedMutator
throughs/async-map.js:29:31
-             else if(aborted) cb(aborted)
+             else if(aborted) cb(aborted = true)

[Survived] PrecomputedMutator
throughs/async-map.js:36:36
-                   abortCb && abortCb(aborted)
+                   abortCb && abortCb(aborted = true)

[Survived] PrecomputedMutator
throughs/async-map.js:38:28
-                 else if(err) next (err, cb)
+                 else if(err) next(err, cb, data)

[Survived] PrecomputedMutator
throughs/async-map.js:38:28
-                 else if(err) next (err, cb)
+                 else if(err) next(err, cb, data, data)

[Survived] PrecomputedMutator
throughs/filter-not.js:7:17
-     test = tester(test)
+     test = tester(tester(test))

[Survived] PrecomputedMutator
throughs/filter-not.js:7:17
-     test = tester(test)
+     test = tester(tester(test, true))

[Survived] PrecomputedMutator
throughs/filter-not.js:7:17
-     test = tester(test)
+     test = tester(tester(test, false))

[Survived] PrecomputedMutator
throughs/filter-not.js:8:48
-     return filter(function (data) { return !test(data) })
+     return filter(function (data) { return !test(data[0]) })

[Survived] PrecomputedMutator
throughs/filter.js:7:17
-     test = tester(test)
+     test = tester(tester(test))

[Survived] PrecomputedMutator
throughs/filter.js:16:41
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, function () {})

[Survived] PrecomputedMutator
throughs/filter.js:16:41
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(true, function () {})

[Survived] PrecomputedMutator
throughs/filter.js:16:46
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end = false, cb)

[Survived] PrecomputedMutator
throughs/filter.js:16:46
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end = null, cb)

[Survived] PrecomputedMutator
throughs/filter.js:17:11
-             cb(end, data)
+             cb(end, data, null)

[Survived] PrecomputedMutator
throughs/filter.js:17:11
-             cb(end, data)
+             cb(end, data, undefined)

[Survived] PrecomputedMutator
throughs/filter.js:17:11
-             cb(end, data)
+             cb(end, data, 0)

[Survived] PrecomputedMutator
throughs/flatten.js:11:11
-         if (abort) { //abort the current stream, and then stream of streams.
+         if (abort && true) { //abort the current stream, and then stream of streams.

[Survived] PrecomputedMutator
throughs/flatten.js:11:11
-         if (abort) { //abort the current stream, and then stream of streams.
+         if (abort ? true : false) { //abort the current stream, and then stream of streams.

[Survived] PrecomputedMutator
throughs/flatten.js:14:14
-           }) : read(abort, cb)
+           }) : read(abort, cb, null)

[Survived] PrecomputedMutator
throughs/flatten.js:14:14
-           }) : read(abort, cb)
+           }) : read(abort, cb, true)

[Survived] PrecomputedMutator
throughs/flatten.js:14:19
-           }) : read(abort, cb)
+           }) : read(abort || true, cb)

[Survived] PrecomputedMutator
throughs/flatten.js:14:19
-           }) : read(abort, cb)
+           }) : read(abort && true, cb)

[Survived] PrecomputedMutator
throughs/flatten.js:14:19
-           }) : read(abort, cb)
+           }) : read(abort ? true : false, cb)

[Survived] PrecomputedMutator
throughs/flatten.js:17:12
-         else nextStream()
+         else _read = nextStream()

[Survived] PrecomputedMutator
throughs/flatten.js:34:14
-             if(end)
+             if(end == true)

[Survived] PrecomputedMutator
throughs/flatten.js:37:29
-               stream = values(stream)
+               stream = values(stream.filter(x => x > 0))

[Survived] PrecomputedMutator
throughs/map.js:19:9
-           cb(end, data)
+           cb(end, data, null)

[Survived] PrecomputedMutator
throughs/take.js:8:6
-     if('number' === typeof test) {
+     if(typeof test === 'number') {

[Survived] PrecomputedMutator
throughs/take.js:19:26
-           last = false; cb(err || true)
+           last = false; cb(err || null)

[Survived] PrecomputedMutator
throughs/take.js:19:26
-           last = false; cb(err || true)
+           last = false; cb(err || undefined)

[Survived] PrecomputedMutator
throughs/take.js:24:51
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(ended && !end) last ? terminate(cb) : cb(ended = true)

[Survived] PrecomputedMutator
throughs/take.js:24:51
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(ended && !end) last ? terminate(cb) : cb(ended = false)

[Survived] PrecomputedMutator
throughs/take.js:24:51
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(ended && !end) last ? terminate(cb) : cb(ended = null)

[Survived] PrecomputedMutator
throughs/take.js:25:33
-         else if(ended = end) read(ended, cb)
+         else if(ended = end) read(ended = true, cb)

[Survived] PrecomputedMutator
throughs/take.js:30:16
-               cb(ended)
+               cb(ended = true)

[Survived] PrecomputedMutator
throughs/take.js:30:16
-               cb(ended)
+               cb(ended = null)

[Survived] PrecomputedMutator
throughs/through.js:10:11
-       onEnd(abort === true ? null : abort)
+       onEnd(abort === true ? null : true)

[Survived] PrecomputedMutator
throughs/through.js:10:11
-       onEnd(abort === true ? null : abort)
+       onEnd(abort === true ? null : false)

[Survived] PrecomputedMutator
throughs/through.js:17:27
-           if(!end) op && op(data)
+           if(!end) op && op(data.toString())

[Survived] PrecomputedMutator
throughs/through.js:17:27
-           if(!end) op && op(data)
+           if(!end) op && op(data.foo)

[Survived] PrecomputedMutator
util/prop.js:6:42
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data.key.value); return v && v[0] }

[Survived] PrecomputedMutator
util/prop.js:6:42
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data.key.value.toString()); return v && v[0] }

[Survived] PrecomputedMutator
util/tester.js:8:42
-       ? function (data) { return test.test(data) }
+       ? function (data) { return test.test(data.toString()) }

[Survived] PrecomputedMutator
pull.js:7:5
-       for(var i = 0; i < length; i++)
-         args[i] = arguments[i]
+       for (var i = "0"; i < length; i++) args[i] = arguments[i];

[Survived] PrecomputedMutator
pull.js:7:32
-       for(var i = 0; i < length; i++)
+       for(var i = 0; i < length; i = i + 1)

[Survived] PrecomputedMutator
pull.js:10:11
-         if (args == null) {
+         if (args === null) {

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[0] + 1)

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[0] - 1)

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[0] * 2)

[Survived] PrecomputedMutator
pull.js:22:22
-         case 2: return pull(read, ref[0], ref[1])
+         case 2: return pull(read, ref[0], ref[1], ref[2], ref[3], ref[4])

[Survived] PrecomputedMutator
pull.js:22:33
-         case 2: return pull(read, ref[0], ref[1])
+         case 2: return pull(read, ref[Math.floor(Math.random() * length)], ref[1])

[Survived] PrecomputedMutator
pull.js:23:22
-         case 3: return pull(read, ref[0], ref[1], ref[2])
+         case 3: return pull(read, ref[0], ref[1], ref[2], ref[4])

[Survived] PrecomputedMutator
pull.js:23:22
-         case 3: return pull(read, ref[0], ref[1], ref[2])
+         case 3: return pull(read, ref[0], ref[1], ref[2], ref[5])

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3], ref[4])

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3], ref[3])

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3], ref[4], ref[5])

[Survived] PrecomputedMutator
pull.js:24:33
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[Math.floor(Math.random() * length)], ref[1], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[3], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:26:21
-           ref.unshift(read)
+           ref.unshift(read.sink)

[Survived] PrecomputedMutator
pull.js:26:21
-           ref.unshift(read)
+           ref.unshift(read.source.sink)

[Survived] PrecomputedMutator
pull.js:27:16
-           return pull.apply(null, ref)
+           return pull.apply('', ref)

[Survived] PrecomputedMutator
pull.js:27:33
-           return pull.apply(null, ref)
+           return pull.apply(null, ref[1])

[Survived] PrecomputedMutator
pull.js:27:33
-           return pull.apply(null, ref)
+           return pull.apply(null, ref[2])

[Survived] PrecomputedMutator
pull.js:34:7
-     if (read && typeof read.source === 'function') {
+     if (read && typeof read.source === 'function' && read.source()) {

[Survived] PrecomputedMutator
pull.js:38:31
-     for (var i = 1; i < length; i++) {
+     for (var i = 1; i < length; i = i + 1) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === 'object' && s.length > 0) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === 'object' && s.length === 0) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === 'object' && s.length < 0) {

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(read.source)

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(read.sink)

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(read.source.sink)
