[Survived] PrecomputedMutator
crawler-url-parser.js:16:73
-   	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str);
+   	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str.toLowerCase());

[Survived] PrecomputedMutator
crawler-url-parser.js:16:73
-   	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str);
+   	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str.trim());

[Survived] PrecomputedMutator
crawler-url-parser.js:32:42
-   	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+   	if (currentUrlStr && _has_illegal_chars(currentUrlStr.toLowerCase())) return null;

[Survived] PrecomputedMutator
crawler-url-parser.js:32:42
-   	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+   	if (currentUrlStr && _has_illegal_chars(currentUrlStr.split('/')[0])) return null;

[Survived] PrecomputedMutator
crawler-url-parser.js:33:6
-   	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+   	if (baseUrlStr && _has_illegal_chars(baseUrlStr) && true) return null;

[Survived] PrecomputedMutator
crawler-url-parser.js:33:6
-   	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+   	if (baseUrlStr && _has_illegal_chars(baseUrlStr) && baseUrlStr.length > 0) return null;

[Survived] PrecomputedMutator
crawler-url-parser.js:33:39
-   	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+   	if (baseUrlStr && _has_illegal_chars(baseUrlStr.toLowerCase())) return null;

[Survived] PrecomputedMutator
crawler-url-parser.js:36:40
-   	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+   	currentUrlStr = currentUrlStr.replace(/^#.*/, '');

[Survived] PrecomputedMutator
crawler-url-parser.js:36:48
-   	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+   	currentUrlStr = currentUrlStr.replace(/#.*$/, ' ');

[Survived] PrecomputedMutator
crawler-url-parser.js:36:48
-   	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+   	currentUrlStr = currentUrlStr.replace(/#.*$/, '#abc');

[Survived] PrecomputedMutator
crawler-url-parser.js:40:35
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/^#/, '');

[Survived] PrecomputedMutator
crawler-url-parser.js:40:35
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/^#\w+/, '');

[Survived] PrecomputedMutator
crawler-url-parser.js:40:35
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/^#\w+/i, '');

[Survived] PrecomputedMutator
crawler-url-parser.js:40:43
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/#.*$/, ' ');

[Survived] PrecomputedMutator
crawler-url-parser.js:42:41
-   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr.toLowerCase())) {

[Survived] PrecomputedMutator
crawler-url-parser.js:63:39
-   	parsedUrl = URL.parse(currentUrlStr, true, true);
+   	parsedUrl = URL.parse(currentUrlStr, undefined, true);

[Survived] PrecomputedMutator
crawler-url-parser.js:63:39
-   	parsedUrl = URL.parse(currentUrlStr, true, true);
+   	parsedUrl = URL.parse(currentUrlStr, null, true);

[Survived] PrecomputedMutator
crawler-url-parser.js:72:30
-   		let parsedHost = psl.parse(ret.host);
+   		let parsedHost = psl.parse(ret.host.toLowerCase());

[Survived] PrecomputedMutator
crawler-url-parser.js:72:30
-   		let parsedHost = psl.parse(ret.host);
+   		let parsedHost = psl.parse(ret.host.toUpperCase());

[Survived] PrecomputedMutator
crawler-url-parser.js:87:50
-   	let $ = typeof data === "string" ? cheerio.load(data) : data;
+   	let $ = typeof data === "string" ? cheerio.load(data.toString()) : data;

[Survived] PrecomputedMutator
crawler-url-parser.js:95:16
-   		let text = $(this).text().trim();
+   		let text = $(this.text).text().trim();

[Survived] PrecomputedMutator
crawler-url-parser.js:95:16
-   		let text = $(this).text().trim();
+   		let text = $($(this).attr('text')).text().trim();

[Survived] PrecomputedMutator
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href) || href == null) return;

[Survived] PrecomputedMutator
crawler-url-parser.js:97:92
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href.toLowerCase())) return;

[Survived] PrecomputedMutator
crawler-url-parser.js:97:92
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href.trim())) return;

[Survived] PrecomputedMutator
crawler-url-parser.js:99:26
-   		let currentUrl = parse(href, baseUrlStr);
+   		let currentUrl = parse(href.toLowerCase(), baseUrlStr);

[Survived] PrecomputedMutator
crawler-url-parser.js:99:26
-   		let currentUrl = parse(href, baseUrlStr);
+   		let currentUrl = parse(href.trim(), baseUrlStr);

[Survived] PrecomputedMutator
crawler-url-parser.js:102:19
-   			if (urlMap.has(currentUrl.url)) {
+   			if (urlMap.has(currentUrl.url.toLowerCase())) {

[Survived] PrecomputedMutator
crawler-url-parser.js:102:19
-   			if (urlMap.has(currentUrl.url)) {
+   			if (urlMap.has(currentUrl.url.toUpperCase())) {

[Survived] PrecomputedMutator
crawler-url-parser.js:104:9
-   				if (!tmpUrl.text.includes(text)) {
+   				if (tmpUrl.text.startsWith(text)) {

[Survived] PrecomputedMutator
crawler-url-parser.js:104:9
-   				if (!tmpUrl.text.includes(text)) {
+   				if (tmpUrl.text.endsWith(text)) {

[Survived] PrecomputedMutator
crawler-url-parser.js:104:31
-   				if (!tmpUrl.text.includes(text)) {
+   				if (!tmpUrl.text.includes(text.trim())) {

[Survived] PrecomputedMutator
crawler-url-parser.js:110:16
-   				urlMap.set(currentUrl.url, currentUrl);
+   				urlMap.set(currentUrl.url.toLowerCase(), currentUrl);

[Survived] PrecomputedMutator
crawler-url-parser.js:110:16
-   				urlMap.set(currentUrl.url, currentUrl);
+   				urlMap.set(currentUrl.url.toUpperCase(), currentUrl);

[Survived] PrecomputedMutator
crawler-url-parser.js:116:16
-   	urlMap.delete(baseUrlStr);
+   	urlMap.delete(baseUrl.protocol);

[Survived] PrecomputedMutator
crawler-url-parser.js:116:16
-   	urlMap.delete(baseUrlStr);
+   	urlMap.delete(baseUrl.host);

[Survived] PrecomputedMutator
crawler-url-parser.js:119:21
-   		currentUrl.type = gettype(currentUrl, baseUrl);
+   		currentUrl.type = gettype(currentUrl.url, baseUrl.url);

[Survived] PrecomputedMutator
crawler-url-parser.js:119:21
-   		currentUrl.type = gettype(currentUrl, baseUrl);
+   		currentUrl.type = gettype(currentUrl, baseUrl.url);

[Survived] PrecomputedMutator
crawler-url-parser.js:119:21
-   		currentUrl.type = gettype(currentUrl, baseUrl);
+   		currentUrl.type = gettype(currentUrl.url, baseUrl);

[Survived] PrecomputedMutator
crawler-url-parser.js:119:41
-   		currentUrl.type = gettype(currentUrl, baseUrl);
+   		currentUrl.type = gettype(currentUrl, baseUrl.url);

[Survived] PrecomputedMutator
crawler-url-parser.js:138:6
-   	if (typeof linkurl == "string") linkurl = parse(linkurl);
+   	if (linkurl.constructor.name === "String") linkurl = parse(linkurl);

[Survived] PrecomputedMutator
crawler-url-parser.js:138:6
-   	if (typeof linkurl == "string") linkurl = parse(linkurl);
+   	if (Object.prototype.toString.call(linkurl) === "[object String]") linkurl = parse(linkurl);

[Survived] PrecomputedMutator
crawler-url-parser.js:139:6
-   	if (typeof pageurl == "string") pageurl = parse(pageurl);
+   	if (pageurl.host == null) pageurl = parse(pageurl);

[Survived] PrecomputedMutator
crawler-url-parser.js:146:93
-   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '*');

[Survived] PrecomputedMutator
crawler-url-parser.js:147:17
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, 'index').replace(/\/default\.[a-z]+$/, '/');

[Survived] PrecomputedMutator
crawler-url-parser.js:147:38
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-zA-Z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] PrecomputedMutator
crawler-url-parser.js:147:38
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-zA-Z0-9]+$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] PrecomputedMutator
crawler-url-parser.js:156:6
-   	if (pageurl.host == linkurl.host) {
+   	if (linkurl.host == pageurl.host && linkurl.subdomain == pageurl.subdomain && linkurl.path != pageurl.path) {

[Survived] PrecomputedMutator
crawler-url-parser.js:163:8
-   			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+   			if (linkurl_without_last_part.startsWith(pageurl_without_last_part)) return "samelevel"

[Survived] PrecomputedMutator
crawler-url-parser.js:163:8
-   			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+   			if (linkurl_without_last_part.endsWith(pageurl_without_last_part)) return "samelevel"

[Survived] PrecomputedMutator
crawler-url-parser.js:165:30
-   			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+   			if (linkurl_path.includes(pageurl_path.replace(/^\/|\/$/g, ''))) return "sublevel";

[Survived] PrecomputedMutator
crawler-url-parser.js:165:30
-   			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+   			if (linkurl_path.includes(pageurl_path.split('/').pop())) return "sublevel";

[Survived] PrecomputedMutator
crawler-url-parser.js:167:30
-   			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+   			if (pageurl_path.includes(linkurl_path.toLowerCase())) return "uplevel";

[Survived] PrecomputedMutator
crawler-url-parser.js:167:30
-   			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+   			if (pageurl_path.includes(linkurl_path.replace(/^\/|\/$/g, ""))) return "uplevel";

[Survived] PrecomputedMutator
crawler-url-parser.js:167:30
-   			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+   			if (pageurl_path.includes(linkurl_path.split("/").pop())) return "uplevel";

[Survived] PrecomputedMutator
crawler-url-parser.js:171:13
-   	} else if (linkurl.domain == pageurl.domain) {
+   	} else if (linkurl.domain == pageurl.domain && linkurl.subdomain != pageurl.subdomain) {

[Survived] PrecomputedMutator
crawler-url-parser.js:172:7
-   		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+   		if (linkurl_subdomain_len < pageurl_subdomain_len - 1) return "updomain";

[Survived] PrecomputedMutator
crawler-url-parser.js:205:12
-   	let res = parse(url);
+   	let res = url(url);

[Survived] PrecomputedMutator
crawler-url-parser.js:205:18
-   	let res = parse(url);
+   	let res = parse(url.toString());

[Survived] PrecomputedMutator
crawler-url-parser.js:205:18
-   	let res = parse(url);
+   	let res = parse(url.pathname);
