[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (typeof a === 'undefined') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:5
-       for (const key in a) {
-         if (a[key] !== undefined && b[key] === undefined) {
-           attributes[key] = a[key];
-         }
-       }
+       for (const key in a || b) {
+     if (a[key] !== undefined && b[key] === undefined) {
+       attributes[key] = a[key];
+     }
+   }

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (typeof a === 'undefined') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:55:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(attributes)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (typeof b !== 'object' && b !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(attributes.toString()).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && Array.isArray(ops.ops) && ops.ops[0] != null) {

[Survived] PrecomputedMutator
src/Delta.ts:130:13
-           if (typeof lastOp !== 'object') {
+           if (typeof lastOp === 'undefined') {

[Survived] PrecomputedMutator
src/Delta.ts:137:11
-             typeof newOp.insert === 'string' &&
-             typeof lastOp.insert === 'string'
+             typeof newOp.insert === 'string' && typeof lastOp.insert === 'string' && newOp.insert.length > 0

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes != null && typeof newOp.attributes === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes != null && typeof newOp.attributes === 'object' && Object.keys(newOp.attributes).length > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes === 'foo'

[Survived] PrecomputedMutator
src/Delta.ts:259:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (thisIter.hasNext() || otherIter.hasNext() || otherIter.hasNext()) {

[Survived] PrecomputedMutator
src/Delta.ts:261:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(Infinity));

[Survived] PrecomputedMutator
src/Delta.ts:261:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(NaN));

[Survived] PrecomputedMutator
src/Delta.ts:263:20
-           delta.push(thisIter.next());
+           delta.push(thisIter.next(2));

[Survived] PrecomputedMutator
src/Delta.ts:263:20
-           delta.push(thisIter.next());
+           delta.push(thisIter.next(3));

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1])

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 2])

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[Math.floor(delta.ops.length / 2)], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.slice(1, 3));

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.slice(1, 4));

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (this.ops == other.ops) {

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), this.ops.length);

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, true)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, false)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, undefined)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, thisOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, thisOp.insert, otherOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert, thisOp.insert, otherOp.insert, thisOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:25
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert.valueOf(), otherOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(3));

[Survived] PrecomputedMutator
src/Delta.ts:419:18
-         } else if (index > 0) {
+         } else if (index > 1) {

[Survived] PrecomputedMutator
src/Delta.ts:430:23
-         predicate(line, {}, i);
+         predicate(line, {}, i);

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (typeof op.retain === 'object' && op.retain !== null && Object.keys(op.retain).length > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData, 1) },

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData, null) },

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData, undefined) },

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(3)));

[Survived] PrecomputedMutator
src/Delta.ts:493:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(3));

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.transform(thisData, otherData, priority)) {

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.transform(thisData[embedType], otherData, priority)) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module === 'object' && module.exports) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'object' && op.retain !== null && typeof op.retain === 'string') {

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           typeof op.retain === 'number' || typeof op.retain === 'object'

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.index !== 0) {
