[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap = {}) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (!result[country] && Object.assign(result, {
+     [country]: {
+       current: [],
+       all: []
+     }
+   })) Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, {}));

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, {
+     name: 'United States'
+   }));

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, {
+     name: 'United States',
+     timezones: ['America/New_York']
+   }));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, {}));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, {
+     foo: 'bar'
+   }));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, {
+     foo: 'bar',
+     baz: 'qux'
+   }));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, 1));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, 'foo'));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, undefined));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(timezones).length;

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key] || {}
+   });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key] ? tzs[key] : {}
+   });
