[Survived] PrecomputedMutator
lib/request.js:6:19
-     const request = url.trimLeft().startsWith('https') ? https : http;
+     const request = url.trimRight().startsWith('https') ? https : http;

[Survived] PrecomputedMutator
lib/request.js:10:11
-         if (res.statusCode !== 200) {
+         if (res.statusCode > 200) {

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     flags: 'a'
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     encoding: 'utf8'
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     mode: 0o666
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream('/dev/null'))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream('/tmp/test.txt'))

[Survived] PrecomputedMutator
lib/request.js:23:33
-       .on('timeout', () => reject(new TimeoutError()))
+       .on('timeout', () => reject(new TimeoutError('Custom message')))

[Survived] PrecomputedMutator
lib/request.js:23:33
-       .on('timeout', () => reject(new TimeoutError()))
+       .on('timeout', () => reject(new TimeoutError(undefined)))

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.toLowerCase())) {

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.replace(/ /g, '_'))) {

[Survived] PrecomputedMutator
index.js:17:24
-         const basename = path.basename(pathname);
+         const basename = path.join(pathname);

[Survived] PrecomputedMutator
index.js:20:22
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(path.join(options.dest, decodedBasename));

[Survived] PrecomputedMutator
index.js:20:22
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.resolve(options.dest, decodedBasename);

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.extname(options.dest) === '.jpg') {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.toUpperCase())) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace(/[a-z]/g, 'X'))) {

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(path.join(__dirname, options.dest));

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(path.resolve(options.dest));
