[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.encoding || 'utf8')

[Survived] PrecomputedMutator
index.js:21:19
-     data = stripBom(data)
+     data = stripBom(data.toString())

[Survived] PrecomputedMutator
index.js:21:19
-     data = stripBom(data)
+     data = stripBom(data.toString('utf8'))

[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data.toString('utf8'), options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data.toString('utf8').trim(), options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options.reviver || null)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options.reviver && options.reviver)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options.reviver ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:27:9
-       if (shouldThrow) {
+       if (shouldThrow && err.message) {

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options, null)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options, undefined)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options, 1)

[Survived] PrecomputedMutator
index.js:51:24
-       content = stripBom(content)
+       content = stripBom(content.toString())

[Survived] PrecomputedMutator
index.js:51:24
-       content = stripBom(content)
+       content = stripBom(content.toString('utf8'))

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver || null)

[Survived] PrecomputedMutator
index.js:52:23
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content.toString(), options.reviver)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow && err.message) {

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, null)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, undefined)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, {})

[Survived] PrecomputedMutator
index.js:78:27
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file.toLowerCase(), str, options)

[Survived] PrecomputedMutator
index.js:78:27
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file.replace(/ /g, '_'), str, options)

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, EOL)

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, finalEOL)

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, EOL, finalEOL)

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.toString('utf8')) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, '\n')

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, '\r\n')
