[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (timezone === undefined) return null;

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (memoizedTimezones < totalTimezones) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:45:42
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, {
+     ...options
+   }));
