[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file)

[Survived] PrecomputedMutator
utils.js:5:22
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/\r?\n/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:11:26
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\ufeff/, '')
