[Survived] PrecomputedMutator
complex.js:480:20
-           } else if (a === 0) { // If base is fully imaginary
+           } else if (a === 0 && b === 0 && z['re'] > 0 && z['im'] >= 0) { // If base is fully imaginary
