[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (a === b) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:23:13
-           if (attributes[key] != null) {
+           if (attributes[key] !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:34:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(attributes)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(a).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:60:9
-       if (Array.isArray(ops)) {
+       if (typeof ops === 'object' && Array.isArray(ops)) {

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (typeof ops === 'object' && ops.ops != null) {

[Survived] PrecomputedMutator
src/Delta.ts:81:19
-         Object.keys(attributes).length > 0
+         Object.keys(Object.keys(attributes)).length > 0

[Survived] PrecomputedMutator
src/Delta.ts:106:19
-         Object.keys(attributes).length > 0
+         Object.keys(Object.keys(attributes)).length > 0

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (lastOp.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (this.ops.length === index) {

[Survived] PrecomputedMutator
src/Delta.ts:174:28
-       return this.ops.filter(predicate);
+       return this.ops.filter((op, index) => predicate(op, index));

[Survived] PrecomputedMutator
src/Delta.ts:178:22
-       this.ops.forEach(predicate);
+       this.ops.forEach((op, index) => predicate(op, index));

[Survived] PrecomputedMutator
src/Delta.ts:252:18
-           ops.push(thisIter.next());
+           ops.push(thisIter.next(firstLeft));

[Survived] PrecomputedMutator
src/Delta.ts:302:15
-             if (attributes) {
+             if (attributes != null) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekLength() === 0

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(isEqual(thisOp.retain, otherOp.retain))

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(isEqual(newOp, otherOp), newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:54
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], {
+     retain: 1
+   })

[Survived] PrecomputedMutator
src/Delta.ts:313:33
-               return delta.concat(rest).chop();
+               return delta.concat(new Delta(thisIter.rest())).chop();

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], diff.DiffResult);

[Survived] PrecomputedMutator
src/Delta.ts:368:41
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, length);

[Survived] PrecomputedMutator
src/Delta.ts:415:35
-             ? thisOp.insert.indexOf(newline, start) - start
+             ? thisOp.insert.indexOf('\n', start) - start

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.transform(thisData[embedType], otherData[embedType], priority)) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module !== 'undefined' && module.exports) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.insert === 'object') {

[Survived] PrecomputedMutator
src/OpIterator.ts:25:34
-         const opLength = Op.length(nextOp);
+         const opLength = Op.length(this.ops[this.index]);

[Survived] PrecomputedMutator
src/OpIterator.ts:26:11
-         if (length >= opLength - offset) {
+         if (offset + length >= opLength) {

[Survived] PrecomputedMutator
src/OpIterator.ts:66:9
-       if (this.ops[this.index]) {
+       if (this.index < this.ops.length) {
