[Survived] PrecomputedMutator
lib/request.js:23:33
-       .on('timeout', () => reject(new TimeoutError()))
+       .on('timeout', () => reject(new TimeoutError('Request timed out.')))

[Survived] PrecomputedMutator
index.js:28:18
-     return request(options);
+     return request({
+     url: options.url,
+     dest: options.dest,
+     extractFilename: extractFilename,
+     ...options
+   });
