[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y / x, x);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this);
