[Survived] PrecomputedMutator
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(!busy && abort) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(abort && !busy) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/flatten.js:38:20
-             else if ('function' !== typeof stream)
+             else if (typeof stream !== 'function')

[Survived] PrecomputedMutator
pull.js:21:33
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[length / 2])

[Survived] PrecomputedMutator
pull.js:40:9
-       if (typeof s === 'function') {
+       if (Object.prototype.toString.call(s) === '[object Function]') {
