[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (typeof timezonesMap === 'undefined') timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-timezone.js:14:21
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isSafeInteger(tz.d) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(timezone.name).length;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(timezone.countries).length;

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, {
+     country: null
+   });

[Survived] PrecomputedMutator
src/index.js:70:7
-     if (!country) return null;
+     if (country === undefined) return null;
