[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.encoding || 'utf8')

[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data.toString(), options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.encoding, options.flag, options.mode)

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.toString('utf8') !== content) content = content.toString('utf8')
