[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.split('/').slice(-1)[0]);

[Survived] PrecomputedMutator
index.js:20:32
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest.replace('bar', 'baz'), decodedBasename);
