[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap !== null) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (result[country] == undefined) Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isInteger(tz.d - 1) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isInteger(tz.d * 2) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:30:17
-     const hours = Math.floor(offset / 60);
+     const hours = Math.trunc(offset / 60);

[Survived] PrecomputedMutator
src/build-timezone.js:34:30
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(Math.floor(offset / 60))}:${getNumStr(min)}`;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(Math.abs(input));

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, undefined) });

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones > memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones.hasOwnProperty(name)) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, null));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.values(timezones).length).length;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(data.timezones).length).length;

[Survived] PrecomputedMutator
src/index.js:43:32
-     const timezone = getTimezone(tzName) || {};
+     const timezone = getTimezone(tzName.split(' ')[0]) || {};

[Survived] PrecomputedMutator
src/index.js:45:28
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options, 1));

[Survived] PrecomputedMutator
src/index.js:45:28
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options, "foo"));

[Survived] PrecomputedMutator
src/index.js:45:28
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options, null));

[Survived] PrecomputedMutator
src/index.js:45:42
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options.deprecated ? options : null));

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, {});

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, {
+     country: tzName
+   });

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (tzs[key].deprecated !== true) Object.assign(prev, { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:70:7
-     if (!country) return null;
+     if (country == null) return null;
