[Killed] PrecomputedMutator
src/build-country.js:5:7
 
 export default function buildCountry(data, id) {
   const name = data.countries[id];
-  if (!name) return null;
+  if (!name.trim()) return null;
 
   const tzMap = getTimezonesMap(data)[id] || {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:5:7
 
 export default function buildCountry(data, id) {
   const name = data.countries[id];
-  if (!name) return null;
+  if (name.length === 0) return null;
 
   const tzMap = getTimezonesMap(data)[id] || {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:7:33
   const name = data.countries[id];
   if (!name) return null;
 
-  const tzMap = getTimezonesMap(data)[id] || {};
+  const tzMap = getTimezonesMap({})[id] || {};
 
   return {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:7:33
   const name = data.countries[id];
   if (!name) return null;
 
-  const tzMap = getTimezonesMap(data)[id] || {};
+  const tzMap = getTimezonesMap(null)[id] || {};
 
   return {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:18:55
 }
 
 function getTimezonesMap(data) {
-  if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+  if (!timezonesMap) timezonesMap = buildTimezonesMap(data.timezones[c]);
   return timezonesMap;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:18:55
 }
 
 function getTimezonesMap(data) {
-  if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+  if (!timezonesMap) timezonesMap = buildTimezonesMap(data.timezones[a]);
   return timezonesMap;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:23:22
 }
 
 function buildTimezonesMap(data) {
-  return Object.keys(data.timezones).reduce((result, id) => {
+  return Object.keys(data.timezones.length).reduce((result, id) => {
     const tz = data.timezones[id];
     const { c, a } = tz;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:23:22
 }
 
 function buildTimezonesMap(data) {
-  return Object.keys(data.timezones).reduce((result, id) => {
+  return Object.keys(data.timezones[0]).reduce((result, id) => {
     const tz = data.timezones[id];
     const { c, a } = tz;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:29:9
     const aliasTz = data.timezones[a] || {};
     const countries = c || aliasTz.c;
 
-    if (!countries) return result;
+    if (countries.length === 0) return result;
 
     countries.forEach((country) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:29:9
     const aliasTz = data.timezones[a] || {};
     const countries = c || aliasTz.c;
 
-    if (!countries) return result;
+    if (countries.some(country => country === undefined)) return result;
 
     countries.forEach((country) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:32:11
     if (!countries) return result;
 
     countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+      if (result[country] !== undefined) Object.assign(result, { [country]: { current: [], all: [] } });
       if (tz.r === undefined) result[country].current.push(id);
       result[country].all.push(id);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:32:29
     if (!countries) return result;
 
     countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+      if (!result[country]) Object.assign(result, {
+  [country]: {
+    current: [id],
+    all: [id]
+  }
+});
       if (tz.r === undefined) result[country].current.push(id);
       result[country].all.push(id);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:33:60
 
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
+      if (tz.r === undefined) result[country].current.push(tz.r);
       result[country].all.push(id);
     });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:33:60
 
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
+      if (tz.r === undefined) result[country].current.push(tz.r + 1);
       result[country].all.push(id);
     });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:34:32
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
       if (tz.r === undefined) result[country].current.push(id);
-      result[country].all.push(id);
+      result[country].all.push(tz.c);
     });
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-country.js:34:32
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
       if (tz.r === undefined) result[country].current.push(id);
-      result[country].all.push(id);
+      result[country].all.push(tz.a);
     });
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha
