[Killed] PrecomputedMutator
src/build-timezone.js:3:7
 export default function buildTimezone(data, name) {
   const timezone = data.timezones[name];
-  if (!timezone) return null;
+  if (timezone.length === 0) return null;
 
   const { a: aliasOf = null } = timezone;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:3:7
 export default function buildTimezone(data, name) {
   const timezone = data.timezones[name];
-  if (!timezone) return null;
+  if (!timezone.length) return null;
 
   const { a: aliasOf = null } = timezone;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
 
   const countries = tz.c || [];
   const utcOffset = tz.u;
-  const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+  const dstOffset = Number.isInteger(tz.d * 2) ? tz.d : utcOffset;
 
   const result = {

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
 
   const countries = tz.c || [];
   const utcOffset = tz.u;
-  const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+  const dstOffset = Number.isInteger(tz.d + 1) ? tz.d : utcOffset;
 
   const result = {

[Killed] PrecomputedMutator
src/build-timezone.js:20:32
     name,
     countries,
     utcOffset,
-    utcOffsetStr: getOffsetStr(utcOffset),
+    utcOffsetStr: getOffsetStr(utcOffset + 1),
     dstOffset,
     dstOffsetStr: getOffsetStr(dstOffset),
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:20:32
     name,
     countries,
     utcOffset,
-    utcOffsetStr: getOffsetStr(utcOffset),
+    utcOffsetStr: getOffsetStr(utcOffset - 1),
     dstOffset,
     dstOffsetStr: getOffsetStr(dstOffset),
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:22:32
     utcOffset,
     utcOffsetStr: getOffsetStr(utcOffset),
     dstOffset,
-    dstOffsetStr: getOffsetStr(dstOffset),
+    dstOffsetStr: getOffsetStr(dstOffset * 2),
     aliasOf,
   };
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:22:32
     utcOffset,
     utcOffsetStr: getOffsetStr(utcOffset),
     dstOffset,
-    dstOffsetStr: getOffsetStr(dstOffset),
+    dstOffsetStr: getOffsetStr(dstOffset + 1),
     aliasOf,
   };
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:25:7
     dstOffsetStr: getOffsetStr(dstOffset),
     aliasOf,
   };
-  if (timezone.r) result.deprecated = true;
+  if (timezone.r && timezone.r.d) result.deprecated = true;
   return result;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:25:7
     dstOffsetStr: getOffsetStr(dstOffset),
     aliasOf,
   };
-  if (timezone.r) result.deprecated = true;
+  if (timezone.r && timezone.r.d !== undefined) result.deprecated = true;
   return result;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:30:28
 }
 
 function getOffsetStr(offset) {
-  const hours = Math.floor(offset / 60);
+  const hours = Math.floor(offset % 60);
   const min = offset % 60;
   const sign = offset < 0 ? '-' : '+';
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:34:30
   const min = offset % 60;
   const sign = offset < 0 ? '-' : '+';
 
-  return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+  return `${sign}${getNumStr(offset)}:${getNumStr(min)}`;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:34:50
   const min = offset % 60;
   const sign = offset < 0 ? '-' : '+';
 
-  return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+  return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(offset / 60) - 1)}`;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:38:15
 }
 
 function getNumStr(input) {
-  const num = Math.abs(input);
+  const num = Math.ceil(input);
   const prefix = num < 10 ? '0' : '';
   return `${prefix}${num}`;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/build-timezone.js:38:24
 }
 
 function getNumStr(input) {
-  const num = Math.abs(input);
+  const num = Math.abs(Math.floor(input / 60));
   const prefix = num < 10 ? '0' : '';
   return `${prefix}${num}`;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha
