[Killed] PrecomputedMutator
src/index.js:5:36
 import buildCountry from './build-country';
 import buildTimezone from './build-timezone';
 
-const totalTimezones = Object.keys(data.timezones).length;
+const totalTimezones = Object.keys(data.timezones.slice(1)).length;
 const countries = {};
 const timezones = {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:5:36
 import buildCountry from './build-country';
 import buildTimezone from './build-timezone';
 
-const totalTimezones = Object.keys(data.timezones).length;
+const totalTimezones = Object.keys(data.timezones.length).length;
 const countries = {};
 const timezones = {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:11:22
 let memoizedTimezones = 0;
 
 export function getAllCountries(options = {}) {
-  return Object.keys(data.countries).reduce((prev, id) => {
+  return Object.keys(data.timezones[0]).reduce((prev, id) => {
     return Object.assign(prev, { [id]: getCountry(id, options) });
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:11:22
 let memoizedTimezones = 0;
 
 export function getAllCountries(options = {}) {
-  return Object.keys(data.countries).reduce((prev, id) => {
+  return Object.keys(data.timezones.length).reduce((prev, id) => {
     return Object.assign(prev, { [id]: getCountry(id, options) });
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:12:26
 
 export function getAllCountries(options = {}) {
   return Object.keys(data.countries).reduce((prev, id) => {
-    return Object.assign(prev, { [id]: getCountry(id, options) });
+    return Object.assign(prev + 1, { [id]: getCountry(id, options) });
   }, {});
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:12:55
 
 export function getAllCountries(options = {}) {
   return Object.keys(data.countries).reduce((prev, id) => {
-    return Object.assign(prev, { [id]: getCountry(id, options) });
+    return Object.assign(prev, { [id]: getCountry(id, options.deprecated) });
   }, {});
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:17:81
 }
 
 export function getAllTimezones(options = {}) {
-  if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+  if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(timezones[id]);
   return deliverTimezones(timezones, options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:18:27
 
 export function getAllTimezones(options = {}) {
   if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
-  return deliverTimezones(timezones, options);
+  return deliverTimezones(timezones.filter(tz => tz.deprecated), options);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:18:38
 
 export function getAllTimezones(options = {}) {
   if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
-  return deliverTimezones(timezones, options);
+  return deliverTimezones(timezones, options.deprecated = true);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:22:38
 }
 
 export function getCountry(id, options = {}) {
-  if (!countries[id]) memoizeCountry(buildCountry(data, id));
+  if (!countries[id]) memoizeCountry(buildCountry(data, id - 1));
   return deliverCountry(countries[id], options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:22:7
 }
 
 export function getCountry(id, options = {}) {
-  if (!countries[id]) memoizeCountry(buildCountry(data, id));
+  if (!countries[id] && getCountry(id)) memoizeCountry(buildCountry(data, id));
   return deliverCountry(countries[id], options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:23:25
 
 export function getCountry(id, options = {}) {
   if (!countries[id]) memoizeCountry(buildCountry(data, id));
-  return deliverCountry(countries[id], options);
+  return deliverCountry(countries[id] = {}, options);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:23:10
 
 export function getCountry(id, options = {}) {
   if (!countries[id]) memoizeCountry(buildCountry(data, id));
-  return deliverCountry(countries[id], options);
+  return deliverCountry(countries[id] = options.country);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:27:7
 }
 
 function memoizeCountry(country) {
-  if (!country) return;
+  if (country.name) return;
   countries[country.id] = country;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:27:7
 }
 
 function memoizeCountry(country) {
-  if (!country) return;
+  if (country.id) return;
   countries[country.id] = country;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:32:55
 }
 
 export function getTimezone(name) {
-  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+  if (!timezones[name]) memoizeTimezone(buildTimezone({}, name));
   return timezones[name] ? { ...timezones[name] } : null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:32:61
 }
 
 export function getTimezone(name) {
-  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name.toUpperCase()));
   return timezones[name] ? { ...timezones[name] } : null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:37:7
 }
 
 function memoizeTimezone(timezone) {
-  if (!timezone) return;
+  if (timezone.name === 'UTC') return;
   timezones[timezone.name] = timezone;
   memoizedTimezones = Object.keys(timezone).length;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:37:7
 }
 
 function memoizeTimezone(timezone) {
-  if (!timezone) return;
+  if (timezone.name.length > 0) return;
   timezones[timezone.name] = timezone;
   memoizedTimezones = Object.keys(timezone).length;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Survived] PrecomputedMutator
src/index.js:39:35
 function memoizeTimezone(timezone) {
   if (!timezone) return;
   timezones[timezone.name] = timezone;
-  memoizedTimezones = Object.keys(timezone).length;
+  memoizedTimezones = Object.keys(Object.keys(data.timezones).length).length;
 }
 

[Survived] PrecomputedMutator
src/index.js:39:35
 function memoizeTimezone(timezone) {
   if (!timezone) return;
   timezones[timezone.name] = timezone;
-  memoizedTimezones = Object.keys(timezone).length;
+  memoizedTimezones = Object.keys(Object.keys(timezones).length).length;
 }
 

[Killed] PrecomputedMutator
src/index.js:43:32
 }
 
 export function getCountriesForTimezone(tzName, options = {}) {
-  const timezone = getTimezone(tzName) || {};
+  const timezone = getTimezone(tzName.toUpperCase()) || {};
   const values = timezone.countries || [];
   return values.map((c) => getCountry(c, options));
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:43:32
 }
 
 export function getCountriesForTimezone(tzName, options = {}) {
-  const timezone = getTimezone(tzName) || {};
+  const timezone = getTimezone(tzName.length) || {};
   const values = timezone.countries || [];
   return values.map((c) => getCountry(c, options));
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:45:42
 export function getCountriesForTimezone(tzName, options = {}) {
   const timezone = getTimezone(tzName) || {};
   const values = timezone.countries || [];
-  return values.map((c) => getCountry(c, options));
+  return values.map((c) => getCountry(c, !options));
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:45:21
 export function getCountriesForTimezone(tzName, options = {}) {
   const timezone = getTimezone(tzName) || {};
   const values = timezone.countries || [];
-  return values.map((c) => getCountry(c, options));
+  return values.map(c => getTimezone(c, options));
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:49:18
 }
 
 export function getCountryForTimezone(tzName, options = {}) {
-  const [main] = getCountriesForTimezone(tzName, options);
+  const [main] = getAllCountries(tzName, options);
   return main || null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:49:50
 }
 
 export function getCountryForTimezone(tzName, options = {}) {
-  const [main] = getCountriesForTimezone(tzName, options);
+  const [main] = getCountriesForTimezone(tzName, options.deprecated = true);
   return main || null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:54:41
 }
 
 export function getTimezonesForCountry(countryId, options = {}) {
-  const country = getCountry(countryId, options);
+  const country = getCountry(countryId, options.deprecated = true);
   if (!country) return null;
   const values = country.timezones || [];
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:54:30
 }
 
 export function getTimezonesForCountry(countryId, options = {}) {
-  const country = getCountry(countryId, options);
+  const country = getCountry("invalid_country_id", options);
   if (!country) return null;
   const values = country.timezones || [];
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:55:7
 
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
-  if (!country) return null;
+  if (country !== undefined) return null;
   const values = country.timezones || [];
   return values.map(getTimezone);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:55:7
 
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
-  if (!country) return null;
+  if (country.length === 0) return null;
   const values = country.timezones || [];
   return values.map(getTimezone);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:57:10
   const country = getCountry(countryId, options);
   if (!country) return null;
   const values = country.timezones || [];
-  return values.map(getTimezone);
+  return values.reduce(getTimezone);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:57:21
   const country = getCountry(countryId, options);
   if (!country) return null;
   const values = country.timezones || [];
-  return values.map(getTimezone);
+  return values.map(getTimezone(name).countries);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:62:7
 
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
-  if (deprecated === true) return tzs;
+  if (!deprecated) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
     if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:63:22
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
-  return Object.keys(tzs).reduce((prev, key) => {
+  return Object.keys(Object.keys(tzs)).reduce((prev, key) => {
     if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
     return prev;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:63:22
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
-  return Object.keys(tzs).reduce((prev, key) => {
+  return Object.keys(tzs[0]).reduce((prev, key) => {
     if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
     return prev;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:64:45
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+    if (!tzs[key].deprecated) Object.assign(prev + tzs[key], { [key]: tzs[key] });
     return prev;
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:64:9
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+    if (tzs[key].deprecated === true) Object.assign(prev, { [key]: tzs[key] });
     return prev;
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:70:7
 }
 
 function deliverCountry(country, options) {
-  if (!country) return null;
+  if (country !== null) return null;
   const { deprecated } = options || {};
   const { allTimezones, ...other } = country;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha

[Killed] PrecomputedMutator
src/index.js:70:7
 }
 
 function deliverCountry(country, options) {
-  if (!country) return null;
+  if (country === null) return null;
   const { deprecated } = options || {};
   const { allTimezones, ...other } = country;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test
> yarn run test:unit


yarn run v1.22.22

$ mocha
