[Killed] PrecomputedMutator
crawler-url-parser.js:31:6
 		search: null,
 		querycount: 0
 	}
-	if (typeof currentUrlStr === 'undefined') return null;
+	if (currentUrlStr === null) return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:31:6
 		search: null,
 		querycount: 0
 	}
-	if (typeof currentUrlStr === 'undefined') return null;
+	if (currentUrlStr.length === 0) return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:32:6
 		querycount: 0
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
-	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+	if (!currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:32:6
 		querycount: 0
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
-	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+	if (currentUrlStr || _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:33:6
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
-	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+	if (baseUrlStr && _has_illegal_chars(baseUrlStr) || true) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:33:6
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
-	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+	if (baseUrlStr && !_has_illegal_chars(baseUrlStr)) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:35:40
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
-	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
+	currentUrlStr = currentUrlStr.replace(/^https?:\/\/[^\/]+/, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:36:18
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
-	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+	currentUrlStr = currentUrlStr.replace(/#.*$/, null);
 
 	if (baseUrlStr) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:36:18
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
-	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+	currentUrlStr = currentUrlStr.replace(/#.*$/, 'hello');
 
 	if (baseUrlStr) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:38:6
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
-	if (baseUrlStr) {
+	if (baseUrlStr.toLowerCase()) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:38:6
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
-	if (baseUrlStr) {
+	if (baseUrlStr.split('').reverse().join('')) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:40:35
 
 	if (baseUrlStr) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
-		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+		baseUrlStr = baseUrlStr.replace(/[a-z]+/, '');
 	} else {
 		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:40:35
 
 	if (baseUrlStr) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
-		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+		baseUrlStr = baseUrlStr.replace(/\w+/, '');
 	} else {
 		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:42:41
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
-		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr.substring(1))) {
 			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:42:41
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
-		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr.length)) {
 			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:47:28
 		}
 	}
 
-	let parsedUrl = URL.parse(currentUrlStr, true, true);
+	let parsedUrl = URL.parse(currentUrlStr.replace("www.", ""), true, true);
 	delete parsedUrl.hash;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:47:28
 		}
 	}
 
-	let parsedUrl = URL.parse(currentUrlStr, true, true);
+	let parsedUrl = URL.parse(currentUrlStr + "example.com", true, true);
 	delete parsedUrl.hash;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:51:6
 	delete parsedUrl.hash;
 
 
-	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
+	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:' && parsedUrl.protocol != 'ftp:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:51:6
 	delete parsedUrl.hash;
 
 
-	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
+	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:' && parsedUrl.host != 'localhost') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"

[Killed] PrecomputedMutator
crawler-url-parser.js:54:6
 	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
-	if (parsedUrl.host == null && baseUrlStr) {
+	if (parsedUrl.host != null && baseUrlStr) {
 		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
 		delete parsedUrl.hash;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:54:6
 	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
-	if (parsedUrl.host == null && baseUrlStr) {
+	if (parsedUrl.host == null || baseUrlStr) {
 		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
 		delete parsedUrl.hash;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:55:23
 
 	//current url is relative like "abc", "/abc" or "../abc"
 	if (parsedUrl.host == null && baseUrlStr) {
-		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
+		let parsedBaseUrl = URL.parse(baseUrlStr, true, false);
 		delete parsedUrl.hash;
 		ret.baseurl = URL.format(parsedBaseUrl);

[Survived] PrecomputedMutator
crawler-url-parser.js:55:23
 
 	//current url is relative like "abc", "/abc" or "../abc"
 	if (parsedUrl.host == null && baseUrlStr) {
-		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
+		let parsedBaseUrl = URL.parse(baseUrlStr, false, true);
 		delete parsedUrl.hash;
 		ret.baseurl = URL.format(parsedBaseUrl);

[Killed] PrecomputedMutator
crawler-url-parser.js:57:28
 	if (parsedUrl.host == null && baseUrlStr) {
 		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
 		delete parsedUrl.hash;
-		ret.baseurl = URL.format(parsedBaseUrl);
+		ret.baseurl = URL.format(URL.parse(currentUrlStr, false, false));
 
 		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:57:17
 	if (parsedUrl.host == null && baseUrlStr) {
 		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
 		delete parsedUrl.hash;
-		ret.baseurl = URL.format(parsedBaseUrl);
+		ret.baseurl = URL.resolve(parsedBaseUrl);
 
 		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:59:31
 		delete parsedUrl.hash;
 		ret.baseurl = URL.format(parsedBaseUrl);
 
-		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
+		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl.search));
 		currentUrlStr = URL.format(absoluteUrl);
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:59:31
 		delete parsedUrl.hash;
 		ret.baseurl = URL.format(parsedBaseUrl);
 
-		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
+		let absoluteUrl = URL.parse(URL.parse(parsedBaseUrl, parsedUrl));
 		currentUrlStr = URL.format(absoluteUrl);
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:60:19
 		ret.baseurl = URL.format(parsedBaseUrl);
 
 		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
-		currentUrlStr = URL.format(absoluteUrl);
+		currentUrlStr = URL.toString(absoluteUrl);
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:60:30
 		ret.baseurl = URL.format(parsedBaseUrl);
 
 		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
-		currentUrlStr = URL.format(absoluteUrl);
+		currentUrlStr = URL.format(URL.parse(currentUrlStr, true, true));
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:63:14
 		currentUrlStr = URL.format(absoluteUrl);
 	}
 
-	parsedUrl = URL.parse(currentUrlStr, true, true);
+	parsedUrl = URL.parse(currentUrlStr, false, false);
 	delete parsedUrl.hash;
 

[Survived] PrecomputedMutator
crawler-url-parser.js:63:45
 		currentUrlStr = URL.format(absoluteUrl);
 	}
 
-	parsedUrl = URL.parse(currentUrlStr, true, true);
+	parsedUrl = URL.parse(currentUrlStr, true, false);
 	delete parsedUrl.hash;
 

[Killed] PrecomputedMutator
crawler-url-parser.js:66:23
 	parsedUrl = URL.parse(currentUrlStr, true, true);
 	delete parsedUrl.hash;
 
-	ret.url = URL.format(parsedUrl);
+	ret.url = URL.format(parsedUrl.hash);
 	ret.protocol = parsedUrl.protocol;
 	ret.host = parsedUrl.host;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:66:12
 	parsedUrl = URL.parse(currentUrlStr, true, true);
 	delete parsedUrl.hash;
 
-	ret.url = URL.format(parsedUrl);
+	ret.url = URL.parse(parsedUrl);
 	ret.protocol = parsedUrl.protocol;
 	ret.host = parsedUrl.host;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:71:6
 	ret.host = parsedUrl.host;
 	ret.path = parsedUrl.pathname;
 
-	if (ret.host) {
+	if (ret.hostname) {
 		let parsedHost = psl.parse(ret.host);
 		ret.domain = parsedHost.domain;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:71:6
 	ret.host = parsedUrl.host;
 	ret.path = parsedUrl.pathname;
 
-	if (ret.host) {
+	if (ret.pathname) {
 		let parsedHost = psl.parse(ret.host);
 		ret.domain = parsedHost.domain;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:72:30
 	ret.path = parsedUrl.pathname;
 
 	if (ret.host) {
-		let parsedHost = psl.parse(ret.host);
+		let parsedHost = psl.parse(ret.host.split('.')[0]);
 		ret.domain = parsedHost.domain;
 		ret.subdomain = parsedHost.subdomain;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:72:30
 	ret.path = parsedUrl.pathname;
 
 	if (ret.host) {
-		let parsedHost = psl.parse(ret.host);
+		let parsedHost = psl.parse(ret.hostname);
 		ret.domain = parsedHost.domain;
 		ret.subdomain = parsedHost.subdomain;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:78:61
 	}
 
 	ret.search = parsedUrl.search;
-	ret.querycount = parsedUrl.search ? parsedUrl.search.split("=").length - 1 : 0;
+	ret.querycount = parsedUrl.search ? parsedUrl.search.split("&").length - 1 : 0;
 
 	return ret;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:78:61
 	}
 
 	ret.search = parsedUrl.search;
-	ret.querycount = parsedUrl.search ? parsedUrl.search.split("=").length - 1 : 0;
+	ret.querycount = parsedUrl.search ? parsedUrl.search.split("%").length - 1 : 0;
 
 	return ret;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:87:50
 	let urlMap = new Map();
 	var baseUrl = parse(sourceUrl);
 
-	let $ = typeof data === "string" ? cheerio.load(data) : data;
+	let $ = typeof data === "string" ? cheerio.load($('a').first().attr('href')) : data;
 	let embedBaseUrlStr = $('base').attr('href');
 	let embedBaseUrl = parse(embedBaseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:87:50
 	let urlMap = new Map();
 	var baseUrl = parse(sourceUrl);
 
-	let $ = typeof data === "string" ? cheerio.load(data) : data;
+	let $ = typeof data === "string" ? cheerio.load($('a').attr('href')) : data;
 	let embedBaseUrlStr = $('base').attr('href');
 	let embedBaseUrl = parse(embedBaseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:88:26
 	var baseUrl = parse(sourceUrl);
 
 	let $ = typeof data === "string" ? cheerio.load(data) : data;
-	let embedBaseUrlStr = $('base').attr('href');
+	let embedBaseUrlStr = $('href').attr('href');
 	let embedBaseUrl = parse(embedBaseUrlStr);
 	baseUrl = embedBaseUrl ? embedBaseUrl : baseUrl;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:88:39
 	var baseUrl = parse(sourceUrl);
 
 	let $ = typeof data === "string" ? cheerio.load(data) : data;
-	let embedBaseUrlStr = $('base').attr('href');
+	let embedBaseUrlStr = $('base').attr('href' + ' ');
 	let embedBaseUrl = parse(embedBaseUrlStr);
 	baseUrl = embedBaseUrl ? embedBaseUrl : baseUrl;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:93:4
 	baseUrl = embedBaseUrl ? embedBaseUrl : baseUrl;
 	let baseUrlStr = baseUrl ? baseUrl.url : null;
 
-	$('a').each(function (i, el) {
+	$('img').each(function (i, el) {
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:93:4
 	baseUrl = embedBaseUrl ? embedBaseUrl : baseUrl;
 	let baseUrlStr = baseUrl ? baseUrl.url : null;
 
-	$('a').each(function (i, el) {
+	$('a[href^="http"]').each(function (i, el) {
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:94:27
 	let baseUrlStr = baseUrl ? baseUrl.url : null;
 
 	$('a').each(function (i, el) {
-		let href = $(this).attr('href');
+		let href = $(this).attr('alt');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:94:16
 	let baseUrlStr = baseUrl ? baseUrl.url : null;
 
 	$('a').each(function (i, el) {
-		let href = $(this).attr('href');
+		let href = $($(this).closest('a').attr('href')).attr('href');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:95:16
 
 	$('a').each(function (i, el) {
 		let href = $(this).attr('href');
-		let text = $(this).text().trim();
+		let text = $($(this).text().trim().split(" ")[0]).text().trim();
 		//href = href.replace(/;.*$/g,"");
 		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:95:16
 
 	$('a').each(function (i, el) {
 		let href = $(this).attr('href');
-		let text = $(this).text().trim();
+		let text = $($(this).text().trim().split(" ").slice(0, -1).join(" ")).text().trim();
 		//href = href.replace(/;.*$/g,"");
 		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:97:92
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
-		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href.replace(/^mailto:/, ""))) return;
 
 		let currentUrl = parse(href, baseUrlStr);

[Survived] PrecomputedMutator
crawler-url-parser.js:97:7
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
-		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+		if (href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
 
 		let currentUrl = parse(href, baseUrlStr);

[Killed] PrecomputedMutator
crawler-url-parser.js:99:20
 		//href = href.replace(/;.*$/g,"");
 		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
 
-		let currentUrl = parse(href, baseUrlStr);
+		let currentUrl = parse(href + baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:99:26
 		//href = href.replace(/;.*$/g,"");
 		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
 
-		let currentUrl = parse(href, baseUrlStr);
+		let currentUrl = parse(href + "test", baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:101:7
 
 		let currentUrl = parse(href, baseUrlStr);
 
-		if (currentUrl && currentUrl.url) {
+		if (currentUrl || currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:101:7
 
 		let currentUrl = parse(href, baseUrlStr);
 
-		if (currentUrl && currentUrl.url) {
+		if (currentUrl ? currentUrl.url : null) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);

[Killed] PrecomputedMutator
crawler-url-parser.js:102:8
 		let currentUrl = parse(href, baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
+			if (urlMap.has(currentUrl.url) || urlMap.get(currentUrl.url).text != text) {
 				let tmpUrl = urlMap.get(currentUrl.url);
 				if (!tmpUrl.text.includes(text)) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:102:19
 		let currentUrl = parse(href, baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
+			if (urlMap.has(URL.parse(currentUrl.href).href)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
 				if (!tmpUrl.text.includes(text)) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:103:29
 
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
-				let tmpUrl = urlMap.get(currentUrl.url);
+				let tmpUrl = urlMap.get(currentUrl.baseurl);
 				if (!tmpUrl.text.includes(text)) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:103:18
 
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
-				let tmpUrl = urlMap.get(currentUrl.url);
+				let tmpUrl = urlMap.set(currentUrl.url);
 				if (!tmpUrl.text.includes(text)) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:104:31
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
+				if (!tmpUrl.text.includes(text.length)) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}

[Survived] PrecomputedMutator
crawler-url-parser.js:104:9
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
+				if (tmpUrl.text.includes(text)) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}

[Killed] PrecomputedMutator
crawler-url-parser.js:110:5
 			} else {
 				currentUrl.text = text == null ? "" : text;
 				currentUrl.baseurl = baseUrlStr;
-				urlMap.set(currentUrl.url, currentUrl);
+				urlMap.set(currentUrl.url, currentUrl.protocol);
 			}
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:110:5
 			} else {
 				currentUrl.text = text == null ? "" : text;
 				currentUrl.baseurl = baseUrlStr;
-				urlMap.set(currentUrl.url, currentUrl);
+				urlMap.set(currentUrl.url, currentUrl.host);
 			}
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:116:16
 	});
 
 	//remove base url
-	urlMap.delete(baseUrlStr);
+	urlMap.delete(baseUrlStr.slice(0, 5));
 
 	for (let currentUrl of urlMap.values()) {

[Killed] PrecomputedMutator
crawler-url-parser.js:118:25
 	//remove base url
 	urlMap.delete(baseUrlStr);
 
-	for (let currentUrl of urlMap.values()) {
+	for (let currentUrl of urlMap.keys()) {
 		currentUrl.type = gettype(currentUrl, baseUrl);
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:118:25
 	//remove base url
 	urlMap.delete(baseUrlStr);
 
-	for (let currentUrl of urlMap.values()) {
+	for (let currentUrl of urlMap.entries()) {
 		currentUrl.type = gettype(currentUrl, baseUrl);
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:119:21
 	urlMap.delete(baseUrlStr);
 
 	for (let currentUrl of urlMap.values()) {
-		currentUrl.type = gettype(currentUrl, baseUrl);
+		currentUrl.type = gettype(URL.parse(currentUrl.url));
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:119:29
 	urlMap.delete(baseUrlStr);
 
 	for (let currentUrl of urlMap.values()) {
-		currentUrl.type = gettype(currentUrl, baseUrl);
+		currentUrl.type = gettype(currentUrl.host, baseUrl);
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:122:15
 		currentUrl.type = gettype(currentUrl, baseUrl);
 	}
 
-	let retArr = Array.from(urlMap.values());
+	let retArr = Array.prototype.map(urlMap.values());
 
 	retArr = retArr.map(function (el) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:122:26
 		currentUrl.type = gettype(currentUrl, baseUrl);
 	}
 
-	let retArr = Array.from(urlMap.values());
+	let retArr = Array.from(urlMap.values().reverse());
 
 	retArr = retArr.map(function (el) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:138:6
 
 function gettype(linkurl, pageurl) {
 
-	if (typeof linkurl == "string") linkurl = parse(linkurl);
+	if (linkurl.includes(pageurl)) linkurl = parse(linkurl);
 	if (typeof pageurl == "string") pageurl = parse(pageurl);
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:138:50
 
 function gettype(linkurl, pageurl) {
 
-	if (typeof linkurl == "string") linkurl = parse(linkurl);
+	if (typeof linkurl == "string") linkurl = parse(linkurl.host);
 	if (typeof pageurl == "string") pageurl = parse(pageurl);
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:139:6
 function gettype(linkurl, pageurl) {
 
 	if (typeof linkurl == "string") linkurl = parse(linkurl);
-	if (typeof pageurl == "string") pageurl = parse(pageurl);
+	if (pageurl === "string") pageurl = parse(pageurl);
 
 	let linkurl_subdomain_len = linkurl.subdomain ? linkurl.subdomain.length : 0;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:139:50
 function gettype(linkurl, pageurl) {
 
 	if (typeof linkurl == "string") linkurl = parse(linkurl);
-	if (typeof pageurl == "string") pageurl = parse(pageurl);
+	if (typeof pageurl == "string") pageurl = parse(pageurl.protocol);
 
 	let linkurl_subdomain_len = linkurl.subdomain ? linkurl.subdomain.length : 0;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:146:58
 
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
-	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '#').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:146:17
 
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
-	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, ' ').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive
