[Survived] PrecomputedMutator
crawler-url-parser.js:147:38
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
-	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/g, '/').replace(/\/default\.[a-z]+$/, '/');
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {

[Survived] PrecomputedMutator
crawler-url-parser.js:147:58
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
-	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '').replace(/\/default\.[a-z]+$/, '/');
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {

[Killed] PrecomputedMutator
crawler-url-parser.js:149:41
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
-	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
+	let linkurl_parts = linkurl_path.split("\\").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:149:41
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
-	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
+	let linkurl_parts = linkurl_path.split("\\/").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:152:41
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
-	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
+	let pageurl_parts = pageurl_path.split(" ").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:156:6
 		return elem.length > 0
 	});
 
-	if (pageurl.host == linkurl.host) {
+	if (pageurl.host.includes(linkurl.host)) {
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:156:6
 		return elem.length > 0
 	});
 
-	if (pageurl.host == linkurl.host) {
+	if (pageurl.host.indexOf(linkurl.host) >= 0) {
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:160:7
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
-		if (part_count_diff == 0) {
+		if (part_count_diff != 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:160:7
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
-		if (part_count_diff == 0) {
+		if (part_count_diff > 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:161:77
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
 		if (part_count_diff == 0) {
-			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "/");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:161:77
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
 		if (part_count_diff == 0) {
-			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "#");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:162:77
 
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "/");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:162:77
 
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "#");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:163:8
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+			if (linkurl_without_last_part !== pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:163:8
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+			if (linkurl_without_last_part === pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";

[Killed] PrecomputedMutator
crawler-url-parser.js:164:14
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
-		} else if (part_count_diff == 1) {
+		} else if (part_count_diff != 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:164:14
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
-		} else if (part_count_diff == 1) {
+		} else if (part_count_diff > 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:165:8
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+			if (linkurl_path.endsWith(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:165:30
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+			if (linkurl_path.includes(pageurl_path.split("/").shift())) return "sublevel";
 		} else if (part_count_diff == -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:166:14
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
+		} else if (part_count_diff > -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:166:14
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
+		} else if (part_count_diff < -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:167:8
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+			if (pageurl_path.endsWith(linkurl_path)) return "uplevel";
 		}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:167:8
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+			if (pageurl_path.indexOf(linkurl_path)) return "uplevel";
 		}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:171:13
 		}
 
 		return "internal";
-	} else if (linkurl.domain == pageurl.domain) {
+	} else if (linkurl.domain.length != pageurl.domain.length) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
 		return "subdomain";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:171:13
 		}
 
 		return "internal";
-	} else if (linkurl.domain == pageurl.domain) {
+	} else if (linkurl.domain != pageurl.domain) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
 		return "subdomain";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:172:7
 
 		return "internal";
 	} else if (linkurl.domain == pageurl.domain) {
-		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+		if (linkurl_subdomain_len > pageurl_subdomain_len) return "updomain";
 		return "subdomain";
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Killed] PrecomputedMutator
crawler-url-parser.js:172:7
 
 		return "internal";
 	} else if (linkurl.domain == pageurl.domain) {
-		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+		if (linkurl_subdomain_len != pageurl_subdomain_len) return "updomain";
 		return "subdomain";
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive

[Survived] PrecomputedMutator
crawler-url-parser.js:185:5
 
 
 //for testing purpose
-if (!module.parent) {
+if (module.parent) {
 	console.log("for testing purpose");
 	//getlevel("www.domain.com/aaa/bbb/","www.domain.com/aaa/bbb/ccc");

[Survived] PrecomputedMutator
crawler-url-parser.js:185:5
 
 
 //for testing purpose
-if (!module.parent) {
+if (module.id) {
 	console.log("for testing purpose");
 	//getlevel("www.domain.com/aaa/bbb/","www.domain.com/aaa/bbb/ccc");

[Survived] PrecomputedMutator
crawler-url-parser.js:205:18
 
 
 	let url = "https ://www.npmjs.com/package/electron-window-manager";
-	let res = parse(url);
+	let res = parse(url.replace("www.", ""));
 	debugger;
 

[Survived] PrecomputedMutator
crawler-url-parser.js:205:18
 
 
 	let url = "https ://www.npmjs.com/package/electron-window-manager";
-	let res = parse(url);
+	let res = parse(url.replace("https", "http"));
 	debugger;
 
