[Survived] PrecomputedMutator
src/AttributeMap.ts:23:13
-           if (attributes[key] != null) {
+           if (attributes[key] !== null && attributes[key] !== undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (!a || typeof a !== 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes !== null && newOp.attributes !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:174:28
-       return this.ops.filter(predicate);
+       return this.ops.filter((op, index) => predicate(op, index + 1));

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1].retain, newOp)

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(iter.peekLength()));

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(iter.peekLength() - 1));

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module !== 'undefined' && typeof module !== 'object') {

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             typeof nextOp.retain === 'object' && nextOp.retain !== undefined

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           typeof op.retain === 'number' || typeof op.retain === 'object' && op.retain !== null || typeof op.retain === 'function' && op.retain.call(this) !== undefined
