[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.dest is not a valid file path'));

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.slice(1));

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(path.basename(pathname).toLowerCase());

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest + 'foo')) {
