[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (object.latitude === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(2 * δ), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ / 2), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(sinθ, x);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance - 100, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude, this.latitude);
