[Survived] PrecomputedMutator
index.js:11:7
-     if (typeof options === 'string') {
+     if (options.length > 0) {

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.encoding)

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : 'null')

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.flag)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.mode)

[Survived] PrecomputedMutator
utils.js:5:10
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\r\n]/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/m, '')
