[Survived] PrecomputedMutator
sinks/drain.js:8:7
-     if (!done) {
+     if (typeof done !== 'function') {

[Survived] PrecomputedMutator
sinks/drain.js:8:7
-     if (!done) {
+     if (done.length === 0) {

[Survived] PrecomputedMutator
sinks/drain.js:34:15
-                 read(abort || true, done || function () {})
+                 read(abort || true, done || function (err) {
+     console.log(err);
+   })

[Survived] PrecomputedMutator
sinks/drain.js:52:26
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(!abort, cb || function () {})

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end === true ? null : sink)

[Survived] PrecomputedMutator
sources/infinite.js:5:26
-       if(end) return cb && cb(end)
+       if(end) return cb && cb || null(end)

[Survived] PrecomputedMutator
sources/once.js:7:14
-         return abortCb(cb, abort, onAbort)
+         return cb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort(null))

[Survived] PrecomputedMutator
sources/values.js:7:43
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort(null))

[Survived] PrecomputedMutator
sources/values.js:8:17
-         return cb(true)
+         return cb(array[i++])

[Survived] PrecomputedMutator
sources/values.js:16:8
-       if(abort)
+       if(abort && onAbort)

[Survived] PrecomputedMutator
throughs/flatten.js:16:15
-         else if(_read) nextChunk()
+         else if(_read && _read.length) nextChunk()

[Survived] PrecomputedMutator
throughs/map.js:7:6
-     if(!mapper) return id
+     if(!mapper.length) return id

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end && onEnd) once(end)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end && true)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end || false)

[Survived] PrecomputedMutator
pull.js:23:33
-         case 3: return pull(read, ref[0], ref[1], ref[2])
+         case 3: return pull(read, ref[Math.floor(Math.random() * length)], ref[1], ref[2])

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[0] * 2, ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:24:49
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[1] + ref[2], ref[3])
