[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in throughs.map(function (through) {
+  return through.isBuggy ? null : through;
+}))
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4334611/test/abort-stalled.js:65
test('through', pull.through())
                     ^

[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in sinks.slice(1))
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4334611/index.js:91
  for (var k in stryMutAct_9fa48("17") ? sinks.concat(sinks) : stryMutAct_9fa48("16") ? sinks.slice(1) : stryMutAct_9fa48("15") ? sinks.reverse() : (stryCov_9fa48("15", "16", "17"), sinks)) exports[k] = sinks[k];

[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in sinks.concat(sinks))
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4334611/test/abort-stalled.js:54
      pull.drain(function (e) {
           ^
