[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (!args.length) {
         throw new TypeError("partial sink should only be called once!")
       }

[Survived] PrecomputedMutator
pull.js:21:33
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read, ref[Math.floor(Math.random() * length)])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Killed] PrecomputedMutator
pull.js:22:41
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(read, ref[0], ref[1] * 2)
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:41
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[0], ref[length - 1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (Object.prototype.toString.call(s) === '[object Function]') {
       read = s(read)
     } else if (s && typeof s === 'object') {

[Killed] PrecomputedMutator
pull.js:41:14
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s - 1(read)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && s.hasOwnProperty('sink')) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && s.constructor === Object) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:43:7
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink = read(read)
       read = s.source
     }
