[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (done.length === 0) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Survived] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(abort && false) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done(end === false ? null : end)) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done(end === true ? null : end)) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:28:17
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.trace(doneLackingErr)
                 throw end
               }

[Killed] PrecomputedMutator
sinks/drain.js:32:21
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === op(data) || !abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:32:40
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === op(0) || abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, done ? function () {} : function () {})
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(cbed || false) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
