[Killed] PrecomputedMutator
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(cb !== null)
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(cb.length === 0)
     cb = test, test = id
   else

[Killed] PrecomputedMutator
sinks/find.js:12:17
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = prop(test.foo) || id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:12:12
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = prop.bar(test) || id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:15:8
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(test(data) || true) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(ended === false) return //already called back
     cb(err === true ? null : err, null)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
