[Killed] PrecomputedMutator
sinks/on-end.js:6:10
 var drain = require('./drain')
 
 module.exports = function onEnd (done) {
-  return drain(null, done)
+  return drain(done, null)
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/on-end.js:6:10
 var drain = require('./drain')
 
 module.exports = function onEnd (done) {
-  return drain(null, done)
+  return drain(done())
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
