[Killed] PrecomputedMutator
sinks/reduce.js:8:11
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = acc = acc + data(acc, data)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(!end) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
