[Killed] PrecomputedMutator
sources/count.js:9:14
     if(end) return cb && cb(end)
     if(i > max)
       return cb(true)
-    cb(null, i++)
+    cb(null, i = 0)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
