[Killed] PrecomputedMutator
sources/infinite.js:5:26
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && cb && null(end)
     return cb(null, generate())
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/infinite.js:5:26
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && !cb(end)
     return cb(null, generate())
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4334611/sources/infinite.js:53
