[Survived] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(abort && value)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] PrecomputedMutator
sources/once.js:7:22
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(null, abort, onAbort)
     if(value != null) {
       var _value = value; value = null

[Survived] PrecomputedMutator
sources/once.js:7:14
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, onAbort, abort)
     if(value != null) {
       var _value = value; value = null
