[Survived] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.length === 0)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:43
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return abortCb(cb, abort, onAbort.bind(null))
       return cb(true)
     }

[Killed] PrecomputedMutator
sources/values.js:10:7
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!typeof array !== 'object'(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.slice(0)).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.filter(function (x) {
+  return x !== undefined;
+})).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort || onAbort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort && onAbort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)

[Killed] PrecomputedMutator
sources/values.js:17:26
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, abort + 1, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i === array.length - 1)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
