[Survived] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map == null) return id
   map = prop(map)
   var busy = false, abortCb, aborted

[Killed] PrecomputedMutator
throughs/async-map.js:23:19
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else cb(abort())
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end || data) cb(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4334611/test/async-map.js:34
    if(!end) throw new Error('expected read to end')
             ^

[Timeout] PrecomputedMutator
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end ? data : null) cb(end)
           else if(aborted) cb(aborted)
           else {

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(aborted && err) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb(false)
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:34
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(err) next (0, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
