[Killed] PrecomputedMutator
throughs/filter-not.js:8:17
 
 module.exports = function filterNot (test) {
   test = tester(test)
-  return filter(function (data) { return !test(data) })
+  return filter(function (data) {
+  return test(data) ? data : !test(data);
+})
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
