[Killed] PrecomputedMutator
throughs/flatten.js:14:14
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(cb, abort)
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:16:15
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(_read && _read.length === 0) nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'function' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'function' === typeof stream.value)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:22
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = stream.values(stream)
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:22
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = stream.once(stream)
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if (stream instanceof Function)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:41:11
           else if ('function' !== typeof stream)
             stream = once(stream)
           _read = stream
-          nextChunk()
+          undefined()
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
