[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(!end)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(end && true)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(undefined)
         cb(end, data)
       })
