[Killed] PrecomputedMutator
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop.foo(field) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop.bar(field) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
