[Survived] PrecomputedMutator
src/matcher.ts:89:13
-       flatten(true)
+       flatten(parts.length === 0)

[Survived] PrecomputedMutator
src/matcher.ts:92:22
-     for (const part of spec.split('/').slice(1).reverse()) {
+     for (const part of spec.split('/').slice(1).reverse().map(part => part.toLowerCase())) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:.{1}/) !== null) {

[Survived] PrecomputedMutator
src/policy.ts:49:11
-         if (rule.matches(path, ctx)) {
+         if (rule.matches(path, ctx, 1)) {

[Survived] PrecomputedMutator
src/policy.ts:49:11
-         if (rule.matches(path, ctx)) {
+         if (rule.matches(path, ctx, path)) {

[Survived] PrecomputedMutator
src/rule.ts:25:24
-       for (const verb of verbs) {
+       for (const verb of verbs.filter(verb => verb !== 'GET')) {

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.filter(v => v !== 'GET')) {
