[Survived] PrecomputedMutator
src/Delta.ts:178:22
-       this.ops.forEach(predicate);
+       this.ops.forEach((op, index) => {
+     if (index % 2 === 0) {
+       return predicate(op, index);
+     } else {
+       return !predicate(op, index);
+     }
+   });

[Survived] PrecomputedMutator
src/Delta.ts:178:22
-       this.ops.forEach(predicate);
+       this.ops.forEach((op, index) => {
+     if (index === 0) {
+       return predicate(op, index);
+     } else {
+       return !predicate(op, index - 1);
+     }
+   });

[Survived] PrecomputedMutator
src/Delta.ts:199:28
-       return this.ops.reduce(predicate, initialValue);
+       return this.ops.reduce((op, index) => predicate(op, index), initialValue);

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes == 0

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               !otherIter.hasNext() && delta.ops.length > 0

[Survived] PrecomputedMutator
src/Delta.ts:355:24
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0].toLowerCase(), strings[1].toLowerCase(), cursor);

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.hasNext() || iter.peekType() === 'insert') {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain && op.attributes && op.retain) {

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData, 0) },

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData, -1) },

[Survived] PrecomputedMutator
src/Delta.ts:465:49
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData.slice()) },

[Survived] PrecomputedMutator
src/Delta.ts:465:49
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData.concat()) },
