[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('The options.dest is invalid'));

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.replace(' ', ''))) {

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(decodeURIComponent(path.basename(options.url)));

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(path.basename(options.dest))) {
