[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data.replace('foo', 'bar'), options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.replacer)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.space)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow && true) {

[Survived] PrecomputedMutator
index.js:76:15
-     const str = stringify(obj, options)
+     const str = stringify(obj, options, 'invalid')

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.flag)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.mode)

[Survived] PrecomputedMutator
utils.js:3:30
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj.valueOf(), replacer, spaces)
