[Survived] PrecomputedMutator
src/policymap.ts:13:16
-         this.set(policy.name, policy)
+         this.set(policy.name.split('.')[0], policy)

[Survived] PrecomputedMutator
src/rule.ts:50:9
-       if (this.matches(path, ctx) && verb in this.verbs) {
+       if (this.matches(path.substring(this.regex.lastIndex), ctx) && verb in this.verbs) {

[Survived] PrecomputedMutator
src/rule.ts:66:11
-         if (ctx === undefined) {
+         if (ctx == undefined) {
