[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (timezone == null) return null;

[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (!timezone || timezone.length === 0) return null;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.ceil(min))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.abs(min))}`;

[Survived] PrecomputedMutator
src/index.js:5:36
-   const totalTimezones = Object.keys(data.timezones).length;
+   const totalTimezones = Object.keys(data.countries).length;

[Survived] PrecomputedMutator
src/index.js:45:42
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options.deprecated ? options : {}));
