[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (a === null || a === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b instanceof Array) {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode("hello"); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:23:7
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b !== 'object' || b === null || b === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:174:28
-       return this.ops.filter(predicate);
+       return this.ops.filter((op, index) => predicate(op));

[Survived] PrecomputedMutator
src/Delta.ts:240:24
-       const firstOther = otherIter.peek();
+       const firstOther = otherIter.peekLength();

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekType() === 'retain'

[Survived] PrecomputedMutator
src/Delta.ts:368:41
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, otherIter.peekLength() + 1);

[Survived] PrecomputedMutator
src/Delta.ts:429:9
-       if (line.length() > 0) {
+       if (line.length() != 0) {

[Survived] PrecomputedMutator
src/Delta.ts:480:14
-         return this.transformPosition(arg, priority);
+         return this.transformPosition(arg, priority * 2);

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(thisIter.peekLength() + 1)));

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(thisIter.peekLength() - 1)));

[Survived] PrecomputedMutator
src/OpIterator.ts:19:9
-       if (!length) {
+       if (typeof length !== 'number') {
