[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type !== 'Point' && point.coordinates.length === 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance - 1000) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance + 1000) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude - point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, {});

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(GeoPoint.fromLatLngArray([0, 0]), point);
