[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : 0)

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.length > 0) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.toString() !== '[object Buffer]') content = content.toString('utf8')
