[Survived] PrecomputedMutator
src/matcher.ts:29:9
-       if (spec.match(/^.+\/$/) !== null) {
+       if (spec.match(/^.+\/$/) !== null && spec.match(/^.+\/$/) !== undefined && spec.match(/^.+\/$/) !== false) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('\\\\')) {

[Survived] PrecomputedMutator
src/matcher.ts:65:11
-         if (final && opt && min < 1) {
+         if (final && opt && min == 0) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/^:.+/) !== null) {

[Survived] PrecomputedMutator
src/policymap.ts:12:26
-       for (const policy of policies) {
+       for (const policy of policies.filter(policy => policy.name !== 'policy')) {

[Survived] PrecomputedMutator
src/policymap.ts:30:28
-         ? policy.query(path, verb, ctx)
+         ? policy.query(path, verb.split(' ')[0], ctx)
