[Survived] PrecomputedMutator
src/build-country.js:5:7
-     if (!name) return null;
+     if (name === undefined) return null;

[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (result[country] === undefined) Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/build-country.js:33:60
-         if (tz.r === undefined) result[country].current.push(id);
+         if (tz.r === undefined) result[country].current.push(tz.r || id);

[Survived] PrecomputedMutator
src/build-timezone.js:30:17
-     const hours = Math.floor(offset / 60);
+     const hours = Math.ceil(offset / 60);

[Survived] PrecomputedMutator
src/build-timezone.js:30:17
-     const hours = Math.floor(offset / 60);
+     const hours = Math.round(offset / 60);

[Survived] PrecomputedMutator
src/build-timezone.js:30:28
-     const hours = Math.floor(offset / 60);
+     const hours = Math.floor(offset / 60.0);

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(min * 2)}`;

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, null) });

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, {}) });

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, {
+     id: 'invalid'
+   }) });

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones + 1) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones - 1) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones * 2) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (countries[id] === undefined) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:23:40
-     return deliverCountry(countries[id], options);
+     return deliverCountry(countries[id], options.deprecated ? options : null);

[Survived] PrecomputedMutator
src/index.js:27:7
-     if (!country) return;
+     if (country === null) return;

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (timezones[name] === undefined) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, true));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, false));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(timezones).length).length;

[Survived] PrecomputedMutator
src/index.js:45:39
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c.toUpperCase(), options));

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, 1);

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, null);

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, {
+     deprecated: true
+   });

[Survived] PrecomputedMutator
src/index.js:49:50
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options.deprecated = false);

[Survived] PrecomputedMutator
src/index.js:49:50
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options.deprecated = !options.deprecated);

[Survived] PrecomputedMutator
src/index.js:55:7
-     if (!country) return null;
+     if (country === null) return null;
