[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (a === 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:5
-       for (const key in a) {
-         if (a[key] !== undefined && b[key] === undefined) {
-           attributes[key] = a[key];
-         }
-       }
+       for (const key in a || key in b) {
+     if (a[key] !== undefined && b[key] === undefined) {
+       attributes[key] = a[key];
+     }
+   }

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (!a) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (!b) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:50:13
-           if (!isEqual(a[key], b[key])) {
+           if (!isEqual(a[key], b[key]) && a[key] !== b[key]) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (Object.prototype.toString.call(b) !== '[object Object]') {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode('a'); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && Array.isArray(ops.ops) && ops.ops.length > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:167:9
-       if (lastOp && typeof lastOp.retain === 'number' && !lastOp.attributes) {
+       if (lastOp && typeof lastOp.retain === 'number' && lastOp.attributes === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:178:5
-       this.ops.forEach(predicate);
+       this.ops.map(predicate);

[Survived] PrecomputedMutator
src/Delta.ts:178:5
-       this.ops.forEach(predicate);
+       this.ops.filter(predicate);

[Survived] PrecomputedMutator
src/Delta.ts:240:24
-       const firstOther = otherIter.peek();
+       const firstOther = otherIter.hasNext();

[Survived] PrecomputedMutator
src/Delta.ts:240:24
-       const firstOther = otherIter.peek();
+       const firstOther = otherIter.rest();

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft && thisIter.peekLength() > 0

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft && thisIter.peekLength() !== 0

[Survived] PrecomputedMutator
src/Delta.ts:252:18
-           ops.push(thisIter.next());
+           ops.push(thisIter.next(thisIter.peekLength()));

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekLength() < 0

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.slice(1, 2));

[Survived] PrecomputedMutator
src/Delta.ts:355:24
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], cursor - 1);

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], cursor + 2);

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (op.retain !== null) {

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (op.retain !== 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:466:11
-             AttributeMap.invert(op.attributes, baseOp.attributes),
+             AttributeMap.diff(op.attributes, baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               typeof thisData === 'object' && thisData !== null && typeof otherData === 'object' && otherData !== null && thisData.length === otherData.length

[Survived] PrecomputedMutator
src/Delta.ts:518:48
-                 const handler = Delta.getHandler(embedType);
+                 const handler = Delta.getHandler(embedType.toLowerCase());

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module === 'function') {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'number') {
