[Survived] PrecomputedMutator
lib/request.js:10:11
-         if (res.statusCode !== 200) {
+         if (res.statusCode === 404) {

[Survived] PrecomputedMutator
lib/request.js:10:11
-         if (res.statusCode !== 200) {
+         if (res.statusCode !== 200 && res.statusCode !== 201) {

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     flags: 'w'
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + 'file.txt'))

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.split('.')[0])) {
