[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude === Infinity || longitude === Infinity) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 90 || longitude < -180 || longitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 90 || longitude < -180 || longitude > 180 || radius < 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 90 || longitude < -180 || longitude > 180 || radius < 0 || radius > 10000000) {

[Survived] PrecomputedMutator
src/geo-point.ts:76:33
-       return this.fromLngLatArray(point.coordinates);
+       return this.fromLngLatArray(point.coordinates.concat(point.coordinates));

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (typeof object === 'undefined') {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (object.latitude + object.longitude === 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:124:15
-       const y = sin(Δλ) * cos(φ2);
+       const y = asin(Δλ) * cos(φ2);

[Survived] PrecomputedMutator
src/geo-point.ts:143:15
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = String(distance) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:15
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Boolean(distance) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance - 100) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance + 100) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance + 100, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(point, this.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateDistance(this, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, undefined);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, 0);
