[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : function () {})

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : "null")

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, 1)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, null)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, undefined)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow !== false) {
