[Survived] PrecomputedMutator
sinks/drain.js:14:8
-       if(abort) return sink.abort()
+       if(abort && end) return sink.abort()

[Survived] PrecomputedMutator
sinks/drain.js:32:21
-               else if(op && false === op(data) || abort) {
+               else if(op && false === op(data) || abort === true) {

[Survived] PrecomputedMutator
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(abort === true, done || function () {})

[Survived] PrecomputedMutator
sinks/drain.js:52:33
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function () {
+     return null;
+   })

[Survived] PrecomputedMutator
sinks/find.js:21:8
-       if(ended) return //already called back
+       if(ended && true) return //already called back

[Survived] PrecomputedMutator
sinks/on-end.js:6:16
-     return drain(null, done)
+     return drain([], done)

[Survived] PrecomputedMutator
sinks/reduce.js:6:6
-     if(!cb) cb = acc, acc = null
+     if(typeof cb !== 'function') cb = acc, acc = null

[Survived] PrecomputedMutator
sources/infinite.js:5:26
-       if(end) return cb && cb(end)
+       if(end) return cb && cb || end(end)

[Survived] PrecomputedMutator
sources/infinite.js:6:21
-       return cb(null, generate())
+       return cb(null, generate(cb))

[Survived] PrecomputedMutator
sources/values.js:7:43
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort.bind(this))

[Survived] PrecomputedMutator
sources/values.js:10:21
-     if(!Array.isArray(array))
+     if(!Array.isArray(array[i]))

[Survived] PrecomputedMutator
throughs/async-map.js:7:6
-     if(!map) return id
+     if(map.length === 1) return id

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(busy && !aborted) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/async-map.js:38:23
-                 else if(err) next (err, cb)
+                 else if(err !== null) next (err, cb)

[Survived] PrecomputedMutator
throughs/async-map.js:39:23
-                 else cb(null, data)
+                 else cb(NaN, data)

[Survived] PrecomputedMutator
throughs/flatten.js:36:14
-             if(stream && 'object' === typeof stream)
+             if(stream && stream.constructor === Array)

[Survived] PrecomputedMutator
throughs/flatten.js:37:29
-               stream = values(stream)
+               stream = values(stream.slice())

[Survived] PrecomputedMutator
throughs/map.js:7:6
-     if(!mapper) return id
+     if(mapper.length === 0) return id

[Survived] PrecomputedMutator
throughs/map.js:8:17
-     mapper = prop(mapper)
+     mapper = prop(mapper.bind(null))

[Survived] PrecomputedMutator
throughs/take.js:19:26
-           last = false; cb(err || true)
+           last = false; cb(err === true)

[Survived] PrecomputedMutator
throughs/take.js:30:16
-               cb(ended)
+               cb(ended || !test(data))

[Survived] PrecomputedMutator
throughs/take.js:32:20
-             else if(!test(data)) {
+             else if(!test || data(data)) {

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end && false)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end || true)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end !== true)

[Survived] PrecomputedMutator
throughs/unique.js:12:21
-       var key = field(data)
+       var key = field(data - 1)

[Survived] PrecomputedMutator
util/abort-cb.js:3:14
-     onAbort && onAbort(abort === true ? null: abort)
+     onAbort && onAbort || abort(abort === true ? null: abort)

[Survived] PrecomputedMutator
util/prop.js:6:42
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data.key[0]); return v && v[0] }

[Survived] PrecomputedMutator
pull.js:23:22
-         case 3: return pull(read, ref[0], ref[1], ref[2])
+         case 3: return pull(read, ref[1], ref[0], ref[2])

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[3], ref[2])

[Survived] PrecomputedMutator
pull.js:27:33
-           return pull.apply(null, ref)
+           return pull.apply(null, ref.slice(0, -1))

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s.valueOf() === 'object') {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && s.constructor.name === 'Object') {
