[Killed] PrecomputedMutator
src/matcher.ts:12:9
   /** @param spec Path specification.
     * @param version Specification language version. */
   constructor (spec: string, version: '1' | '1.0' | '1.1' = '1.1') {
-    if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+    if (spec.replace(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:12:9
   /** @param spec Path specification.
     * @param version Specification language version. */
   constructor (spec: string, version: '1' | '1.0' | '1.1' = '1.1') {
-    if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+    if (spec.split(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:15:9
     if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
-    if (spec.match(/^\//) === null) {
+    if (spec.search(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:15:9
     if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
-    if (spec.match(/^\//) === null) {
+    if (spec.includes(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:18:9
     if (spec.match(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
-    if (spec.match(/\/\//) !== null) {
+    if (spec.replace(/\/\//) !== null) {
       throw new Error('Path contains empty segments')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:18:9
     if (spec.match(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
-    if (spec.match(/\/\//) !== null) {
+    if (spec.split(/\/\//) !== null) {
       throw new Error('Path contains empty segments')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:26:9
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')
     }
-    if (spec.match(/[^/]:|:\/|:$/) !== null) {
+    if (spec.split(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:26:9
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')
     }
-    if (spec.match(/[^/]:|:\/|:$/) !== null) {
+    if (spec.search(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:29:20
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
-    if (spec.match(/^.+\/$/) !== null) {
+    if (spec.match(/^.+\/(?!\/.*$)/) !== null) {
       throw new Error('Path must not end with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:29:20
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
-    if (spec.match(/^.+\/$/) !== null) {
+    if (spec.match(/^.+\/(?!$)/) !== null) {
       throw new Error('Path must not end with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:39:9
   }
 
   [Symbol.match] (string: string): RegExpMatchArray | null {
-    if (string.length > 1 && string.endsWith('/')) {
+    if (string.length > 0 && string.endsWith('/')) {
       return null
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:42:32
     if (string.length > 1 && string.endsWith('/')) {
       return null
     }
-    return super[Symbol.match](string)
+    return super[Symbol.match](string.substr(0, -1))
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:42:32
     if (string.length > 1 && string.endsWith('/')) {
       return null
     }
-    return super[Symbol.match](string)
+    return super[Symbol.match](string.slice(0, -1))
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:64:9
   let any = false
   let opt = true
   function flatten (final: boolean = false): void {
-    if (max > 0 || any) {
+    if (max > 0 || !any) {
       if (final && opt && min < 1) {
         min = 1
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:65:11
   let opt = true
   function flatten (final: boolean = false): void {
     if (max > 0 || any) {
-      if (final && opt && min < 1) {
+      if (final && opt && min > 1) {
         min = 1
       } else if (min > 0) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:65:11
   let opt = true
   function flatten (final: boolean = false): void {
     if (max > 0 || any) {
-      if (final && opt && min < 1) {
+      if (final && opt && min === 1) {
         min = 1
       } else if (min > 0) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:67:18
     if (max > 0 || any) {
       if (final && opt && min < 1) {
         min = 1
-      } else if (min > 0) {
+      } else if (min < 0) {
         opt = false
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:67:18
     if (max > 0 || any) {
       if (final && opt && min < 1) {
         min = 1
-      } else if (min > 0) {
+      } else if (max < 0) {
         opt = false
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:89:13
     any = false
   }
   function finalise (): string {
-    flatten(true)
+    flatten(max > 0)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher
    ✓ accepts valid paths (2 ms)

[Killed] PrecomputedMutator
src/matcher.ts:90:74
   }
   function finalise (): string {
     flatten(true)
-    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
+    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '\\\\')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:90:36
   }
   function finalise (): string {
     flatten(true)
-    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
+    return (opt ? '^/$|^' : '^') + parts.slice((acc, seg) => seg + acc, '$')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:92:44
     flatten(true)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
-  for (const part of spec.split('/').slice(1).reverse()) {
+  for (const part of spec.split('/').slice(-1).reverse()) {
     switch (part) {
       case '+':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:92:22
     flatten(true)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
-  for (const part of spec.split('/').slice(1).reverse()) {
+  for (const part of spec.split('/').slice(2).reverse()) {
     switch (part) {
       case '+':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:93:13
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
-    switch (part) {
+    switch (part.length) {
       case '+':
         min++
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:93:13
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
-    switch (part) {
+    switch (part.slice(0, -1)) {
       case '+':
         min++
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Survived] PrecomputedMutator
src/matcher.ts:111:13
       default:
         flatten()
         opt = false
-        if (part.match(/:.+/) !== null) {
+        if (part.match(/:.+/) !== null && part.match(/:.+/) !== undefined) {
           props.push(part.slice(1))
           parts.push('/([^/]+)')

[Killed] PrecomputedMutator
src/matcher.ts:112:22
         flatten()
         opt = false
         if (part.match(/:.+/) !== null) {
-          props.push(part.slice(1))
+          props.push(part.slice(-1))
           parts.push('/([^/]+)')
         } else {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:112:22
         flatten()
         opt = false
         if (part.match(/:.+/) !== null) {
-          props.push(part.slice(1))
+          props.push(part.slice(2))
           parts.push('/([^/]+)')
         } else {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:115:39
           props.push(part.slice(1))
           parts.push('/([^/]+)')
         } else {
-          parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+          parts.push(`/${part.replace(/([^.$])/g, '\\$1')}`)
         }
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] PrecomputedMutator
src/matcher.ts:115:26
           props.push(part.slice(1))
           parts.push('/([^/]+)')
         } else {
-          parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+          parts.push(`/${part.replace(/([.$])/g, '\\$2')}`)
         }
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher
