[Killed] PrecomputedMutator
src/policymap.ts:7:24
 /** Queryable collection of policy documents. */
 export class PolicyMap extends Map<string, Policy> implements QueryableMap {
   constructor (...policies: Policy[]) {
-    super(policies.map((policy) => [policy.name, policy]))
+    super(policies.map(policy => [policy.name, null]))
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:7:24
 /** Queryable collection of policy documents. */
 export class PolicyMap extends Map<string, Policy> implements QueryableMap {
   constructor (...policies: Policy[]) {
-    super(policies.map((policy) => [policy.name, policy]))
+    super(policies.map(policy => [policy.name, policy.name.toUpperCase()]))
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:12:5
 
   /** Add policies to colllection. */
   push (...policies: Policy[]): this {
-    for (const policy of policies) {
-      this.set(policy.name, policy)
-    }
+    for (const policy of policies.entries()) {
+  this.set(policy.name, policy);
+}
     return this
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:12:5
 
   /** Add policies to colllection. */
   push (...policies: Policy[]): this {
-    for (const policy of policies) {
-      this.set(policy.name, policy)
-    }
+    for (const policy of policies.keys()) {
+  this.set(policy.name, policy);
+}
     return this
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:13:16
   /** Add policies to colllection. */
   push (...policies: Policy[]): this {
     for (const policy of policies) {
-      this.set(policy.name, policy)
+      this.set(policy.name.length, policy)
     }
     return this
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:13:29
   /** Add policies to colllection. */
   push (...policies: Policy[]): this {
     for (const policy of policies) {
-      this.set(policy.name, policy)
+      this.set(policy.name, null)
     }
     return this
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:28:20
     *          `null` if the combination of policy, path and
     *          action is not governed by this collection. */
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
-    const policy = this.get(name)
+    const policy = this.set(name)
     return policy !== undefined
       ? policy.query(path, verb, ctx)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:28:20
     *          `null` if the combination of policy, path and
     *          action is not governed by this collection. */
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
-    const policy = this.get(name)
+    const policy = this.has(name)
     return policy !== undefined
       ? policy.query(path, verb, ctx)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:30:9
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
     const policy = this.get(name)
     return policy !== undefined
-      ? policy.query(path, verb, ctx)
+      ? policy.query(path, verb, ctx.child)
       : null
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:30:28
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
     const policy = this.get(name)
     return policy !== undefined
-      ? policy.query(path, verb, ctx)
+      ? policy.query(path, verb.toUpperCase(), ctx)
       : null
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:39:29
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
   matches (name: string, path: string, ctx?: QueryContext): boolean {
-    const policy = this.get(name)
+    const policy = this.get(null)
     return policy !== undefined
       ? policy.matches(path, ctx)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:39:29
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
   matches (name: string, path: string, ctx?: QueryContext): boolean {
-    const policy = this.get(name)
+    const policy = this.get("invalid")
     return policy !== undefined
       ? policy.matches(path, ctx)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:41:30
   matches (name: string, path: string, ctx?: QueryContext): boolean {
     const policy = this.get(name)
     return policy !== undefined
-      ? policy.matches(path, ctx)
+      ? policy.matches(path, ctx.name)
       : false
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] PrecomputedMutator
src/policymap.ts:41:24
   matches (name: string, path: string, ctx?: QueryContext): boolean {
     const policy = this.get(name)
     return policy !== undefined
-      ? policy.matches(path, ctx)
+      ? policy.matches(path.split('/')[0], ctx)
       : false
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap
