[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap == null) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/index.js:18:10
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, options.deprecated ? options : options.deprecated);
