[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (!a) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:21:9
-       if (!keepNull) {
+       if (!keepNull === true) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:21:9
-       if (!keepNull) {
+       if (keepNull !== true) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:34:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.values(attributes)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:34:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.entries(attributes)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (!b || typeof b !== 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (b == null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (!b) {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode("a"); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:51:9
-       if (!handler) {
+       if (handler == null) {

[Survived] PrecomputedMutator
src/Delta.ts:51:9
-       if (!handler) {
+       if (!handler || handler.length === 0) {

[Survived] PrecomputedMutator
src/Delta.ts:60:9
-       if (Array.isArray(ops)) {
+       if (Array.isArray(ops) && ops.length > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (arg === '') {

[Survived] PrecomputedMutator
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (arg.length === 0) {

[Survived] PrecomputedMutator
src/Delta.ts:99:9
-       if (typeof length === 'number' && length <= 0) {
+       if (length <= 0) {

[Survived] PrecomputedMutator
src/Delta.ts:223:12
-       while (index < end && iter.hasNext()) {
+       while (index != end && iter.hasNext()) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               delta.ops.length === 0

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(length + 1));

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(length * 2));

[Survived] PrecomputedMutator
src/Delta.ts:368:24
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, otherIter.peekLength() - 1);

[Survived] PrecomputedMutator
src/Delta.ts:465:26
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData.reverse()) },

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.transform(thisData[embedType], otherData[embedType], true)) {

[Survived] PrecomputedMutator
src/Delta.ts:555:35
-           index -= Math.min(length, index - offset);
+           index -= Math.min(length, Math.abs(index - offset));

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (op.retain !== null && typeof op.retain === 'object') {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (op.retain !== null && typeof op.retain === 'object' && op.retain.constructor === Object) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.ops.length === 0) {
