[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (options.dest === null) {

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest + 'foo')) {

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.toUpperCase())) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.substring(1));

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.toLowerCase());

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest) && path.isAbsolute(options.url)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.dest) || path.isAbsolute(options.url)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(path.dirname(options.dest))) {
