[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type !== 'Point' && point.type !== 'LineString') {

[Survived] PrecomputedMutator
src/geo-point.ts:149:36
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = acos(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(θ / 2);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(sin(θ), x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, Math.random());

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing - 180);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, null);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, undefined);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, {
+     longitude: 0
+   });
