[Survived] PrecomputedMutator
src/matcher.ts:42:32
-       return super[Symbol.match](string)
+       return super[Symbol.match](string.replace(/^/, ''))

[Survived] PrecomputedMutator
src/matcher.ts:93:13
-       switch (part) {
+       switch (part.slice(0)) {

[Survived] PrecomputedMutator
src/matcher.ts:115:50
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([.$])/g, '\\$&')}`)

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.concat(["newVerb"])) {

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.filter(verb => verb !== "deniedVerb")) {

[Survived] PrecomputedMutator
src/rule.ts:50:9
-       if (this.matches(path, ctx) && verb in this.verbs) {
+       if (this.matches(path, ctx) && verb in this.verbs && this.regex.test(path)) {

[Survived] PrecomputedMutator
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (prop === undefined || match[index + 1] !== prop.toString()) {

[Survived] PrecomputedMutator
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (prop === undefined || match[index + 1] !== prop.valueOf()) {
