[Survived] PrecomputedMutator
src/build-country.js:32:43
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (!result[country]) Object.assign(result[country] = {
+     current: [],
+     all: []
+   }, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/index.js:5:36
-   const totalTimezones = Object.keys(data.timezones).length;
+   const totalTimezones = Object.keys(Object.keys(data.timezones).reverse()).length;

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, true));

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, false));

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, null));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(data.timezones).length + 1).length;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(data.timezones).length - 1).length;
