[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b === NaN) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (!Object.prototype.toString.call(a).includes('Object')) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:64:11
-         if (base[key] !== attr[key] && attr[key] !== undefined) {
+         if (base[key] !== attr[key] && attr[key] !== undefined && base[key] !== undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (b?.constructor?.name !== 'Object') {

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && ops.ops.length > 0 && Array.isArray(ops.ops)) {

[Survived] PrecomputedMutator
src/Delta.ts:62:45
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && Array.isArray(ops.ops.slice(0))) {

[Survived] PrecomputedMutator
src/Delta.ts:99:9
-       if (typeof length === 'number' && length <= 0) {
+       if (!length) {

[Survived] PrecomputedMutator
src/Delta.ts:146:11
-             typeof newOp.retain === 'number' &&
-             typeof lastOp.retain === 'number'
+             typeof newOp.retain === 'number' && typeof lastOp.retain === 'number' && newOp.retain > 0

[Survived] PrecomputedMutator
src/Delta.ts:146:11
-             typeof newOp.retain === 'number' &&
-             typeof lastOp.retain === 'number'
+             typeof newOp.retain === 'number' && typeof lastOp.retain === 'number' && lastOp.retain > 0

[Survived] PrecomputedMutator
src/Delta.ts:167:9
-       if (lastOp && typeof lastOp.retain === 'number' && !lastOp.attributes) {
+       if (lastOp && typeof lastOp.retain === 'number' && lastOp.attributes == null) {

[Survived] PrecomputedMutator
src/Delta.ts:252:18
-           ops.push(thisIter.next());
+           ops.push(thisIter.next(1000));

[Survived] PrecomputedMutator
src/Delta.ts:368:24
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, Math.max(thisIter.peekLength(), otherIter.peekLength()));

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (JSON.stringify(thisOp.insert) === JSON.stringify(otherOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.hasNext() && iter.peekType() !== 'retain') {

[Survived] PrecomputedMutator
src/Delta.ts:430:27
-         predicate(line, {}, i);
+         predicate(line, {}, i++);

[Survived] PrecomputedMutator
src/Delta.ts:516:43
-               const embedType = Object.keys(thisData)[0];
+               const embedType = Object.keys(thisData.valueOf())[0];

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.transform(otherData[embedType], thisData[embedType], !priority)) {

[Survived] PrecomputedMutator
src/OpIterator.ts:48:20
-           } else if (typeof nextOp.insert === 'string') {
+           } else if (typeof nextOp.insert !== 'object') {
