[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (!options.url || !options.dest) {

[Survived] PrecomputedMutator
index.js:6:12
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.all(new Error('The options.url is required'));

[Survived] PrecomputedMutator
index.js:6:12
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.race(new Error('The options.url is required'));

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.dest is not a valid path'));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('The options.dest is not a valid path'));

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.substring(1))) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(path.basename(options.url));

[Survived] PrecomputedMutator
index.js:20:32
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest.replace(/\.[^/.]+$/, ''), decodedBasename);

[Survived] PrecomputedMutator
index.js:20:46
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest, decodeURIComponent(basename).toLowerCase());

[Survived] PrecomputedMutator
index.js:20:46
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest, path.basename(decodedBasename));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.extname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (options.dest.startsWith('/')) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.url)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.toLowerCase())) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.split('/')[0])) {
