[Survived] PrecomputedMutator
sinks/drain.js:8:7
-     if (!done) {
+     if (done !== undefined) {

[Survived] PrecomputedMutator
sinks/drain.js:26:18
-                 if(done) done(end === true ? null : end)
+                 if(done + 1) done(end === true ? null : end)

[Survived] PrecomputedMutator
sinks/drain.js:36:21
-               else if(!loop){
+               else if(!loop && true){

[Survived] PrecomputedMutator
sinks/drain.js:49:8
-       if('function' == typeof err)
+       if('string' == typeof err)

[Survived] PrecomputedMutator
sinks/drain.js:52:33
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function () {})

[Survived] PrecomputedMutator
sinks/log.js:7:17
-       console.log(data)
+       console.log(data.split(' ')[0])

[Survived] PrecomputedMutator
sinks/on-end.js:6:16
-     return drain(null, done)
+     return drain(NaN, done)

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end === true ? null : false)

[Survived] PrecomputedMutator
sources/count.js:8:17
-         return cb(true)
+         return cb(i > max)

[Survived] PrecomputedMutator
sources/infinite.js:6:15
-       return cb(null, generate())
+       return cb(false, generate())

[Survived] PrecomputedMutator
sources/once.js:7:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(onAbort, cb, abort)

[Survived] PrecomputedMutator
sources/once.js:7:22
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(true, value), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:10:21
-     if(!Array.isArray(array))
+     if(!Array.isArray(array[Math.floor(Math.random() * array.length)]))

[Survived] PrecomputedMutator
throughs/async-map.js:13:10
-         if(abort) {
+         if(abort || null) {

[Survived] PrecomputedMutator
throughs/async-map.js:22:14
-             if(busy) abortCb = cb
+             if(busy === true) abortCb = cb

[Survived] PrecomputedMutator
throughs/async-map.js:23:19
-             else cb(abort)
+             else cb(true)

[Survived] PrecomputedMutator
throughs/async-map.js:29:31
-             else if(aborted) cb(aborted)
+             else if(aborted) cb(aborted.message)

[Survived] PrecomputedMutator
throughs/filter.js:11:13
-         while(loop) {
+         while(loop || false) {

[Survived] PrecomputedMutator
throughs/filter.js:16:51
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, false)

[Survived] PrecomputedMutator
throughs/flatten.js:35:23
-               return cb(end)
+               return cb(end || cb(null, data))

[Survived] PrecomputedMutator
throughs/non-unique.js:7:10
-     return unique(field, true)
+     return unique(null, true)

[Survived] PrecomputedMutator
throughs/take.js:24:51
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(ended && !end) last ? terminate(cb) : cb(last)

[Survived] PrecomputedMutator
throughs/take.js:25:15
-         else if(ended = end) read(ended, cb)
+         else if(ended = end && true) read(ended, cb)

[Survived] PrecomputedMutator
throughs/take.js:30:16
-               cb(ended)
+               cb(ended && cb(null, data))

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end !== false) once(end)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end ^ true)

[Survived] PrecomputedMutator
throughs/through.js:17:12
-           if(!end) op && op(data)
+           if(end !== true) op && op(data)

[Survived] PrecomputedMutator
throughs/unique.js:12:21
-       var key = field(data)
+       var key = field(field(data) + 1)

[Survived] PrecomputedMutator
throughs/unique.js:12:21
-       var key = field(data)
+       var key = field(field(data) * 2)

[Survived] PrecomputedMutator
throughs/unique.js:12:21
-       var key = field(data)
+       var key = field(field(data) - 1)

[Survived] PrecomputedMutator
util/abort-cb.js:2:6
-     cb(abort)
+     cb(abort || false)

[Survived] PrecomputedMutator
util/prop.js:6:42
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data.hasOwnProperty('key')); return v && v[0] }

[Survived] PrecomputedMutator
pull.js:22:22
-         case 2: return pull(read, ref[0], ref[1])
+         case 2: return pull(read, ref[0], ref[1], ref[2] + 1)

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[3], ref[4])

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1], ref[2], ref[2])

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[i], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:27:16
-           return pull.apply(null, ref)
+           return pull.apply(ref[1], ref[0])

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && s.constructor === Function) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && s.constructor === Object && s.hasOwnProperty('sink')) {
