[Survived] PrecomputedMutator
src/matcher.ts:12:9
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null && spec.length > 0) {

[Survived] PrecomputedMutator
src/matcher.ts:12:20
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]+$/) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('*')) {

[Survived] PrecomputedMutator
src/matcher.ts:92:3
-     for (const part of spec.split('/').slice(1).reverse()) {
-       switch (part) {
-         case '+':
-           min++
-           max++
-           break
-         case '++':
-           max++
-           break
-         case '*':
-           min++
-           any = true
-           break
-         case '**':
-           any = true
-           break
-         default:
-           flatten()
-           opt = false
-           if (part.match(/:.+/) !== null) {
-             props.push(part.slice(1))
-             parts.push('/([^/]+)')
-           } else {
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
-           }
-       }
-     }
+     for (const part of spec.split('/').slice(1).reverse().map(p => p.toLowerCase())) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.indexOf(':') !== -1) {

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.concat([])) {

[Survived] PrecomputedMutator
src/policymap.ts:13:7
-         this.set(policy.name, policy)
+         this.set(this.set(policy.name, policy))

[Survived] PrecomputedMutator
src/rule.ts:26:11
-         if (!(verb in this.verbs)) {
+         if (this.verbs[verb] === undefined) {

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.reverse()) {
