[Survived] PrecomputedMutator
src/build-country.js:33:11
-         if (tz.r === undefined) result[country].current.push(id);
+         if (tz.r == undefined) result[country].current.push(id);

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isInteger(tz.d / 2) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(offset % 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.ceil(offset % 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.round(offset % 60))}`;

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, Math.random()) });

[Survived] PrecomputedMutator
src/index.js:12:51
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id.toString(), options) });

[Survived] PrecomputedMutator
src/index.js:32:61
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name.split(' ').join('')));

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated && tzs[key].name !== 'UTC') Object.assign(prev, { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:64:45
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev || tzs[key], { [key]: tzs[key] });
