[Survived] PrecomputedMutator
src/AttributeMap.ts:23:13
-           if (attributes[key] != null) {
+           if (attributes[key] != undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (a == undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:50:13
-           if (!isEqual(a[key], b[key])) {
+           if (!isEqual(a[key], b[key]) || typeof a[key] !== typeof b[key]) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:88:9
-       if (!priority) {
+       if (!priority || !b) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:91:36
-       const attributes = Object.keys(b).reduce<AttributeMap>((attrs, key) => {
+       const attributes = Object.keys(b || a).reduce<AttributeMap>((attrs, key) => {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(a).concat(Object.keys(b))).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode("0"); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:174:28
-       return this.ops.filter(predicate);
+       return this.ops.filter((op, index) => index % 2 === 0);

[Survived] PrecomputedMutator
src/Delta.ts:174:28
-       return this.ops.filter(predicate);
+       return this.ops.filter((op, index) => index > 0);

[Survived] PrecomputedMutator
src/Delta.ts:199:39
-       return this.ops.reduce(predicate, initialValue);
+       return this.ops.reduce(predicate, initialValue * 2);

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes == {}

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() !== 'insert' && thisIter.peekLength() <= firstLeft

[Survived] PrecomputedMutator
src/Delta.ts:380:17
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(otherOp.insert, thisOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:430:17
-         predicate(line, {}, i);
+         predicate(line.slice(0), {}, i);

[Survived] PrecomputedMutator
src/Delta.ts:430:17
-         predicate(line, {}, i);
+         predicate(line.slice(-1), {}, i);

[Survived] PrecomputedMutator
src/Delta.ts:488:9
-           thisIter.peekType() === 'insert' &&
-           (priority || otherIter.peekType() !== 'insert')
+           thisIter.peekType() === 'insert' && (otherIter.peekType() !== 'insert' || priority)

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(Infinity)));

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               thisData !== otherData && typeof thisData === 'object'

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               thisData !== otherData && typeof thisData === 'object' && thisData !== null

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module !== 'undefined' && module !== null) {

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             typeof nextOp.retain === 'object'

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           typeof op.retain === 'number' || typeof op.retain === 'object' && op.retain !== null || typeof op.retain === 'function'

[Survived] PrecomputedMutator
src/OpIterator.ts:92:9
-       if (!this.hasNext()) {
+       if (!this.peek()) {
