[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     mode: 0o777
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + ''))

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     flags: 'w'
+   }));

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     mode: 0o666
+   }));

[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (!options.url || options.url === 'undefined') {

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(Promise.resolve());

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.toString())) {

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(decodeURIComponent(path.basename(pathname)));

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(decodeURIComponent(pathname.split('/').pop()));

[Survived] PrecomputedMutator
index.js:20:22
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest, path.basename(decodedBasename));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest) && path.dirname(options.dest) !== '/') {
