[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 && latitude > 90 || latitude == 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (point.type === 'Point' && !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates') || point.type !== 'Point' || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type !== 'Point' && point.type !== 'Feature' && point.type !== 'GeometryCollection') {

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(Math.random() * 360);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(-δ), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y * 2, x * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(-y, x);

[Survived] PrecomputedMutator
src/geo-point.ts:185:72
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(Math.pow(2, 1), zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:185:72
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(Number(2), zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(GeoPoint.calculateDistance(point, this));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(GeoPoint.calculateDistance(this, point) + 100);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(GeoPoint.calculateDistance(this, point) * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude + 1, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.longitude + point.latitude);
