[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, 'utf8')

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.encoding = 'utf8')

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.encoding)

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.encoding ? options.encoding : null)

[Survived] PrecomputedMutator
index.js:41:7
-     if (typeof options === 'string') {
+     if (options.length > 0) {

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, undefined)

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, fs.writeFileSync(file, str, options))

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content !== null) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:26
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/m, '')
