[Killed] PrecomputedMutator
index.js:11:1
 
 exports.pull = exports
 
-for(var k in sources)
-  exports[k] = sources[k]
+for (var k in sources.keys()) exports[k] = sources[k];
 
 for(var k in throughs)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/sources/keys.js:52
  return values(Object.keys(stryMutAct_9fa48("324") ? Object.entries(object) : stryMutAct_9fa48("323") ? Object.values(object) : stryMutAct_9fa48("322") ? object.keys() : (stryCov_9fa48("322", "323", "324"), object

[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in throughs.slice())
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/index.js:73
  for (var k in stryMutAct_9fa48("11") ? throughs.concat(throughs) : stryMutAct_9fa48("10") ? throughs.slice() : stryMutAct_9fa48("9") ? throughs.reverse() : (stryCov_9fa48("9", "10", "11"), throughs)) exports[k] = throug
