[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'function' && a.length === 0) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'function' && a.length > 1) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args != null) {
         throw new TypeError("partial sink should only be called once!")
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args.length > 0) {
         throw new TypeError("partial sink should only be called once!")
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:21:27
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read + 1, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Killed] PrecomputedMutator
pull.js:22:27
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(read + 1, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:27
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read * 2, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:49
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[0], ref[1], ref[1])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:24:22
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3] - 1)
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:24:57
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[0], ref[1], ref[2], ref[length - 1])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref.concat([]))
       }
     }

[Killed] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read && typeof read.source !== 'function') {
     read = read.source
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/through.js:61
      return read(end, function (end, data) {
             ^

[Killed] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read && typeof read.source === 'undefined') {
     read = read.source
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/through.js:61
      return read(end, function (end, data) {
             ^

[Killed] PrecomputedMutator
pull.js:38:19
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
+  for (var i = 1; i == length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:38:31
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
+  for (var i = 1; i < length; i *= 2) {
     var s = arguments[i]
     if (typeof s === 'function') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (typeof s !== 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:41:16
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s(read * 2)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/sinks/drain.js:70
        read(null, function (end, data) {
        ^

[Killed] PrecomputedMutator
pull.js:41:16
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s(read + 1)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/sinks/drain.js:70
        read(null, function (end, data) {
        ^

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s !== null) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s != null) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink(read + 1)
       read = s.source
     }

[Survived] PrecomputedMutator
pull.js:43:7
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.source(read)
       read = s.source
     }
