[Killed] PrecomputedMutator
sinks/collect.js:7:14
 
 module.exports = function collect (cb) {
   return reduce(function (arr, item) {
-    arr.push(item)
+    arr.push(null)
     return arr
   }, [], cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/collect.js:7:5
 
 module.exports = function collect (cb) {
   return reduce(function (arr, item) {
-    arr.push(item)
+    arr.shift(item)
     return arr
   }, [], cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
