[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (done === false) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Survived] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(abort === true) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop

[Killed] PrecomputedMutator
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(loop - 1) {
           cbed = false
           read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = !abort) {
               loop = false
               if(done) done(end === true ? null : end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = null) {
               loop = false
               if(done) done(end === true ? null : end)

[Killed] PrecomputedMutator
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(end === true ? end : null)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(end === false ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end && end !== false) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end || end !== true) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:28:17
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.log(doneLackingErr)
                 throw end
               }

[Survived] PrecomputedMutator
sinks/drain.js:28:17
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.error(doneLackingErr)
                 throw end
               }

[Killed] PrecomputedMutator
sinks/drain.js:32:37
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === op * 2(data) || abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:32:40
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === op(NaN) || abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, done && function () {})
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:34:15
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || false, done || function () {})
             }
             else if(!loop){

[Killed] PrecomputedMutator
sinks/drain.js:36:21
               loop = false
               read(abort || true, done || function () {})
             }
-            else if(!loop){
+            else if(!read){
               next()
             }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(!cbed || true) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if(err.constructor === Function)
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if(typeof err === 'function')
       cb = err, err = true
     abort = err || true

[Killed] PrecomputedMutator
sinks/drain.js:52:8
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read(abort || true, done || function () {})) return read(abort, cb || function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:33
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort, cb || function (err) {
+  throw err;
+})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
