[Survived] PrecomputedMutator
sinks/log.js:7:17
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    console.log(data + 1)
   }, done)
 }

[Survived] PrecomputedMutator
sinks/log.js:7:17
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    console.log(data.length)
   }, done)
 }
