[Killed] PrecomputedMutator
sources/count.js:6:8
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end && cb(end)) return cb && cb(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:6:8
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(!end) return cb && cb(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:8:14
   return function (end, cb) {
     if(end) return cb && cb(end)
     if(i > max)
-      return cb(true)
+      return !cb(true)
     cb(null, i++)
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:9:14
     if(end) return cb && cb(end)
     if(i > max)
       return cb(true)
-    cb(null, i++)
+    cb(null, i--)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
