[Killed] PrecomputedMutator
sources/infinite.js:6:12
   generate = generate || Math.random
   return function (end, cb) {
     if(end) return cb && cb(end)
-    return cb(null, generate())
+    return cb(null, generate() * 2)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
