[Killed] PrecomputedMutator
sources/keys.js:4:29
 'use strict'
 var values = require('./values')
 module.exports = function (object) {
-  return values(Object.keys(object))
+  return values(Object.keys(Object.entries(object)))
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/keys.js:4:29
 'use strict'
 var values = require('./values')
 module.exports = function (object) {
-  return values(Object.keys(object))
+  return values(Object.keys(object.keys()))
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
