[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.length === 1)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.length > 0)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:7:36
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return abortCb(cb, abortCb(cb, abort, onAbort), onAbort)
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:7:24
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return null(cb, abort, onAbort)
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:8:17
   if(!array)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
+      return cb(false)
     }
   if(!Array.isArray(array))

[Survived] PrecomputedMutator
sources/values.js:8:17
   if(!array)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
+      return cb(array[i] === undefined)
     }
   if(!Array.isArray(array))

[Killed] PrecomputedMutator
sources/values.js:10:21
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!Array.isArray(array.slice(1)))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sources/values.js:10:6
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(array.length === 0)
     array = Object.keys(array).map(function (k) {
       return array[k]

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.slice(1)).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort !== true)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)

[Timeout] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort !== false)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)

[Killed] PrecomputedMutator
sources/values.js:17:22
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(abort, abort, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i < array.length - 1)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i >= 0)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sources/values.js:19:10
     if(abort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
-      cb(true)
+      cb(undefined)
     else
       cb(null, array[i++])

[Timeout] PrecomputedMutator
sources/values.js:19:10
     if(abort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
-      cb(true)
+      cb(null)
     else
       cb(null, array[i++])

[Killed] PrecomputedMutator
sources/values.js:21:10
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(array[i++], array[i++])
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:21:10
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(array[i], array[i++])
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
