[Survived] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map.length === 0) return id
   map = prop(map)
   var busy = false, abortCb, aborted

[Survived] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map === null) return id
   map = prop(map)
   var busy = false, abortCb, aborted

[Killed] PrecomputedMutator
throughs/async-map.js:8:9
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = !prop(map)
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:8:14
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop(map + 1)
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:12:10
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(aborted || busy) return cb(aborted)
       if(abort) {
         aborted = abort
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/async-map.js:13:10
   return function (read) {
     return function next (abort, cb) {
       if(aborted) return cb(aborted)
-      if(abort) {
+      if(abort || false) {
         aborted = abort
         if(!busy) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
+        if(!busy && !aborted) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.

[Killed] PrecomputedMutator
throughs/async-map.js:18:14
         if(!busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
-          cb(abort)
+          cb(null)
         })
         else read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:18:14
         if(!busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
-          cb(abort)
+          cb(0)
         })
         else read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:22:14
         })
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
+          if(!busy) abortCb = cb
           else cb(abort)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:22:14
         })
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
+          if(busy && false) abortCb = cb
           else cb(abort)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:23:19
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else cb(0)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end || false) cb(end)
           else if(aborted) cb(aborted)
           else {

[Survived] PrecomputedMutator
throughs/async-map.js:28:22
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end) cb(end + 1)
           else if(aborted) cb(aborted)
           else {

[Killed] PrecomputedMutator
throughs/async-map.js:29:28
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(aborted) null(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(aborted || true) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(!aborted) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb(undefined)
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb(!aborted)
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:36:36
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb && abortCb(null)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:36:36
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb && abortCb(undefined)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:28
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(err) next(aborted, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:23
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(!err) next (err, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:20
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else null(null, data)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:29
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else cb(null, data.toString())
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
