[Killed] PrecomputedMutator
throughs/flatten.js:11:11
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
+      if (abort && false) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:11:11
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
+      if (!abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:13:11
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err ? abort : cb)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:13:30
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err || abort, {})
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:14:14
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(null, cb)
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:14:26
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(abort, cb(null, null))
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:16:15
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(_read = null) nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/flatten.js:21:15
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
+          if (err === null) {
             if (err === true) nextStream()
             else read(true, function(abortErr) {

[Killed] PrecomputedMutator
throughs/flatten.js:22:17
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (err !== true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:22:17
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (err) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:25:18
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              cb(err.message)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:19
               cb(err)
             })
           }
-          else cb(null, data)
+          else cb(1, data)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:16
               cb(err)
             })
           }
-          else cb(null, data)
+          else cb(data, data)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/flatten.js:34:14
       function nextStream () {
         _read = null
         read(null, function (end, stream) {
-          if(end)
+          if(end && true)
             return cb(end)
           if(stream && 'object' === typeof stream)

[Killed] PrecomputedMutator
throughs/flatten.js:35:20
         _read = null
         read(null, function (end, stream) {
           if(end)
-            return cb(end)
+            return undefined(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream || 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'object' === typeof stream && stream.length === 0)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:29
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = values(stream.pipe(new PassThrough()))
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:22
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = stream.values[0](stream)
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('number' !== typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('string' !== typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:39:22
           if(stream && 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
-            stream = once(stream)
+            stream = never(stream)
           _read = stream
           nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:39:22
           if(stream && 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
-            stream = once(stream)
+            stream = twice(stream)
           _read = stream
           nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
