[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper !== null) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(mapper(data, 1))
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/map.js:56
                                                                                                                                                                                                        ^

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop - 1(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/map.js:56
                                                                                                                                                                      ^

[Killed] PrecomputedMutator
throughs/map.js:13:30
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? mapper(data.length) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:13:30
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? mapper(data + 1) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:16:23
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return cb(null)
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:16:20
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return null(err)
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
