[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if('string' === typeof test) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(test !== 'number') {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(!err)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(err || false)
       })
     }

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(true) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/take.js:66
        cb(stryMutAct_9fa48("655") ? !err : stryMutAct_9fa48("654") ? err || false : stryMutAct_9fa48("653") ? err && true : (stryCov_9fa48("653", "654", "655"), err || true));
        ^

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(undefined) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:25:28
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(ended = end) read(ended || cb)
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(ended = !end) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(ended = end && !last) {
             //last ? terminate(cb) :
             cb(ended)

[Killed] PrecomputedMutator
throughs/take.js:30:13
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            ended && !cb(ended)
           }
           else if(!test(data)) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:30:13
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            ended || !cb(ended)
           }
           else if(!test(data)) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:32:25
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test(undefined)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:32:19
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(test(data) && true) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:34:20
           }
           else if(!test(data)) {
             ended = true
-            last ? cb(null, data) : terminate(cb)
+            last ? cb(null, null) : terminate(cb)
           }
           else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:22
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(null, null)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:22
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(null, undefined)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
