[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(a && onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1284157/throughs/through.js:56
    (stryMutAct_9fa48("716") ? onEnd !== undefined : (stryCov_9fa48("716"), onEnd))(stryMutAct_9fa48("718") ? abort === true ? null : null : stryMutAct_9fa48("717") ? abort === false ? null : abort : (stryCov_9

[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(!a || !onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd !== undefined(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:10:11
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd(abort === true ? null : null)
   }
 

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(end - 1)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(end + 1)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Killed] PrecomputedMutator
throughs/through.js:17:24
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) op && op * 2(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:17:12
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(end || op) op && op(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(end - 1)
         cb(end, data)
       })

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(end + 1)
         cb(end, data)
       })

[Killed] PrecomputedMutator
throughs/through.js:19:17
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        cb(end, 0)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:19:17
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        cb(end, null)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
