[Killed] PrecomputedMutator
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop.value(field) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop.name(field) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field(data.value)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field(data.length)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:13:8
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(seen[key] = true) return !!invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:13:8
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(seen[key] = !seen[key]) return !!invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
