[Killed] PrecomputedMutator
util/tester.js:8:42
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return test.test(data[0]) }
     : prop (test) || id
   )
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
util/tester.js:8:42
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return test.test(data + 1) }
     : prop (test) || id
   )

[Killed] PrecomputedMutator
util/tester.js:9:7
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
-    : prop (test) || id
+    : id.foo (test) || id
   )
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
