[Survived] PrecomputedMutator
src/build-country.js:33:11
-         if (tz.r === undefined) result[country].current.push(id);
+         if (!tz.r) result[country].current.push(id);

[Survived] PrecomputedMutator
src/build-timezone.js:14:21
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.parseInt(tz.d) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== Object.keys(timezones).length) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== data.timezones.length) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id] && !timezones[id]) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:27:7
-     if (!country) return;
+     if (country == null) return;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(timezones.length - 1).length;
