[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (!b) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:82:9
-       if (typeof a !== 'object') {
+       if (a !== null && typeof a !== 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(b)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.values(b)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.entries(b)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(" "); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode("foo"); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:20:7
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' || a === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:23:7
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b !== 'object' || b === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:23:7
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b !== 'object' || b === NaN) {

[Survived] PrecomputedMutator
src/Delta.ts:51:9
-       if (!handler) {
+       if (typeof handler !== 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && ops.ops.length > 0 && typeof ops.ops[0] === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (!arg) {

[Survived] PrecomputedMutator
src/Delta.ts:160:23
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(this.ops.length - 1, 0, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes == true

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft && otherIter.peekType() === 'insert'

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft && otherIter.peekType() === 'retain'

[Survived] PrecomputedMutator
src/Delta.ts:275:19
-                 if (thisOp.retain == null) {
+                 if (!thisOp.retain) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekLength() < 1

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 3], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 4], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(10));

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(iter.peekLength() + 1));

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain && op.attributes !== null) {

[Survived] PrecomputedMutator
src/Delta.ts:451:15
-                 AttributeMap.invert(op.attributes, baseOp.attributes),
+                 AttributeMap.invert(op.attributes, baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:457:45
-           const slice = base.slice(baseIndex, baseIndex + 1);
+           const slice = base.slice(baseIndex, baseIndex + 10);

[Survived] PrecomputedMutator
src/Delta.ts:491:22
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(thisIter.peekLength() + 1)));

[Survived] PrecomputedMutator
src/Delta.ts:491:22
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(thisIter.peekLength() * 2)));

[Survived] PrecomputedMutator
src/Delta.ts:493:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(1));

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (Array.isArray(op.retain)) {

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             typeof nextOp.retain === 'object' && nextOp.retain !== null && nextOp.retain.constructor === Object
