[Survived] PrecomputedMutator
lib/request.js:6:45
-     const request = url.trimLeft().startsWith('https') ? https : http;
+     const request = url.trimLeft().startsWith('http' + 's') ? https : http;

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + "foo"))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest.toLowerCase()))

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     flag: 'a'
+   }));

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     mode: 0o644
+   }));

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     start: 100
+   }));

[Survived] PrecomputedMutator
index.js:10:12
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.all(new Error('The options.dest is required'));

[Survived] PrecomputedMutator
index.js:10:12
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.race(new Error('The options.dest is required'));

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.split('\\')[0]);

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(decodeURIComponent(pathname));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest) && path.extname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace('jpg', 'png'))) {
