[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type !== 'Point' || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type !== 'Point' && point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (object.latitude === undefined || object.longitude === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!object.hasOwnProperty('latitude') && !object.hasOwnProperty('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude') || object.latitude === undefined || object.longitude === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:48
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') || !object.propertyIsEnumerable('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 1 ? 2 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 0 ? r : 1) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:125:19
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos((φ1 + φ2) / 2) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:39
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1 + 0.000001) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:39
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1 + Math.random() * 0.000001) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance + 10) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance - 10) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing - 180));

[Survived] PrecomputedMutator
src/geo-point.ts:147:24
-       const λ1 = deg2rad(coordinate.longitude);
+       const λ1 = deg2rad(coordinate.longitude * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(φ1 * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ * 2), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(Math.acos(sinθ));

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(Math.sin(θ), x);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance * 2, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance / 2, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing + 180);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.latitude + 1);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.latitude * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(undefined, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.latitude + 1);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.longitude * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.latitude + 1);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.longitude * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance({}, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(undefined, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.longitude - point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:297:50
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toExponential(precision));

[Survived] PrecomputedMutator
src/geo-point.ts:297:50
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toLocaleString(precision));
