[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, {
+     encoding: 'utf8'
+   })

[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, {
+     throws: false
+   })

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.replacer)

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.reviver)

[Survived] PrecomputedMutator
index.js:41:7
-     if (typeof options === 'string') {
+     if (options.constructor === String) {

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, 'hello')

[Survived] PrecomputedMutator
index.js:52:23
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content.split(' ').join('_'), options.reviver)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, null)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {
+     reviver: null
+   })

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {
+     reviver: () => {}
+   })

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.replacer)

[Survived] PrecomputedMutator
index.js:78:27
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file.toString(), str, options)

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content) || content.length === 0) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^[\uFEFF\u2060]/, '')
