[Survived] PrecomputedMutator
sinks/drain.js:32:21
-               else if(op && false === op(data) || abort) {
+               else if(op && false === op(data)) {

[Survived] PrecomputedMutator
sinks/drain.js:32:37
-               else if(op && false === op(data) || abort) {
+               else if(op && false === op || true(data) || abort) {

[Survived] PrecomputedMutator
sinks/drain.js:34:35
-                 read(abort || true, done || function () {})
+                 read(abort || true, done || function (err) {})

[Survived] PrecomputedMutator
sinks/drain.js:36:21
-               else if(!loop){
+               else if(loop === false){

[Survived] PrecomputedMutator
sinks/drain.js:49:8
-       if('function' == typeof err)
+       if(cb = null)

[Survived] PrecomputedMutator
sinks/drain.js:52:21
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function () {
+     return null;
+   })

[Survived] PrecomputedMutator
sinks/find.js:12:17
-       test = prop(test) || id
+       test = prop(test || id) || id

[Survived] PrecomputedMutator
sinks/reduce.js:10:5
-       cb(err, acc)
+       cb(err, acc)

[Survived] PrecomputedMutator
sinks/reduce.js:16:12
-           if(end) return cb(end === true ? null : end)
+           if(acc !== null) return cb(end === true ? null : end)

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end !== true ? end : null)

[Survived] PrecomputedMutator
sources/infinite.js:5:8
-       if(end) return cb && cb(end)
+       if(end && generate()) return cb && cb(end)

[Survived] PrecomputedMutator
sources/infinite.js:6:21
-       return cb(null, generate())
+       return cb(null, generate(1, 2))

[Survived] PrecomputedMutator
sources/infinite.js:6:21
-       return cb(null, generate())
+       return cb(null, generate(1, 2, 3))

[Survived] PrecomputedMutator
sources/once.js:6:8
-       if(abort)
+       if(abort == false)

[Survived] PrecomputedMutator
sources/once.js:7:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(null, null))

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort = null, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:33
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort(abort))

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return true(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return false(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort * 2, onAbort)

[Survived] PrecomputedMutator
sources/values.js:16:8
-       if(abort)
+       if(abort !== null)

[Survived] PrecomputedMutator
sources/values.js:17:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, onAbort, onAbort)

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(aborted && !busy) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/async-map.js:22:14
-             if(busy) abortCb = cb
+             if(busy || false) abortCb = cb

[Survived] PrecomputedMutator
throughs/async-map.js:23:19
-             else cb(abort)
+             else cb({})

[Survived] PrecomputedMutator
throughs/async-map.js:34:18
-                 if(aborted) {
+                 if(aborted + 1) {

[Survived] PrecomputedMutator
throughs/filter-not.js:8:43
-     return filter(function (data) { return !test(data) })
+     return filter(function (data) { return !test || false(data) })

[Survived] PrecomputedMutator
throughs/filter.js:16:41
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, cb + 1)

[Survived] PrecomputedMutator
throughs/filter.js:16:41
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, cb - 1)

[Survived] PrecomputedMutator
throughs/filter.js:16:46
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end && !test(data), cb)

[Survived] PrecomputedMutator
throughs/flatten.js:37:29
-               stream = values(stream)
+               stream = values(stream.concat())

[Survived] PrecomputedMutator
throughs/flatten.js:38:20
-             else if ('function' !== typeof stream)
+             else if ('number' === typeof stream)

[Survived] PrecomputedMutator
throughs/non-unique.js:7:10
-     return unique(field, true)
+     return unique || true(field, true)

[Survived] PrecomputedMutator
throughs/take.js:24:10
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(!end && ended) last ? terminate(cb) : cb(ended)

[Survived] PrecomputedMutator
throughs/take.js:25:33
-         else if(ended = end) read(ended, cb)
+         else if(ended = end) read(ended && end, cb)

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end ? false : true) once(end)

[Survived] PrecomputedMutator
pull.js:10:11
-         if (args == null) {
+         if (args[0] === null) {

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[0], ref[2])

[Survived] PrecomputedMutator
pull.js:22:33
-         case 2: return pull(read, ref[0], ref[1])
+         case 2: return pull(read, ref[Math.floor(Math.random() * ref.length)], ref[1])

[Survived] PrecomputedMutator
pull.js:24:27
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(0, ref[0], ref[1], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[2] + 1, ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s !== undefined) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (typeof s !== 'object') {
