[Killed] PrecomputedMutator
index.js:11:14
 
 exports.pull = exports
 
-for(var k in sources)
+for(var k in sources.reduce(function (acc, source) {
+  return acc + source.count;
+}, 0))
   exports[k] = sources[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/index.js:63
  for (var k in stryMutAct_9fa48("5") ? sources.reduce(function (acc, source) {
                                                ^

[Killed] PrecomputedMutator
index.js:11:14
 
 exports.pull = exports
 
-for(var k in sources)
+for(var k in sources.filter(function (source) {
+  return source.type === 'buggy';
+}))
   exports[k] = sources[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/index.js:67
  }) : stryMutAct_9fa48("3") ? sources.filter(function (source) {
                                       ^

[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in throughs.concat(['newThrough']))
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/index.js:79
  for (var k in stryMutAct_9fa48("11") ? throughs.concat(['newThrough']) : stryMutAct_9fa48("10") ? throughs.slice(1) : stryMutAct_9fa48("9") ? throughs.reverse() : (stryCov_9fa48("9", "10", "11"), throughs)) exports[k] =

[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in exports)
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/test/abort-stalled.js:65
test('through', pull.through())
                     ^
