[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'function' && a.length === 2) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args.length === 0) {
         throw new TypeError("partial sink should only be called once!")
       }

[Killed] PrecomputedMutator
pull.js:23:33
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[length - 1], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:24:33
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[Math.floor(Math.random() * length)], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref.length)
       }
     }

[Killed] PrecomputedMutator
pull.js:38:3
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
-    var s = arguments[i]
-    if (typeof s === 'function') {
-      read = s(read)
-    } else if (s && typeof s === 'object') {
-      s.sink(read)
-      read = s.source
-    }
-  }
+  for (var i = length - 1; i >= 0; i--) {
+  var s = arguments[i];
+  if (typeof s === 'function') {
+    read = s(read);
+  } else if (s && typeof s === 'object') {
+    s.sink(read);
+    read = s.source;
+  }
+}
 
   return read
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/test/abort-stalled.js:16
      cb(abort) //??
      ^

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (Function.isFunction(s)) {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/pull.js:148
      if (stryMutAct_9fa48("121") ? Function.isFunction(s) : stryMutAct_9fa48("120") ? s.constructor === Function : stryMutAct_9fa48("119") ? s instanceof Function : (stryCov_9fa48("119", "120", "121"), typeof s === 'func

[Survived] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s instanceof Function) {
       read = s(read)
     } else if (s && typeof s === 'object') {

[Killed] PrecomputedMutator
pull.js:41:14
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s.sink(read)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:41:14
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s.source.sink(read)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/pull.js:149
                                                   ^

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s !== undefined) {
       s.sink(read)
       read = s.source
