[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(typeof cb === 'function') cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:8:24
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = reducer(acc, 0)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (arguments.length !== 2)
     return function (source) {
       source(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(acc === null) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/reduce.js:16:24
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(end) return undefined(end === true ? null : end)
         acc = data; sink(source)
       })

[Killed] PrecomputedMutator
sinks/reduce.js:17:26
       source(null, function (end, data) {
         //if ended immediately, and no initial...
         if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
+        acc = data; sink(sink(source))
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:17:26
       source(null, function (end, data) {
         //if ended immediately, and no initial...
         if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
+        acc = data; sink(sink(acc))
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
