[Survived] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(abort == false)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] PrecomputedMutator
sources/once.js:7:22
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(abortCb(undefined, abort, onAbort), abort, onAbort)
     if(value != null) {
       var _value = value; value = null

[Survived] PrecomputedMutator
sources/once.js:12:10
       var _value = value; value = null
       cb(null, _value)
     } else
-      cb(true)
+      cb(!value)
   }
 }
