[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.some(function (element) {
+  return !element;
+}))
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.filter(Boolean).length === 0)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:7:24
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return true(cb, abort, onAbort)
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:7:10
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort === true) return abortCb(cb, abort, onAbort)
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:8:17
   if(!array)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
+      return cb(null)
     }
   if(!Array.isArray(array))

[Killed] PrecomputedMutator
sources/values.js:10:7
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!!array.length(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:10:7
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!array.length < 0(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.slice(i)).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array[i]).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort === true)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:17:26
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, abort * 2, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i > array.length)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i % 2 === 0)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sources/values.js:19:10
     if(abort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
-      cb(true)
+      cb(array[i])
     else
       cb(null, array[i++])

[Timeout] PrecomputedMutator
sources/values.js:19:10
     if(abort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
-      cb(true)
+      cb(false)
     else
       cb(null, array[i++])

[Timeout] PrecomputedMutator
sources/values.js:21:7
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(null, array[i--])
   }
 }

[Survived] PrecomputedMutator
sources/values.js:21:10
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb('', array[i++])
   }
 }
