[Survived] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map && !map.length) return id
   map = prop(map)
   var busy = false, abortCb, aborted

[Killed] PrecomputedMutator
throughs/async-map.js:8:14
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop(map.length)
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:8:9
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop.baz(map)
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:12:26
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(aborted) return null(aborted)
       if(abort) {
         aborted = abort
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
+        if(aborted && !busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.

[Killed] PrecomputedMutator
throughs/async-map.js:18:11
         if(!busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
-          cb(abort)
+          abort(abort)
         })
         else read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:23:16
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else undefined(abort)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:23:16
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else null(abort)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:28:19
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end) abort(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:29:31
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(aborted) cb(false)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(aborted.toString()) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:17
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                abortCb(aborted)
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:36:36
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb && abortCb(false)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:39
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(err) next (err, aborted)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:20
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else "foo"(null, data)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
