[Killed] PrecomputedMutator
throughs/filter-not.js:7:17
 var filter = require('./filter')
 
 module.exports = function filterNot (test) {
-  test = tester(test)
+  test = tester(test + 1)
   return filter(function (data) { return !test(data) })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/filter-not.js:7:17
 var filter = require('./filter')
 
 module.exports = function filterNot (test) {
-  test = tester(test)
+  test = tester(test.length)
   return filter(function (data) { return !test(data) })
 }

[Killed] PrecomputedMutator
throughs/filter-not.js:8:17
 
 module.exports = function filterNot (test) {
   test = tester(test)
-  return filter(function (data) { return !test(data) })
+  return filter(function (data) {
+  return test(data);
+})
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
