[Killed] PrecomputedMutator
throughs/filter.js:7:17
 
 module.exports = function filter (test) {
   //regexp
-  test = tester(test)
+  test = tester(test(data))
   return function (read) {
     return function next (end, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter.js:7:17
 
 module.exports = function filter (test) {
   //regexp
-  test = tester(test)
+  test = tester(!test)
   return function (read) {
     return function next (end, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter.js:11:13
   return function (read) {
     return function next (end, cb) {
       var sync, loop = true
-      while(loop) {
+      while(loop || !test(data)) {
         loop = false
         sync = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter.js:15:23
         loop = false
         sync = true
         read(end, function (end, data) {
-          if(!end && !test(data))
+          if(!end && !test + 1(data))
             return sync ? loop = true : next(end, cb)
           cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter.js:15:23
         loop = false
         sync = true
         read(end, function (end, data) {
-          if(!end && !test(data))
+          if(!end && !test && false(data))
             return sync ? loop = true : next(end, cb)
           cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/filter.js:16:51
         sync = true
         read(end, function (end, data) {
           if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
+            return sync ? loop = true : next(end, undefined)
           cb(end, data)
         })

[Survived] PrecomputedMutator
throughs/filter.js:16:41
         sync = true
         read(end, function (end, data) {
           if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
+            return sync ? loop = true : next(end, !cb)
           cb(end, data)
         })

[Killed] PrecomputedMutator
throughs/filter.js:17:14
         read(end, function (end, data) {
           if(!end && !test(data))
             return sync ? loop = true : next(end, cb)
-          cb(end, data)
+          cb(end && test(data), data)
         })
         sync = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter.js:17:11
         read(end, function (end, data) {
           if(!end && !test(data))
             return sync ? loop = true : next(end, cb)
-          cb(end, data)
+          cb(end, data.property)
         })
         sync = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
