[Killed] PrecomputedMutator
throughs/flatten.js:11:11
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
+      if (abort || true) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:13:11
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          abort(err || abort, cb)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:14:26
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(abort, cb(null))
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:14:19
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(!abort, cb)
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:16:22
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(_read) _read()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/flatten.js:21:15
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
+          if (err !== true) {
             if (err === true) nextStream()
             else read(true, function(abortErr) {

[Killed] PrecomputedMutator
throughs/flatten.js:22:17
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (err == false) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:25:18
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              cb(new Error())
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:16
               cb(err)
             })
           }
-          else cb(null, data)
+          else undefined(null, data)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/flatten.js:35:23
         _read = null
         read(null, function (end, stream) {
           if(end)
-            return cb(end)
+            return cb(undefined)
           if(stream && 'object' === typeof stream)
             stream = values(stream)

[Survived] PrecomputedMutator
throughs/flatten.js:35:23
         _read = null
         read(null, function (end, stream) {
           if(end)
-            return cb(end)
+            return cb(true)
           if(stream && 'object' === typeof stream)
             stream = values(stream)

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream === 'object')
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream == 'object')
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:29
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = values(stream.map())
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/flatten.js:37:29
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = values(stream.slice())
           else if ('function' !== typeof stream)
             stream = once(stream)

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('undefined' === typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('string' === typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
