[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(typeof mapper === 'function') return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(mapper(data) * 2)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/map.js:56
  mapper = (stryMutAct_9fa48("642") ? !prop : (stryCov_9fa48("642"), prop))(stryMutAct_9fa48("645") ? mapper(data) + 'a' : stryMutAct_9fa48("644") ? mapper(data) * 2 : stryMutAct_9fa48("643") ? mapper(data) + 1 : (

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = !prop(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/map.js:56
  mapper = (stryMutAct_9fa48("642") ? !prop : (stryCov_9fa48("642"), prop))(stryMutAct_9fa48("645") ? mapper(data) + 'a' : stryMutAct_9fa48("644") ? mapper(data) * 2 : stryMutAct_9fa48("643") ? mapper(data) + 1 : (

[Killed] PrecomputedMutator
throughs/map.js:16:23
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return cb(0)
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:19:9
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(end, !data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:19:9
             return cb(err)
           })
         }
-        cb(end, data)
+        !cb(end, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/map.js:67
