[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(test === null) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/take.js:74

[Survived] PrecomputedMutator
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(err ? true : false)
       })
     }

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(cb(null, data)) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(cb(null, !data)) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(ended = end && !ended) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:30:16
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            cb(ended && false)
           }
           else if(!test(data)) {

[Killed] PrecomputedMutator
throughs/take.js:32:25
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test(!data)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:16
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(true, data)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
