[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(a || onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/through.js:56
    onEnd(stryMutAct_9fa48("750") ? !abort ? null : abort : stryMutAct_9fa48("749") ? abort ? null : abort : stryMutAct_9fa48("748") ? abort === false ? null : abort : (stryCov_9fa48("748", "749", "750"), abort

[Survived] PrecomputedMutator
throughs/through.js:10:11
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd(abort ? null : abort)
   }
 

[Survived] PrecomputedMutator
throughs/through.js:10:11
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd(abort === false ? null : abort)
   }
 

[Killed] PrecomputedMutator
throughs/through.js:15:15
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) onEnd(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/through.js:60

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(true)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Killed] PrecomputedMutator
throughs/through.js:17:12
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(end || op(data)) op && op(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7752715/throughs/through.js:62
                                             ^
