[Survived] PrecomputedMutator
src/matcher.ts:12:20
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/s) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:18:20
-       if (spec.match(/\/\//) !== null) {
+       if (spec.match(/\/\/.*/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith(' ')) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('/' + ' ')) {

[Survived] PrecomputedMutator
src/matcher.ts:67:18
-         } else if (min > 0) {
+         } else if (min !== 0) {

[Survived] PrecomputedMutator
src/matcher.ts:92:3
-     for (const part of spec.split('/').slice(1).reverse()) {
-       switch (part) {
-         case '+':
-           min++
-           max++
-           break
-         case '++':
-           max++
-           break
-         case '*':
-           min++
-           any = true
-           break
-         case '**':
-           any = true
-           break
-         default:
-           flatten()
-           opt = false
-           if (part.match(/:.+/) !== null) {
-             props.push(part.slice(1))
-             parts.push('/([^/]+)')
-           } else {
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
-           }
-       }
-     }
+     for (let part of spec.split('/').slice(1).reverse()) {

[Survived] PrecomputedMutator
src/matcher.ts:92:44
-     for (const part of spec.split('/').slice(1).reverse()) {
+     for (const part of spec.split('/').slice(1.5).reverse()) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:.+/) !== part.match(/:.+/)) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:.+?/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:[^/]+/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:[a-zA-Z0-9_-]+/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:115:26
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([.$])/g, '\\\$1')}`)

[Survived] PrecomputedMutator
src/policy.ts:37:11
-         if (res === true) {
+         if (res !== null) {

[Survived] PrecomputedMutator
src/policy.ts:49:11
-         if (rule.matches(path, ctx)) {
+         if (rule.matches(path, ctx) && rule.matches(path, ctx)) {

[Survived] PrecomputedMutator
src/policy.ts:49:11
-         if (rule.matches(path, ctx)) {
+         if (rule.matches(path, ctx) || rule.matches(path, ctx)) {

[Survived] PrecomputedMutator
src/policymap.ts:7:24
-       super(policies.map((policy) => [policy.name, policy]))
+       super(policies.map(policy => [policy.name.toLowerCase(), policy]))

[Survived] PrecomputedMutator
src/policymap.ts:7:24
-       super(policies.map((policy) => [policy.name, policy]))
+       super(policies.map(policy => [policy.name, policy.clone()]))

[Survived] PrecomputedMutator
src/policymap.ts:12:5
-       for (const policy of policies) {
-         this.set(policy.name, policy)
-       }
+       for (let policy of policies) {
+     this.set(policy.name, policy);
+   }

[Survived] PrecomputedMutator
src/policymap.ts:12:26
-       for (const policy of policies) {
+       for (const policy of policies.filter(policy => policy.name !== 'default')) {

[Survived] PrecomputedMutator
src/rule.ts:25:24
-       for (const verb of verbs) {
+       for (const verb of Object.values(verbs)) {
