[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap !== Object.prototype) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-country.js:33:11
-         if (tz.r === undefined) result[country].current.push(id);
+         if (tz.r == null) result[country].current.push(id);

[Survived] PrecomputedMutator
src/build-timezone.js:25:7
-     if (timezone.r) result.deprecated = true;
+     if (timezone.r !== undefined) result.deprecated = true;

[Survived] PrecomputedMutator
src/build-timezone.js:34:30
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(Math.ceil(offset / 60))}:${getNumStr(min)}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:30
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(Math.round(offset / 60))}:${getNumStr(min)}`;

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, NaN) });

[Survived] PrecomputedMutator
src/index.js:18:10
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, options, getTimezone);

[Survived] PrecomputedMutator
src/index.js:37:7
-     if (!timezone) return;
+     if (timezone == null) return;

[Survived] PrecomputedMutator
src/index.js:49:42
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName.split(' ')[0], options);

[Survived] PrecomputedMutator
src/index.js:55:7
-     if (!country) return null;
+     if (country == undefined) return null;

[Survived] PrecomputedMutator
src/index.js:64:45
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev[key] = {
+     ...tzs[key]
+   }, { [key]: tzs[key] });
