[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (!options.url || options.url.length === 0) {

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('The options.dest is not a string'));

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.substr(1))) {

[Survived] PrecomputedMutator
index.js:20:32
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest + '/', decodedBasename);
