[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type === 'Point' && point.coordinates.length > 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type === 'Point' && point.coordinates.length === 1) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (point.coordinates.length !== 2 && point.coordinates.length !== 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates.slice(0, 1)) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates.concat([0])) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!object || typeof object !== 'object') {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') && object.hasOwnProperty('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 1 ? -1 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:126:21
-       const θ = atan2(y, x);
+       const θ = atan2(Math.sin(y), x);

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance + Math.random() * 10) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(bearing * 180);

[Survived] PrecomputedMutator
src/geo-point.ts:149:36
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = sin(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(Math.random());

[Survived] PrecomputedMutator
src/geo-point.ts:150:18
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = asin(δ), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:18
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = Math.sin(θ), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(2 * θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(θ * 0);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, cos(θ));

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ2 + 0.00001);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ2 - 0.00001);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ2 * 0.99999);

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(λ1 + λ2) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:186:49
-       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(
+       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180 + 0.00001) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing - 360);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.latitude, this.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(new GeoPoint(this.latitude, this.longitude));

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.latitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude, point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(point.latitude, this.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.longitude + point.longitude, this.latitude + point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(new GeoPoint(this.latitude + 1, this.longitude + 1), point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, undefined);
