[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data.split(','), options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.reviver)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.reviver, options.reviver)

[Survived] PrecomputedMutator
index.js:52:32
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver || options.replacer)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, 'utf8')

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.encoding || 'utf8')

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.fs)

[Survived] PrecomputedMutator
utils.js:5:10
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\n]/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:10:23
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content.slice(0))) content = content.toString('utf8')
