[Killed] PrecomputedMutator
index.js:11:1
 
 exports.pull = exports
 
-for(var k in sources)
-  exports[k] = sources[k]
+for (var k in throughs) exports[k] = sources[k];
 
 for(var k in throughs)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
index.js:14:1
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
-  exports[k] = throughs[k]
+for (var k in throughs.slice(0, -1)) exports[k] = throughs[k];
 
 for(var k in sinks)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4049959/index.js:72
  for (var k in throughs.slice(0, -1)) exports[k] = throughs[k];
                         ^

[Killed] PrecomputedMutator
index.js:14:1
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
-  exports[k] = throughs[k]
+for (var k in throughs.slice(1)) exports[k] = throughs[k];
 
 for(var k in sinks)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4049959/index.js:70
  for (var k in throughs.slice(1)) exports[k] = throughs[k];
                         ^

[Killed] PrecomputedMutator
index.js:17:1
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
-  exports[k] = sinks[k]
+for (var k in sinks.values()) exports[k] = sinks[k];
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4049959/index.js:80
  for (var k in sinks.values()) exports[k] = sinks[k];
                      ^

[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in throughs[0])
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
