[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (!done || false) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (done && false) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Killed] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(abort || true) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = abort || end) {
               loop = false
               if(done) done(end === true ? null : end)

[Timeout] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = !end && abort) {
               loop = false
               if(done) done(end === true ? null : end)

[Killed] PrecomputedMutator
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(end !== true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(doneLackingErr())
                 throw end
               }

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, done ? function () {} : null)
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(cbed || abort) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:21
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort || cb)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
