[Killed] PrecomputedMutator
sources/count.js:6:8
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(i > max) return cb && cb(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:6:8
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end + max) return cb && cb(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/count.js:7:8
   var i = 0; max = max || Infinity
   return function (end, cb) {
     if(end) return cb && cb(end)
-    if(i > max)
+    if(i >= max)
       return cb(true)
     cb(null, i++)

[Killed] PrecomputedMutator
sources/count.js:8:17
   return function (end, cb) {
     if(end) return cb && cb(end)
     if(i > max)
-      return cb(true)
+      return cb(max - i)
     cb(null, i++)
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:9:5
     if(end) return cb && cb(end)
     if(i > max)
       return cb(true)
-    cb(null, i++)
+    cb(i--)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
