[Survived] PrecomputedMutator
sources/infinite.js:5:8
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end !== null) return cb && cb(end)
     return cb(null, generate())
   }

[Killed] PrecomputedMutator
sources/infinite.js:6:12
   generate = generate || Math.random
   return function (end, cb) {
     if(end) return cb && cb(end)
-    return cb(null, generate())
+    return null(null, generate())
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
