[Survived] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(abort != null)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Timeout] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(value !== abort)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] PrecomputedMutator
sources/once.js:7:14
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, null, onAbort)
     if(value != null) {
       var _value = value; value = null

[Killed] PrecomputedMutator
sources/once.js:10:16
       return abortCb(cb, abort, onAbort)
     if(value != null) {
       var _value = value; value = null
-      cb(null, _value)
+      cb(null, _value.toString())
     } else
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
