[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(!array.length)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:7:43
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return abortCb(cb, abort, onAbort.call(this))
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:7:24
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return abortCb(cb, abort, onAbort, null)
       return cb(true)
     }

[Killed] PrecomputedMutator
sources/values.js:10:7
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!array.length === 1(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:10:7
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(!array.length === 0(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.slice()).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.length).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:17:22
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(abortCb(null, abort, onAbort), abort, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:21:7
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(array[i++])
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:21:7
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(array[i++], null)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
