[Killed] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map.hasOwnProperty('length')) return id
   map = prop(map)
   var busy = false, abortCb, aborted
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/async-map.js:12:10
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(aborted === true) return cb(aborted)
       if(abort) {
         aborted = abort

[Survived] PrecomputedMutator
throughs/async-map.js:12:29
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(aborted) return cb(true)
       if(abort) {
         aborted = abort

[Killed] PrecomputedMutator
throughs/async-map.js:15:12
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
+        if(busy || abort) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:18:11
         if(!busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
-          cb(abort)
+          aborted(abort)
         })
         else read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:23:19
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else cb(null)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:28:19
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end) abortCb(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(aborted !== false) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb("aborted")
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:36:28
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb && abortCb != null(aborted)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:20
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else cb(NaN)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
