[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(!mapper(data)) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4049959/throughs/map.js:55
  if (stryMutAct_9fa48("625") ? mapper(data) === mapper(data) : stryMutAct_9fa48("624") ? !mapper(data) : stryMutAct_9fa48("623") ? mapper !== mapper : (stryCov_9fa48("623", "624", "625"), !mapper)) return id;

[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper(data) === mapper(data)) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox4049959/throughs/map.js:55
  if (stryMutAct_9fa48("625") ? mapper(data) === mapper(data) : stryMutAct_9fa48("624") ? !mapper(data) : stryMutAct_9fa48("623") ? mapper !== mapper : (stryCov_9fa48("623", "624", "625"), !mapper)) return id;

[Killed] PrecomputedMutator
throughs/map.js:19:12
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(end || data, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:19:9
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(end, 0)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
