[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd !== null(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
