[Killed] PrecomputedMutator
util/tester.js:8:32
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return test.test + 1(data) }
     : prop (test) || id
   )
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
