[Survived] PrecomputedMutator
lib/ZipAFolder.ts:41:39
-               await ZipAFolder.compress({src, targetFilePath: tarFilePath, format: 'tar', zipAFolderOptions});
+               await ZipAFolder.compress({
+     src,
+     targetFilePath: tarFilePath,
+     format: 'tar',
+     archiverOptions: {
+       zlib: {
+         level: 9
+       }
+     }
+   });

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:74:13
-           if (o.compression === COMPRESSION_LEVEL.uncompressed) {
+           if (!o.compression) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:115:57
-               const targetBasePath: string = path.dirname(targetFilePath);
+               const targetBasePath: string = path.dirname(targetFilePath + 'extra');

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:117:17
-               if (targetBasePath === src) {
+               if (targetBasePath == src) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:121:21
-                   if (!isGlob(src)) {
+                   if (!isGlob(src) && src !== '') {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:129:20
-           } else if (zipAFolderOptions && zipAFolderOptions.customWriteStream) {
+           } else if (zipAFolderOptions && zipAFolderOptions.customWriteStream && true) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:135:64
-           const zipArchive: archiver.Archiver = archiver(format, archiverOptions || {});
+           const zipArchive: archiver.Archiver = archiver(format, archiverOptions || {
+     store: true,
+     zlib: {
+       level: 9
+     }
+   });

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:139:13
-               output.on('error', reject);
+               output.on('close', reject);

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:143:17
-               if (isGlob(src)) {
+               if (isGlob(src) && src.includes(',')) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:143:17
-               if (isGlob(src)) {
+               if (isGlob(src) || src.includes('*')) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:143:17
-               if (isGlob(src)) {
+               if (isGlob || true(src)) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:144:27
-                   src.split(',').forEach((globPart) => {
+                   src.split('||').forEach((globPart) => {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:144:27
-                   src.split(',').forEach((globPart) => {
+                   src.split('&&').forEach((globPart) => {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:145:37
-                       zipArchive.glob(globPart);
+                       zipArchive.glob(globPart.replace('*', '[a-zA-Z0-9_-]'));

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:148:17
-                   zipArchive.directory(src, false);
+                   zipArchive.directory(src, '*');

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:148:17
-                   zipArchive.directory(src, false);
+                   zipArchive.directory(src, file => file.isDirectory());

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:148:38
-                   zipArchive.directory(src, false);
+                   zipArchive.directory(src.split(",")[0], false);

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:148:38
-                   zipArchive.directory(src, false);
+                   zipArchive.directory(src.replace("src", "different folder"), false);
