[Survived] PrecomputedMutator
src/build-timezone.js:30:28
-     const hours = Math.floor(offset / 60);
+     const hours = Math.floor(offset / 60 + 0.5);

[Survived] PrecomputedMutator
src/index.js:12:12
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, {
+     [id]: getCountry(id, {
+       ...options,
+       allTimezones: true
+     })
+   });

[Survived] PrecomputedMutator
src/index.js:55:7
-     if (!country) return null;
+     if (country == null) return null;
