[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (!Object.prototype.toString.call(a).includes('Object')) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b.hasOwnProperty('constructor')) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (a !== a) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekLength() === 0 && isEqual(delta.ops[delta.ops.length - 1], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(length + otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:368:24
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, length + 1);

[Survived] PrecomputedMutator
src/Delta.ts:492:18
-         } else if (otherIter.peekType() === 'insert') {
+         } else if (otherIter.peekType() === 'insert' && otherIter.peekLength() > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.invert(otherData[embedType], thisData[embedType])) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.offset === Infinity) {
