[Survived] PrecomputedMutator
index.js:11:7
-     if (typeof options === 'string') {
+     if (typeof options !== 'object') {

[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.flag)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : 'foo')

[Survived] PrecomputedMutator
index.js:38:43
-   const readFile = universalify.fromPromise(_readFile)
+   const readFile = universalify.fromPromise(_readFile.bind(null))

[Survived] PrecomputedMutator
index.js:38:43
-   const readFile = universalify.fromPromise(_readFile)
+   const readFile = universalify.fromPromise(_readFile.bind(undefined))

[Survived] PrecomputedMutator
index.js:38:43
-   const readFile = universalify.fromPromise(_readFile)
+   const readFile = universalify.fromPromise(_readFile.bind(this))

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.encoding, options.flag)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.encoding, options.flag, options.mode)

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, "utf-8")

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, 'utf8')

[Survived] PrecomputedMutator
utils.js:5:22
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\n\r]/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:5:22
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\r\n]/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:11:26
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF+/, '')
