[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in null)
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
