[Killed] PrecomputedMutator
pull.js:23:49
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[0], ref[1], ref[2] + 1)
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref.map(function (x) {
+  return x + 1;
+}))
       }
     }

[Killed] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read && read.source.constructor === Function) {
     read = read.source
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1391709/pull.js:93
  if (stryMutAct_9fa48("108") ? read && read.source.constructor === Function : stryMutAct_9fa48("107") ? read && typeof read.source === 'object' : stryMutAct_9fa48("106") ? read && typeof read.source !== 'function' : (stry

[Killed] PrecomputedMutator
pull.js:38:19
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
+  for (var i = 1; i === length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s.prototype.constructor === Function) {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && typeof s.sink === 'object') {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink(read - 1)
       read = s.source
     }
