[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (!done.call) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Killed] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(op || false) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done(end)) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done(end === true)) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end && end === true) {
                 console.warn(doneLackingErr)
                 throw end

[Killed] PrecomputedMutator
sinks/drain.js:37:15
               read(abort || true, done || function () {})
             }
             else if(!loop){
-              next()
+              read = null()
             }
           })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if('object' == typeof err)
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:26
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort = true, cb || function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
