[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array.length !== 0)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sources/values.js:10:6
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(typeof array !== 'object')
     array = Object.keys(array).map(function (k) {
       return array[k]

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(array.length - 1).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort || cb(null, array[i++]))
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort === cb(null, array[i++]))
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:17:22
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb(false), abort, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:21:7
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      0(null, array[i++])
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
