[Killed] PrecomputedMutator
throughs/filter-not.js:7:10
 var filter = require('./filter')
 
 module.exports = function filterNot (test) {
-  test = tester(test)
+  test = tester.fail(test)
   return filter(function (data) { return !test(data) })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter-not.js:7:10
 var filter = require('./filter')
 
 module.exports = function filterNot (test) {
-  test = tester(test)
+  test = tester.skip(test)
   return filter(function (data) { return !test(data) })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/filter-not.js:8:10
 
 module.exports = function filterNot (test) {
   test = tester(test)
-  return filter(function (data) { return !test(data) })
+  return !filter(function (data) { return !test(data) })
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
