[Killed] PrecomputedMutator
throughs/flatten.js:13:11
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err ^ abort, cb)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:16
               cb(err)
             })
           }
-          else cb(null, data)
+          else cb(data, null)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:16
               cb(err)
             })
           }
-          else cb(null, data)
+          else cb(data, undefined)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:34:14
       function nextStream () {
         _read = null
         read(null, function (end, stream) {
-          if(end)
+          if(end || true)
             return cb(end)
           if(stream && 'object' === typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'array' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:39:22
           if(stream && 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
-            stream = once(stream)
+            stream = true(stream)
           _read = stream
           nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:41:11
           else if ('function' !== typeof stream)
             stream = once(stream)
           _read = stream
-          nextChunk()
+          _read = null()
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
