[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper !== 'string') return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper !== null && mapper !== undefined) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop.notAProperty(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1391709/throughs/map.js:56
  mapper = (stryMutAct_9fa48("641") ? prop.notAProperty : (stryCov_9fa48("641"), prop))(stryMutAct_9fa48("644") ? mapper.apply(this, [data]) : stryMutAct_9fa48("643") ? mapper.call(null, data) : stryMutAct_9fa48("6

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(mapper.apply(this, [data]))
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox1391709/throughs/map.js:56
  mapper = (stryMutAct_9fa48("641") ? prop.notAProperty : (stryCov_9fa48("641"), prop))(stryMutAct_9fa48("644") ? mapper.apply(this, [data]) : stryMutAct_9fa48("643") ? mapper.call(null, data) : stryMutAct_9fa48("6

[Killed] PrecomputedMutator
throughs/map.js:19:17
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(end, mapper(data))
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
