[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(cb(false)) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(cb(null)) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:25:40
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(ended = end) read(ended, cb(null, data))
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:30:16
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            cb(ended && !test(data))
           }
           else if(!test(data)) {

[Killed] PrecomputedMutator
throughs/take.js:32:25
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test(data.length)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
