[Killed] PrecomputedMutator
throughs/through.js:17:24
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) op && op && data(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(end && false)
         cb(end, data)
       })

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(end || true)
         cb(end, data)
       })

[Killed] PrecomputedMutator
throughs/through.js:19:17
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        cb(end, NaN)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
