[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field('data')
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
