[Survived] PrecomputedMutator
util/prop.js:6:42
     'string' == typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
+    ? function (data) { var v = key.exec(data.slice(1)); return v && v[0] }
     : key
   )
