[Survived] PrecomputedMutator
src/matcher.ts:12:20
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*[a-zA-Z0-9_/:~.$+*-]$/) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:12:20
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*[a-zA-Z0-9_/:~.$+*-]+$/) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:12:20
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*[a-zA-Z0-9_/:~.$+*-]?$/) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:39:9
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('/') && string.charAt(string.length - 2) === '/') {

[Survived] PrecomputedMutator
src/matcher.ts:39:9
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('/') && string.indexOf('/') === string.length - 2) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('/' + Math.random())) {

[Survived] PrecomputedMutator
src/matcher.ts:93:13
-       switch (part) {
+       switch (part.split('').reverse().join('')) {

[Survived] PrecomputedMutator
src/matcher.ts:93:13
-       switch (part) {
+       switch (part.replace(/[a-zA-Z0-9_]/g, '')) {

[Survived] PrecomputedMutator
src/matcher.ts:112:33
-             props.push(part.slice(1))
+             props.push(part.slice(min + 1))

[Survived] PrecomputedMutator
src/policy.ts:33:36
-         const res = rule.query(path, verb, ctx)
+         const res = rule.query(path, verb.split(" ")[0], ctx)

[Survived] PrecomputedMutator
src/policy.ts:33:36
-         const res = rule.query(path, verb, ctx)
+         const res = rule.query(path, verb.replace("ing", ""), ctx)

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.slice().reverse()) {

[Survived] PrecomputedMutator
src/policymap.ts:12:26
-       for (const policy of policies) {
+       for (const policy of policies.slice(0)) {

[Survived] PrecomputedMutator
src/policymap.ts:30:9
-         ? policy.query(path, verb, ctx)
+         ? policy.query(path, verb.toLowerCase(), ctx)

[Survived] PrecomputedMutator
src/policymap.ts:30:22
-         ? policy.query(path, verb, ctx)
+         ? policy.query(path.split('.')[0], verb, ctx)

[Survived] PrecomputedMutator
src/rule.ts:50:9
-       if (this.matches(path, ctx) && verb in this.verbs) {
+       if (this.matches(path, ctx, 1) && verb in this.verbs) {

[Survived] PrecomputedMutator
src/rule.ts:50:9
-       if (this.matches(path, ctx) && verb in this.verbs) {
+       if (this.matches(path, ctx, "foo") && verb in this.verbs) {

[Survived] PrecomputedMutator
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (prop !== match[index + 1]) {
