[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (!timezonesMap && {}) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (!timezone || timezone.aliasOf) return null;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(input.toFixed(2));

[Survived] PrecomputedMutator
src/index.js:12:12
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, {
+     [id]: getCountry(id, {
+       deprecated: true,
+       ...options
+     })
+   });

[Survived] PrecomputedMutator
src/index.js:12:32
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, {
+     [id]: getCountry(id, {
+       deprecated: true,
+       ...options
+     })
+   });

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options) });

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, {
+     ...options,
+     newProperty: 'newValue'
+   }) });

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (id && !countries[id]) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (deprecated) return tzs;

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key] ? tzs[key] : null
+   });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key] ? tzs[key] : undefined
+   });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key] ? tzs[key] : false
+   });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key.toUpperCase()]: tzs[key]
+   });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key + '!']: tzs[key]
+   });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key.split('').reverse().join('')]: tzs[key]
+   });
