[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (a == null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b == null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b.constructor !== Object) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:23
-       for (const key in a) {
+       for (const key in a || b) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:50:30
-           if (!isEqual(a[key], b[key])) {
+           if (!isEqual(a[key], b[key] !== undefined ? b[key] : null)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:91:36
-       const attributes = Object.keys(b).reduce<AttributeMap>((attrs, key) => {
+       const attributes = Object.keys(b || false).reduce<AttributeMap>((attrs, key) => {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(''); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:20:7
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' && a !== null) {

[Survived] PrecomputedMutator
src/Delta.ts:20:7
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' && a !== typeof b) {

[Survived] PrecomputedMutator
src/Delta.ts:62:45
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && Array.isArray(ops.ops.map(op => op.retain))) {

[Survived] PrecomputedMutator
src/Delta.ts:135:11
-         if (isEqual(newOp.attributes, lastOp.attributes)) {
+         if (isEqual(newOp.attributes, this.ops[index - 1].attributes)) {

[Survived] PrecomputedMutator
src/Delta.ts:135:19
-         if (isEqual(newOp.attributes, lastOp.attributes)) {
+         if (isEqual(newOp["attributes"], lastOp.attributes)) {

[Survived] PrecomputedMutator
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (index === 0) {

[Survived] PrecomputedMutator
src/Delta.ts:160:7
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(index, newOp.length, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:160:30
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(index, Math.random(), newOp);

[Survived] PrecomputedMutator
src/Delta.ts:190:19
-         target.push(op);
+         target.push(op.attributes ? {
+     insert: op[insert]
+   } : op);

[Survived] PrecomputedMutator
src/Delta.ts:190:19
-         target.push(op);
+         target.push(op.attributes ? {
+     retain: op.length
+   } : op);

[Survived] PrecomputedMutator
src/Delta.ts:223:27
-       while (index < end && iter.hasNext()) {
+       while (index < end && iter['hasNext']()) {

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         typeof firstOther.retain !== 'number' || firstOther.attributes == null

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         typeof firstOther.retain !== 'number' && firstOther.attributes != null

[Survived] PrecomputedMutator
src/Delta.ts:254:11
-         if (firstOther.retain - firstLeft > 0) {
+         if (firstOther.retain > firstLeft) {

[Survived] PrecomputedMutator
src/Delta.ts:259:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (thisIter.hasNext() + otherIter.hasNext()) {

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(undefined, newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:54
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], newOp['retain'])

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (!other) {

[Survived] PrecomputedMutator
src/Delta.ts:355:24
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], cursor + 1);

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.round(otherIter.peekLength(), length);

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength() + 10, length);

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), strings[0].length);

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), strings[1].length);

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(Math.max(opLength, otherIter.peekLength())));

[Survived] PrecomputedMutator
src/Delta.ts:375:15
-                 otherIter.peekLength(),
+                 other.length(),

[Survived] PrecomputedMutator
src/Delta.ts:408:11
-         if (iter.peekType() !== 'insert') {
+         if (iter.hasNext() && iter.peekType() !== 'insert') {

[Survived] PrecomputedMutator
src/Delta.ts:437:11
-         if (op.insert) {
+         if (op.insert + 1) {

[Survived] PrecomputedMutator
src/Delta.ts:439:18
-         } else if (typeof op.retain === 'number' && op.attributes == null) {
+         } else if (typeof op.retain === 'number' && !op.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain ? op.attributes : op.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (op.retain instanceof Object) {

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (typeof op.retain === 'object' && op.retain !== {}) {

[Survived] PrecomputedMutator
src/Delta.ts:491:9
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next()));

[Survived] PrecomputedMutator
src/Delta.ts:495:56
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(thisIter.peekLength(), 1);

[Survived] PrecomputedMutator
src/Delta.ts:495:56
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(thisIter.peekLength(), otherIter.hasNext());

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               Object.values(thisData).length && thisData !== null && Object.values(otherData).length && otherData !== null

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               typeof thisData === 'object' && thisData !== null && typeof otherData === 'object' && otherData !== null && typeof Object.values(thisData)[0] === 'object' && typeof Object.values(otherData)[0] === 'object'

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module === 'number') {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module === undefined) {

[Survived] PrecomputedMutator
src/Op.ts:16:16
-       } else if (typeof op.retain === 'number') {
+       } else if (op.retain > 0) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'function') {

[Survived] PrecomputedMutator
src/OpIterator.ts:25:34
-         const opLength = Op.length(nextOp);
+         const opLength = Op.length({
+     ...nextOp,
+     offset: Math.random()
+   });

[Survived] PrecomputedMutator
src/OpIterator.ts:25:34
-         const opLength = Op.length(nextOp);
+         const opLength = Op.length({
+     ...nextOp,
+     offset: nextOp.offset + 1
+   });

[Survived] PrecomputedMutator
src/OpIterator.ts:92:9
-       if (!this.hasNext()) {
+       if (this.ops.length === 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.offset + 1 === 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:95:29
-         return this.ops.slice(this.index);
+         return this.ops.slice(this.index + this.offset);
