[Survived] PrecomputedMutator
lib/request.js:10:11
-         if (res.statusCode !== 200) {
+         if (res.statusCode != 200) {

[Survived] PrecomputedMutator
lib/request.js:21:38
-           .once('close', () => resolve({ filename: dest }));
+           .once('close', () => resolve({
+     filename: dest,
+     extraProperty: 'foo'
+   }));

[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (options.url == null) {

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.url is invalid'));

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new TypeError('The options.url is not a string'));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error("The options.dest is not a string"));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error("The options.dest is not a function"));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error("The options.dest is not a valid destination"));

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (path.extname(options.dest).length === 0) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.substr(1));

[Survived] PrecomputedMutator
index.js:20:32
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest.replace('foo', 'bar'), decodedBasename);

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest) && !path.isAbsolute(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest) && path.isAbsolute(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:8
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.dirname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:8
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.extname(options.dest)) {

[Survived] PrecomputedMutator
index.js:25:33
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(__dirname + "/", options.dest);
