[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (!isFinite(latitude) || !isFinite(longitude)) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!point.coordinates) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (point.coordinates.length < 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.hasOwnProperty('type') && !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.hasOwnProperty('geometry')) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (point.coordinates.length != 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (Object.prototype.hasOwnProperty()) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:48
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') || !object['hasOwnProperty']('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 1 || r < -1 ? 0 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:125:49
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(-φ1) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(0) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(-Number(bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing + 180));

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(180 - bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(360 - bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(cos(-φ1));

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(sin(φ1));

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(cos(φ1) * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ - Math.PI), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(-θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(Math.PI / 2 + θ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, φ2);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ2 + 0.005);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ2 - 0.005);

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(λ2 * 5) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, 42);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, new GeoPoint(1, 1));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(GeoPoint.calculateDistance(this, point));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.calculateDistance(point));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(Math.abs(GeoPoint.calculateDistance(this, point)));

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(NaN, point);
