[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, "utf8")

[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options["encoding"])

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, 'utf8')

[Survived] PrecomputedMutator
index.js:25:22
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data + '', options ? options.reviver : null)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.reviver + 1)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, null)

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, "utf8")

[Survived] PrecomputedMutator
index.js:66:30
-     const str = stringify(obj, options)
+     const str = stringify(obj, {
+     ...options
+   })

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options = {
+     ...options,
+     throws: false
+   })

[Survived] PrecomputedMutator
utils.js:5:29
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/\n/g, EOL.toUpperCase()) + EOF

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (JSON.stringify(content) !== "\\ufeff") content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, '\r')
