[Survived] PrecomputedMutator
index.js:10:17
-     rules.unshift([match, result])
+     rules.unshift(function () {
+     return [match, result];
+   }())

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|sh$/i, function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|(s(h)?)$/i, function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|ssh$/i, function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:22:9
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus|foo/i, function(w) { return w.substr(0, w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:22:9
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus|bar/i, function(w) { return w.substr(0, w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:22:9
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus|qux/i, function(w) { return w.substr(0, w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:22:80
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr('', w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:23:9
-   addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+   addRule(/crisis|thesis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });

[Survived] PrecomputedMutator
index.js:27:1
-   addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
+   addRule(/[^aeiouy]o$/i, function (w) {
+     return w + 'os';
+   });

[Survived] PrecomputedMutator
index.js:28:9
-   addRule(/[^aeiouy]o$/i, function(w) { return w + 'es' });
+   addRule(/[^aeiouy]o{1,3}$/i, function(w) { return w + 'es' });

[Survived] PrecomputedMutator
index.js:40:1
-   addRule('bacterium', 'bacteria')
+   addRule('bacteriums', 'bacteria')

[Survived] PrecomputedMutator
index.js:40:1
-   addRule('bacterium', 'bacteria')
+   addRule('bacteria', 'bacteriums')

[Survived] PrecomputedMutator
index.js:40:9
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium' + 's', 'bacteria')

[Survived] PrecomputedMutator
index.js:40:9
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium'[0] + 'ea', 'bacteria')

[Survived] PrecomputedMutator
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', 'bacteriuma')

[Survived] PrecomputedMutator
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', 'bacteriaa')

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('celo', 'cello')

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('cello', 'violino')

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('youtube', 'youtubes')

[Survived] PrecomputedMutator
index.js:42:9
-   addRule('cello', 'cellos')
+   addRule('cele', 'cellos')

[Survived] PrecomputedMutator
index.js:42:18
-   addRule('cello', 'cellos')
+   addRule('cello', 'c')

[Survived] PrecomputedMutator
index.js:42:18
-   addRule('cello', 'cellos')
+   addRule('cello', 'celloes')

[Survived] PrecomputedMutator
index.js:43:1
-   addRule('die', 'dice')
+   addRule('die', 'dice', 1)

[Survived] PrecomputedMutator
index.js:43:1
-   addRule('die', 'dice')
+   addRule('die', 'dice', function () {})

[Survived] PrecomputedMutator
index.js:43:1
-   addRule('die', 'dice')
+   addRule('die', 'dice', function (word, num) {
+     return word + 's';
+   })

[Survived] PrecomputedMutator
index.js:49:26
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?man$/i, function (w) {
+     return w.replace(/a/, function () {
+       return 'e';
+     });
+   })

[Survived] PrecomputedMutator
index.js:49:57
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/[ab]/, 'e') })

[Survived] PrecomputedMutator
index.js:63:71
-   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, clothes.concat(games, illnesses, misc)).join('|') + ')s\\b', 'i'), function(w) { return w})

[Survived] PrecomputedMutator
index.js:63:71
-   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, tools.concat(games, illnesses, misc)).join('|') + ')s\\b', 'i'), function(w) { return w})

[Survived] PrecomputedMutator
index.js:63:71
-   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, [].concat(games, illnesses, misc)).join('|') + ')s\\b', 'i'), function(w) { return w})

[Survived] PrecomputedMutator
index.js:67:9
-   addRule(/ics$/i, function(w) { return w })
+   addRule(/ics$|rics$/i, function(w) { return w })

[Survived] PrecomputedMutator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || num === false) {

[Survived] PrecomputedMutator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || num !== 1) {

[Survived] PrecomputedMutator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || NaN) {

[Survived] PrecomputedMutator
index.js:77:17
-       for (i = 0; i < rules.length; i++) {
+       for (i = 0; i >= 0 && i < rules.length; i++) {

[Survived] PrecomputedMutator
index.js:80:16
-         if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+         if (type(rules[i][0]) === 'RegExp' && rule[0].test(word)) {

[Survived] PrecomputedMutator
index.js:81:21
-           return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
+           return type(rule[(1, 1)]) === 'Function' ? rule[1](word, rule[0]) : rule[1]

[Survived] PrecomputedMutator
index.js:83:11
-         if (type(rule[0]) === 'String' && rule[0] === word) {
+         if (type(rule[0]) === 'String' && rule[0] === word.toLowerCase()) {

[Survived] PrecomputedMutator
index.js:84:21
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type('') === 'Function' ? rule[1](word) : rule[1]

[Survived] PrecomputedMutator
index.js:84:21
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(null) === 'Function' ? rule[1](word) : rule[1]

[Survived] PrecomputedMutator
index.js:84:47
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(rule[1]) === 'Function' ? 42(word) : rule[1]

[Survived] PrecomputedMutator
index.js:84:55
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(rule[1]) === 'Function' ? rule[1](word + 'es') : rule[1]

[Survived] PrecomputedMutator
index.js:84:55
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(rule[1]) === 'Function' ? rule[1](word + 's') : rule[1]

[Survived] PrecomputedMutator
index.js:84:55
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return type(rule[1]) === 'Function' ? rule[1](word.substr(1) + 'es') : rule[1]

[Survived] PrecomputedMutator
index.js:105:14
-         return plural(this, num)
+         return plural(true)

[Survived] PrecomputedMutator
index.js:105:14
-         return plural(this, num)
+         return plural(`num - 1`)

[Survived] PrecomputedMutator
index.js:105:14
-         return plural(this, num)
+         return plural(`num + 1`)

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, `num * num`)

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, `num + 1`)

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, `Math.random()`)
