[Killed] PrecomputedMutator
index.js:11:1
 
 exports.pull = exports
 
-for(var k in sources)
-  exports[k] = sources[k]
+for (var k in exports) exports[k] = sources[k];
 
 for(var k in throughs)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
index.js:11:14
 
 exports.pull = exports
 
-for(var k in sources)
+for(var k in sinks)
   exports[k] = sources[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
index.js:14:1
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
-  exports[k] = throughs[k]
+for (var k in throughs.keys()) exports[k] = throughs[k];
 
 for(var k in sinks)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/index.js:68
  for (var k in throughs.keys()) exports[k] = throughs[k];
                         ^

[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in throughs.map(function (item) {
+  return item * 2;
+}))
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/test/abort-stalled.js:65
test('through', pull.through())
                     ^

[Killed] PrecomputedMutator
index.js:17:1
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
-  exports[k] = sinks[k]
+for (var k in throughs) exports[k] = sinks[k];
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/test/abort-stalled.js:65
test('through', pull.through())
                     ^

[Killed] PrecomputedMutator
index.js:17:14
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
+for(var k in sources)
   exports[k] = sinks[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/test/abort-stalled.js:54
      pull.drain(function (e) {
           ^
