[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'object' && a.length === 1) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (a.length > 1) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:7:32
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
+    for(var i = 0; i < length; i += 2)
       args[i] = arguments[i]
     return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:7:5
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
-      args[i] = arguments[i]
+    for (var i = 1; i < length; i++) args[i] = arguments[i];
     return function (read) {
       if (args == null) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args || null) {
         throw new TypeError("partial sink should only be called once!")
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args?.length === 0) {
         throw new TypeError("partial sink should only be called once!")
       }

[Killed] PrecomputedMutator
pull.js:20:15
       args = null
 
       // Prioritize common case of small number of pulls.
-      switch (length) {
+      switch (length - 1) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:20:15
       args = null
 
       // Prioritize common case of small number of pulls.
-      switch (length) {
+      switch (length * 2) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])

[Survived] PrecomputedMutator
pull.js:21:27
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read / 2, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Survived] PrecomputedMutator
pull.js:21:33
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read, ref[1])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Killed] PrecomputedMutator
pull.js:22:41
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(read, ref[0], ref[0])
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:22:33
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(read, ref[1], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:22
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[0], ref[1], ref[3])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:27
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read[i], ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:24:57
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[0], ref[1], ref[2], ref[2])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:24:22
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[0], ref[1], ref[3])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:26:21
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.unshift(read - 1)
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:26:21
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.unshift(read + 1)
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref = null)
       }
     }

[Survived] PrecomputedMutator
pull.js:27:16
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.curry(null, ref)
       }
     }

[Killed] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read || typeof read.source === 'function') {
     read = read.source
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/throughs/through.js:61
      return read(end, function (end, data) {
             ^

[Survived] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read ? typeof read.source === 'function' : false) {
     read = read.source
   }

[Killed] PrecomputedMutator
pull.js:38:31
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
+  for (var i = 1; i < length; i += 2) {
     var s = arguments[i]
     if (typeof s === 'function') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/test/abort-stalled.js:38
    else _read(true, cb)
         ^

[Killed] PrecomputedMutator
pull.js:38:3
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
-    var s = arguments[i]
-    if (typeof s === 'function') {
-      read = s(read)
-    } else if (s && typeof s === 'object') {
-      s.sink(read)
-      read = s.source
-    }
-  }
+  for (var i = 0; i < length; i++) {
+  var s = arguments[i];
+  if (typeof s === 'function') {
+    read = s(read);
+  } else if (s && typeof s === 'object') {
+    s.sink(read);
+    read = s.source;
+  }
+}
 
   return read
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/test/abort-stalled.js:11
      cb(null, values[i++])
      ^

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s.sink(read)) {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s.source === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:41:14
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s[""](read)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/pull.js:127
        read = (stryMutAct_9fa48("114") ? s[""] : (stryCov_9fa48("114"), s))(stryMutAct_9fa48("116") ? read || {} : stryMutAct_9fa48("115") ? read || null : (stryCov_9fa48("115", "116"), read));

[Survived] PrecomputedMutator
pull.js:41:16
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s(read || {})
     } else if (s && typeof s === 'object') {
       s.sink(read)

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && s.length > 0) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && typeof s.sink === 'function') {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink("hello")
       read = s.source
     }

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink(console.log("hello"))
       read = s.source
     }
