[Killed] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (!done()) {
     doneLackingErr = new Error('no done callback supplied')
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (!done && false) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Killed] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(abort()) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/sinks/drain.js:60
    if (stryMutAct_9fa48("130") ? abort() : stryMutAct_9fa48("129") ? !abort : (stryCov_9fa48("129", "130"), abort)) return stryMutAct_9fa48("131") ? sink.aborch()
                                  ^

[Killed] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(!abort) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(!loop) {
           cbed = false
           read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(loop + 2) {
           cbed = false
           read(null, function (end, data) {

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(undefined) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(null) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end instanceof Error) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end > 5) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(console.log('error'))
                 throw end
               }

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(doneLackingErr = new Error('different error message'))
                 throw end
               }

[Killed] PrecomputedMutator
sinks/drain.js:32:21
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false !== op(data) || abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, null)
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, function () {})
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:36:21
               loop = false
               read(abort || true, done || function () {})
             }
-            else if(!loop){
+            else if(false){
               next()
             }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:36:21
               loop = false
               read(abort || true, done || function () {})
             }
-            else if(!loop){
+            else if(!cbed){
               next()
             }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(cbed) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(!read) {
             loop = false
             return

[Killed] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if(err instanceof Error)
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if(typeof err !== 'function')
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:33
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort, cb & function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:21
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort && cb || function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
