[Killed] PrecomputedMutator
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(!test)
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(test(cb))
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:12:12
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = !prop(test) || id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:12:17
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = prop(test && false) || id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:15:13
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(test(12345)) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:15:8
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(test(data[0])) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:17:16
   return drain(function (data) {
     if(test(data)) {
       ended = true
-      cb(null, data)
+      cb(null, null)
     return false
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:17:16
   return drain(function (data) {
     if(test(data)) {
       ended = true
-      cb(null, data)
+      cb(null, data + 1)
     return false
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(!ended) return //already called back
     cb(err === true ? null : err, null)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(ended && cb) return //already called back
     cb(err === true ? null : err, null)
   })

[Killed] PrecomputedMutator
sinks/find.js:22:35
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(err === true ? null : err, '')
   })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:22:35
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(err === true ? null : err, undefined)
   })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
