[Survived] PrecomputedMutator
sinks/log.js:7:5
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    module.parent.log(data)
   }, done)
 }

[Survived] PrecomputedMutator
sinks/log.js:7:17
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    console.log(console.log(data.toUpperCase()))
   }, done)
 }
