[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(null) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(undefined) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:8:24
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = reducer(acc, data + 1)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:8:19
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = reducer(acc + 1, data)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:10:5
   var sink = drain(function (data) {
     acc = reducer(acc, data)
   }, function (err) {
-    cb(err, acc)
+    cb(err)
   })
   if (arguments.length === 2)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:10:8
   var sink = drain(function (data) {
     acc = reducer(acc, data)
   }, function (err) {
-    cb(err, acc)
+    cb(null, acc)
   })
   if (arguments.length === 2)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (acc !== undefined)
     return function (source) {
       source(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/sinks/collect.js:53
    arr.push(stryMutAct_9fa48("125") ? "item" + "hello" : stryMutAct_9fa48("124") ? "world" : stryMutAct_9fa48("123") ? "hello" : (stryCov_9fa48("123", "124", "125"), item));
        ^

[Killed] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (arguments.length > 2)
     return function (source) {
       source(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(end !== true) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(acc - data) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:17:26
       source(null, function (end, data) {
         //if ended immediately, and no initial...
         if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
+        acc = data; sink(undefined)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:17:21
       source(null, function (end, data) {
         //if ended immediately, and no initial...
         if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
+        acc = data; acc(source)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
