[Killed] PrecomputedMutator
sources/empty.js:5:5
 //a stream that ends immediately.
 module.exports = function empty () {
   return function (abort, cb) {
-    cb(true)
+    undefined(true)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/empty.js:5:8
 //a stream that ends immediately.
 module.exports = function empty () {
   return function (abort, cb) {
-    cb(true)
+    cb("string")
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
