[Killed] PrecomputedMutator
sources/error.js:5:5
 //a stream that errors immediately.
 module.exports = function error (err) {
   return function (abort, cb) {
-    cb(err)
+    null(err)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/error.js:5:8
 //a stream that errors immediately.
 module.exports = function error (err) {
   return function (abort, cb) {
-    cb(err)
+    cb('error')
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
