[Killed] PrecomputedMutator
sources/infinite.js:5:26
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && !!cb(end)
     return cb(null, generate())
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/sources/infinite.js:53

[Killed] PrecomputedMutator
sources/infinite.js:5:26
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && cb + 1(end)
     return cb(null, generate())
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/infinite.js:6:15
   generate = generate || Math.random
   return function (end, cb) {
     if(end) return cb && cb(end)
-    return cb(null, generate())
+    return cb({}, generate())
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/infinite.js:6:21
   generate = generate || Math.random
   return function (end, cb) {
     if(end) return cb && cb(end)
-    return cb(null, generate())
+    return cb(null, generate + 1())
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
