[Timeout] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(!abort)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(abort !== null)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] PrecomputedMutator
sources/once.js:7:26
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, abort && onAbort, onAbort)
     if(value != null) {
       var _value = value; value = null

[Survived] PrecomputedMutator
sources/once.js:7:14
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abort(cb, abort, onAbort)
     if(value != null) {
       var _value = value; value = null

[Killed] PrecomputedMutator
sources/once.js:8:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
+    if(value === null) {
       var _value = value; value = null
       cb(null, _value)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:8:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
+    if(value == null) {
       var _value = value; value = null
       cb(null, _value)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:10:7
       return abortCb(cb, abort, onAbort)
     if(value != null) {
       var _value = value; value = null
-      cb(null, _value)
+      cb(undefined)
     } else
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:10:16
       return abortCb(cb, abort, onAbort)
     if(value != null) {
       var _value = value; value = null
-      cb(null, _value)
+      cb(null, _value + 1)
     } else
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:12:7
       var _value = value; value = null
       cb(null, _value)
     } else
-      cb(true)
+      _value = _value + value(true)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:12:7
       var _value = value; value = null
       cb(null, _value)
     } else
-      cb(true)
+      _value = value(true)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
