[Survived] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper === null) return id
   mapper = prop(mapper)
   return function (read) {

[Survived] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(Object.prototype.hasOwnProperty.call(mapper, 'simple')) return id
   mapper = prop(mapper)
   return function (read) {

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(e => null)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop.length(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/throughs/map.js:56
  mapper = (stryMutAct_9fa48("574") ? prop.length : stryMutAct_9fa48("573") ? prop[0] : (stryCov_9fa48("573", "574"), prop))(stryMutAct_9fa48("577") ? e => e.x : stryMutAct_9fa48("576") ? e => null : stryMutAct_9fa

[Killed] PrecomputedMutator
throughs/map.js:13:23
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? ''(data) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:13:23
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? 0(data) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:16:23
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return cb(cb(end, undefined))
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:16:23
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return cb(cb(abort, data))
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:19:12
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(!end, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:19:17
             return cb(err)
           })
         }
-        cb(end, data)
+        cb(end, null)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
