[Killed] PrecomputedMutator
throughs/non-unique.js:7:10
 
 //passes an item through when you see it for the second time.
 module.exports = function nonUnique (field) {
-  return unique(field, true)
+  return unique(field, false)
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/non-unique.js:7:10
 
 //passes an item through when you see it for the second time.
 module.exports = function nonUnique (field) {
-  return unique(field, true)
+  return unique(field, field)
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
