[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(test() > 10) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/throughs/take.js:55
  if (stryMutAct_9fa48("606") ? test() > 10 : stryMutAct_9fa48("605") ? typeof test === 'string' : stryMutAct_9fa48("604") ? test.length > 10 : (stryCov_9fa48("604", "605", "606"), 'number' === typeof test)) {

[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(test.length > 10) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:19:23
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; false(err || true)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:19:23
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; undefined(err || true)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:24:10
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended || end) last ? terminate(cb) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(function () {}) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:25:33
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(ended = end) read(!ended, cb)
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:25:40
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(ended = end) read(ended, read(ended, cb))
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(ended && !end) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(end || !ended) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:30:13
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            undefined(ended)
           }
           else if(!test(data)) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:30:16
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            cb(!ended)
           }
           else if(!test(data)) {

[Killed] PrecomputedMutator
throughs/take.js:32:25
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test(data * 2)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:32:25
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test(data / 2)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:34:29
           }
           else if(!test(data)) {
             ended = true
-            last ? cb(null, data) : terminate(cb)
+            last ? cb(null, undefined) : terminate(cb)
           }
           else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:34:29
           }
           else if(!test(data)) {
             ended = true
-            last ? cb(null, data) : terminate(cb)
+            last ? cb(null, false) : terminate(cb)
           }
           else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:13
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(undefined)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:22
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(null, !data)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
