[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(!a && onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(a && !onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd === null(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    !onEnd(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end == true) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(end => end === 'end')
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Killed] PrecomputedMutator
throughs/through.js:17:24
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) op && 1 + data(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:17:12
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(a === false) op && op(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(false)
         cb(end, data)
       })

[Survived] PrecomputedMutator
throughs/through.js:18:19
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else once(null)
         cb(end, data)
       })

[Killed] PrecomputedMutator
throughs/through.js:19:9
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        data(end, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/throughs/through.js:63

[Killed] PrecomputedMutator
throughs/through.js:19:9
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        abort(end, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox3274503/throughs/through.js:63
