[Killed] PrecomputedMutator
throughs/unique.js:9:16
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop(field.toUpperCase()) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:9:16
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop("field") || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field(false)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:15
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field.length(data)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:13:8
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(seen[key] === 1) return !!invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:13:8
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(!seen[key]) return !!invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
