[Killed] PrecomputedMutator
util/abort-cb.js:2:3
 module.exports = function abortCb(cb, abort, onAbort) {
-  cb(abort)
+  typeof abort === 'function'(abort)
   onAbort && onAbort(abort === true ? null: abort)
   return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
util/abort-cb.js:2:6
 module.exports = function abortCb(cb, abort, onAbort) {
-  cb(abort)
+  cb(undefined)
   onAbort && onAbort(abort === true ? null: abort)
   return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
util/abort-cb.js:3:22
 module.exports = function abortCb(cb, abort, onAbort) {
   cb(abort)
-  onAbort && onAbort(abort === true ? null: abort)
+  onAbort && onAbort(abort === false ? null : abort)
   return
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
util/abort-cb.js:3:22
 module.exports = function abortCb(cb, abort, onAbort) {
   cb(abort)
-  onAbort && onAbort(abort === true ? null: abort)
+  onAbort && onAbort(abort === false && !onAbort)
   return
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
