[Survived] PrecomputedMutator
util/prop.js:6:42
     'string' == typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
+    ? function (data) { var v = key.exec(Math.random()); return v && v[0] }
     : key
   )

[Survived] PrecomputedMutator
util/prop.js:6:42
     'string' == typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
+    ? function (data) { var v = key.exec(key + ''); return v && v[0] }
     : key
   )
