[Killed] PrecomputedMutator
util/tester.js:8:32
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return !test.test(data) }
     : prop (test) || id
   )
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
util/tester.js:8:42
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return test.test(null) }
     : prop (test) || id
   )

[Killed] PrecomputedMutator
util/tester.js:9:13
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
-    : prop (test) || id
+    : prop (test.test(data)) || id
   )
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
util/tester.js:9:13
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
-    : prop (test) || id
+    : prop (data[test]) || id
   )
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
