[Survived] PrecomputedMutator
src/matcher.ts:12:9
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (!spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/)) {

[Survived] PrecomputedMutator
src/matcher.ts:12:9
-       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+       if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) == null) {

[Survived] PrecomputedMutator
src/matcher.ts:15:9
-       if (spec.match(/^\//) === null) {
+       if (spec.charAt(0) !== '/') {

[Survived] PrecomputedMutator
src/matcher.ts:18:9
-       if (spec.match(/\/\//) !== null) {
+       if (spec.match(/(\/\/)/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:18:9
-       if (spec.match(/\/\//) !== null) {
+       if (spec.match(/[/]{2}/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:26:20
-       if (spec.match(/[^/]:|:\/|:$/) !== null) {
+       if (spec.match(/:\/|[^/]:|:$/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:29:20
-       if (spec.match(/^.+\/$/) !== null) {
+       if (spec.match(/^.+\/+$/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:39:9
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length === 0) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('B')) {

[Survived] PrecomputedMutator
src/matcher.ts:67:18
-         } else if (min > 0) {
+         } else if (min >= 1) {

[Survived] PrecomputedMutator
src/matcher.ts:92:33
-     for (const part of spec.split('/').slice(1).reverse()) {
+     for (const part of spec.split('\/').slice(1).reverse()) {

[Survived] PrecomputedMutator
src/matcher.ts:93:13
-       switch (part) {
+       switch (part.split('/').pop()) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.search(/:.+/) !== -1) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:([^/]+)/) !== null) {

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.filter(() => true)) {

[Survived] PrecomputedMutator
src/policy.ts:49:24
-         if (rule.matches(path, ctx)) {
+         if (rule.matches(path.substring(0), ctx)) {

[Survived] PrecomputedMutator
src/policymap.ts:7:24
-       super(policies.map((policy) => [policy.name, policy]))
+       super(policies.map(policy => [policy.name.split(' ').join(''), policy]))

[Survived] PrecomputedMutator
src/policymap.ts:12:5
-       for (const policy of policies) {
-         this.set(policy.name, policy)
-       }
+       for (const policy of policies.reverse()) {
+     this.set(policy.name, policy);
+   }

[Survived] PrecomputedMutator
src/policymap.ts:39:29
-       const policy = this.get(name)
+       const policy = this.get(name.split(' ').join())

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.filter(v => v)) {

[Survived] PrecomputedMutator
src/rule.ts:69:42
-         for (let index = 0; index < count; index++) {
+         for (let index = 0; index < count; index += 10) {

[Survived] PrecomputedMutator
src/rule.ts:83:24
-       for (const verb in this.verbs) {
+       for (const verb in Object.assign({}, this.verbs)) {
