[Survived] PrecomputedMutator
src/build-timezone.js:34:30
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(-hours)}:${getNumStr(min)}`;

[Survived] PrecomputedMutator
src/index.js:12:55
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, {
+     ...options,
+     allCountries: []
+   }) });

[Survived] PrecomputedMutator
src/index.js:12:55
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, {
+     ...options,
+     countryById: id => getCountry(id)
+   }) });

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones > 0) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:18:38
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, {
+     ...options,
+     timezone: 'INVALID_TIMEZONE'
+   });

[Survived] PrecomputedMutator
src/index.js:18:38
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, {
+     ...options,
+     countryId: 'INVALID_COUNTRY_ID'
+   });

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id.split('-')[0]));

[Survived] PrecomputedMutator
src/index.js:23:40
-     return deliverCountry(countries[id], options);
+     return deliverCountry(countries[id], {
+     ...options,
+     deprecated: options.deprecated === true
+   });

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.values(data.timezones).length).length;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.entries(data.timezones).length).length;

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(...[tzName, options]);

[Survived] PrecomputedMutator
src/index.js:54:19
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId.toUpperCase(), options);

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (deprecated && true) return tzs;

[Survived] PrecomputedMutator
src/index.js:64:45
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev = prev || tzs[key], { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: Array.isArray(tzs[key]) ? tzs[key][0] : tzs[key]
+   });
