[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (typeof a === 'number') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b instanceof Function) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (!(a[key] !== undefined) || b[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (typeof b != 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:88:9
-       if (!priority) {
+       if (!priority && true) {

[Survived] PrecomputedMutator
src/Delta.ts:60:9
-       if (Array.isArray(ops)) {
+       if (Array.isArray(ops) && !(ops instanceof Delta)) {

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops != null && ops.hasOwnProperty('ops') && Array.isArray(ops.ops)) {

[Survived] PrecomputedMutator
src/Delta.ts:130:13
-           if (typeof lastOp !== 'object') {
+           if (!lastOp) {

[Survived] PrecomputedMutator
src/Delta.ts:146:11
-             typeof newOp.retain === 'number' &&
-             typeof lastOp.retain === 'number'
+             !isNaN(lastOp.retain) && !isNaN(newOp.retain)

[Survived] PrecomputedMutator
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (index < this.ops.length / 2) {

[Survived] PrecomputedMutator
src/Delta.ts:160:23
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice((this.ops.length + 1) / 2, 0, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:268:13
-           if (otherOp.retain) {
+           if (otherOp.retain ? otherOp.retain : 0) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               otherIter.peekLength() <= 0

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (!this) {

[Survived] PrecomputedMutator
src/Delta.ts:355:41
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings.reverse()[0], cursor);

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], 1 + 1);

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(Math.floor(otherIter.peekLength()), length);

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(Math.ceil(otherIter.peekLength()), length);

[Survived] PrecomputedMutator
src/Delta.ts:420:29
-           line.push(iter.next(index));
+           line.push(iter.next(1));

[Survived] PrecomputedMutator
src/Delta.ts:422:39
-           if (predicate(line, iter.next(1).attributes || {}, i) === false) {
+           if (predicate(line, iter.next(i + 1).attributes || {}, i) === false) {

[Survived] PrecomputedMutator
src/Delta.ts:440:25
-           inverted.retain(op.retain);
+           inverted.retain(op['retain']);

[Survived] PrecomputedMutator
src/Delta.ts:466:31
-             AttributeMap.invert(op.attributes, baseOp.attributes),
+             AttributeMap.invert(op["attributes"], baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:501:20
-           } else if (otherOp.delete) {
+           } else if (otherOp.retain ? 0 : 1) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof module === 'undefined' || typeof module === 'null') {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (op.retain === NaN) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'number' && op.retain % 2 === 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:19:9
-       if (!length) {
+       if (length == null) {

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             typeof nextOp.retain === 'object' && nextOp.retain !== {}

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           op.retain && op.retain !== null
