[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (options.url ? false : true) {

[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (options.url === undefined || options.url === null) {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest && typeof options.dest !== 'string') {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest || !options.url) {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest || options.url.indexOf('.') === -1) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(options.url);

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(decodeURIComponent(options.url));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.basename(options.dest) === '') {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.dirname(options.dest) === '') {

[Survived] PrecomputedMutator
index.js:25:33
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(".", options.dest);
