[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (typeof latitude !== 'number' || longitude === null) {

[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude > 90 || latitude < -90 || longitude > 180 || longitude < -180) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject({
+     type: 'Point',
+     coordinates: []
+   })) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.coordinates.length < 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.coordinates) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!point.coordinates.hasOwnProperty('length') || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('longitude') || !object.hasOwnProperty('latitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (object.hasOwnProperty('latitude') && !object.hasOwnProperty('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:120:24
-       const φ1 = deg2rad(point1.latitude), φ2 = deg2rad(point2.latitude);
+       const φ1 = deg2rad(point1["latitude"]), φ2 = deg2rad(point2.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Math.abs(Number(bearing)));

[Survived] PrecomputedMutator
src/geo-point.ts:147:24
-       const λ1 = deg2rad(coordinate.longitude);
+       const λ1 = deg2rad(Math.floor(coordinate.longitude));

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(sin(deg2rad(0))), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(Math.sin(deg2rad(0))), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:154:21
-       const φ2 = asin(sinφ2);
+       const φ2 = asin(sinφ2 * cosθ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(λ1, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, x + y);

[Survived] PrecomputedMutator
src/geo-point.ts:186:49
-       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(
+       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * (Math.PI / 180) * 1.00001) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(

[Survived] PrecomputedMutator
src/geo-point.ts:186:101
-       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(
+       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude / (180 / Math.PI))) / Math.PI) / 2 * Math.pow(

[Survived] PrecomputedMutator
src/geo-point.ts:186:101
-       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(
+       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * 3.141592 / 180)) / Math.PI) / 2 * Math.pow(

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing % 360);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, coordinate);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(1 + 1, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.longitude / 2, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, GeoPoint.fromLatLngArray([point.longitude, point.latitude]));

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, GeoPoint.calculateDestination(point, 0, 180));

[Survived] PrecomputedMutator
src/geo-point.ts:297:50
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(precision + 0.5));
