[Survived] PrecomputedMutator
src/build-country.js:32:29
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (!result[country]) Object.assign(result, {
+     [country]: {
+       current: [],
+       all: []
+     },
+     [country]: {
+       current: [],
+       all: []
+     }
+   });

[Survived] PrecomputedMutator
src/build-country.js:32:29
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (!result[country]) Object.assign(result, {
+     [country]: {
+       current: [id],
+       all: []
+     },
+     [country]: {
+       current: [],
+       all: []
+     }
+   });

[Survived] PrecomputedMutator
src/index.js:12:26
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(Object.assign({
+     ...prev
+   }, {
+     [id]: getCountry(id, options)
+   }), { [id]: getCountry(id, options) });

[Survived] PrecomputedMutator
src/index.js:12:55
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, {
+     ...options,
+     country: 'USA'
+   }) });

[Survived] PrecomputedMutator
src/index.js:18:10
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, options, undefined);

[Survived] PrecomputedMutator
src/index.js:18:10
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, options, true);

[Survived] PrecomputedMutator
src/index.js:18:10
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, options, -1);

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (typeof countries[id] === 'undefined') memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(timezones)).length;

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated || tzs[key].primary) Object.assign(prev, { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key + 1]: tzs[key]
+   });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key.toUpperCase()]: tzs[key]
+   });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key + '_']: tzs[key]
+   });
