[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('The options.dest is not a valid URL'));

[Survived] PrecomputedMutator
index.js:17:24
-         const basename = path.basename(pathname);
+         const basename = path.normalize(pathname);

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.url)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (options.dest[0] === '/') {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!options.dest.startsWith('http')) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute("foo")) {
