[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude && longitude && (latitude === longitude || latitude === -longitude)) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (Math.abs(latitude) > 90) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude % 360 == -180) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (Math.abs(longitude) >= 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (typeof point.type !== 'string') {

[Survived] PrecomputedMutator
src/geo-point.ts:64:10
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point['hasOwnProperty']('type') || !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.coordinates.length > 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.coordinates[0] > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (isObject(object) === false) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (object.hasOwnProperty('prototype')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(Math.round(r) > 1 ? 1 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(acos(r).toFixed(2) > 1 ? 1 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:125:59
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ % 360);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(-bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:149:36
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = Math.sin(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(λ1);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(deg2rad(coordinate.longitude), x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, Number.MAX_VALUE);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg((φ1 + φ2) / 2);

[Survived] PrecomputedMutator
src/geo-point.ts:185:26
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.floor(Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom)));

[Survived] PrecomputedMutator
src/geo-point.ts:185:72
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(-2, zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, 180 - bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateDestination(this, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude + this.latitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(10, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point2);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, number);

[Survived] PrecomputedMutator
src/geo-point.ts:272:12
-       return GeoPoint.toTile(this, zoom);
+       return GeoPoint.toTile(GeoPoint.fromLngLatArray([this.longitude, this.latitude]), zoom);
