[Killed] PrecomputedMutator
index.js:11:14
 
 exports.pull = exports
 
-for(var k in sources)
+for(var k in throughs[k])
   exports[k] = sources[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in {})
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/test/abort-stalled.js:65
test('through', pull.through())
                     ^

[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in undefined)
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/test/abort-stalled.js:65
test('through', pull.through())
                     ^
