[Killed] PrecomputedMutator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'object') {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:7:20
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
+    for(var i = 0; length - i; i++)
       args[i] = arguments[i]
     return function (read) {

[Timeout] PrecomputedMutator
pull.js:7:32
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
+    for(var i = 0; i < length; i / 2)
       args[i] = arguments[i]
     return function (read) {

[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (!Array.isArray(args)) {
         throw new TypeError("partial sink should only be called once!")
       }

[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args === undefined) {
         throw new TypeError("partial sink should only be called once!")
       }

[Killed] PrecomputedMutator
pull.js:20:15
       args = null
 
       // Prioritize common case of small number of pulls.
-      switch (length) {
+      switch (length - 2) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:21:22
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read * ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Survived] PrecomputedMutator
pull.js:21:22
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1: return pull(read + ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Killed] PrecomputedMutator
pull.js:22:41
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(read, ref[0], ref.length)
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:41
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read, ref[0], "hello", ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:23:27
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3: return pull(read.method(), ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:24:41
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(read, ref[0], 1 + ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:26:21
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.unshift(0)
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:26:21
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.unshift(read.bind(null))
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref.slice(1))
       }
     }

[Survived] PrecomputedMutator
pull.js:27:27
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(42, ref)
       }
     }

[Killed] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (!read || typeof read.source !== 'function') {
     read = read.source
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:34:7
 
   var read = a
 
-  if (read && typeof read.source === 'function') {
+  if (read && typeof read.source === 'function' && read.source.length === 1) {
     read = read.source
   }

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s.isFunction()) {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (s.name === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
pull.js:41:14
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s[0](read)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/pull.js:120
        read = (stryMutAct_9fa48("98") ? s[0] : stryMutAct_9fa48("97") ? s && s : (stryCov_9fa48("97", "98"), s))(stryMutAct_9fa48("101") ? read * 2 : stryMutAct_9fa48("100") ? read - 1 : stryMutAct_9fa48("99") ? read + 1

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink("")
       read = s.source
     }
