[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (!!done) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Killed] PrecomputedMutator
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(abort) {
           cbed = false
           read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(op) {
           cbed = false
           read(null, function (end, data) {

[Killed] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = (end || abort) && true) {
               loop = false
               if(done) done(end === true ? null : end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = end || abort ? end : abort) {
               loop = false
               if(done) done(end === true ? null : end)

[Killed] PrecomputedMutator
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(!end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(!(end === true))
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end && end == true) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end != null && end !== true) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(undefined)
                 throw end
               }

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(null)
                 throw end
               }

[Killed] PrecomputedMutator
sinks/drain.js:32:37
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === !op(data) || abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:15
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read && {}(abort || true, done || function () {})
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, function (end, data) {})
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:36:21
               loop = false
               read(abort || true, done || function () {})
             }
-            else if(!loop){
+            else if(loop == 0){
               next()
             }

[Killed] PrecomputedMutator
sinks/drain.js:37:15
               read(abort || true, done || function () {})
             }
             else if(!loop){
-              next()
+              null()
             }
           })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(loop = false) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if('function' == typeof cb)
       cb = err, err = true
     abort = err || true

[Survived] PrecomputedMutator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if('number' == typeof err)
       cb = err, err = true
     abort = err || true

[Killed] PrecomputedMutator
sinks/drain.js:52:21
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read = abort(abort, cb || function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/drain.js:52:26
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read('abort', cb || function () {})
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
