[Killed] PrecomputedMutator
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(!cb || !test)
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:12:12
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = prop + 1(test) || id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:15:8
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(test(data) && data.length > 0) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:15:8
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(test && false(data)) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:17:16
   return drain(function (data) {
     if(test(data)) {
       ended = true
-      cb(null, data)
+      cb(null, data[0])
     return false
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(test(data)) return //already called back
     cb(err === true ? null : err, null)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:22:5
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(err && err.message === 'test' ? err : null)
   })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/find.js:22:8
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(!err || null, null)
   })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
