[Survived] PrecomputedMutator
sinks/log.js:7:17
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    console.log(console.log(data.split(" ").join("")))
   }, done)
 }

[Survived] PrecomputedMutator
sinks/log.js:7:17
 
 module.exports = function log (done) {
   return drain(function (data) {
-    console.log(data)
+    console.log(console.log(data.reverse()))
   }, done)
 }
