[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(acc && cb) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(cb || acc) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:8:11
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = reducer(acc + 1)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/sinks/collect.js:53
                                                                                                                                                                                   ^

[Killed] PrecomputedMutator
sinks/reduce.js:8:19
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
-    acc = reducer(acc, data)
+    acc = reducer(0, data)
   }, function (err) {
     cb(err, acc)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (arguments.length === 3)
     return function (source) {
       source(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (arguments.legnth === 4)
     return function (source) {
       source(null, function (end, data) {

[Killed] PrecomputedMutator
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(acc = reducer(acc, data) !== end) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(end) return cb(end === false ? null : end)
         acc = data; sink(source)
       })

[Killed] PrecomputedMutator
sinks/reduce.js:17:26
       source(null, function (end, data) {
         //if ended immediately, and no initial...
         if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
+        acc = data; sink(false)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
