[Killed] PrecomputedMutator
sources/count.js:6:26
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && `null`(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:6:26
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb && `cb`(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/sources/count.js:54

[Killed] PrecomputedMutator
sources/count.js:7:8
   var i = 0; max = max || Infinity
   return function (end, cb) {
     if(end) return cb && cb(end)
-    if(i > max)
+    if(-i > max + max < i)
       return cb(true)
     cb(null, i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:7:8
   var i = 0; max = max || Infinity
   return function (end, cb) {
     if(end) return cb && cb(end)
-    if(i > max)
+    if(-i > max + i >= max)
       return cb(true)
     cb(null, i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/count.js:9:5
     if(end) return cb && cb(end)
     if(i > max)
       return cb(true)
-    cb(null, i++)
+    {}(null, i++)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/sources/count.js:56
                                                                                                                                                    ^

[Killed] PrecomputedMutator
sources/count.js:9:5
     if(end) return cb && cb(end)
     if(i > max)
       return cb(true)
-    cb(null, i++)
+    undefined(null, i++)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
