[Killed] PrecomputedMutator
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(abort || onAbort())
       return abortCb(cb, abort, onAbort)
     if(value != null) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/once.js:7:14
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb(abort, onAbort))
     if(value != null) {
       var _value = value; value = null

[Survived] PrecomputedMutator
sources/once.js:7:22
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb(true, _value), abort, onAbort)
     if(value != null) {
       var _value = value; value = null

[Killed] PrecomputedMutator
sources/once.js:8:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
+    if(value === undefined) {
       var _value = value; value = null
       cb(null, _value)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:8:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
+    if(typeof value === 'undefined') {
       var _value = value; value = null
       cb(null, _value)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/once.js:10:7
       return abortCb(cb, abort, onAbort)
     if(value != null) {
       var _value = value; value = null
-      cb(null, _value)
+      cb(_value, undefined)
     } else
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/once.js:12:10
       var _value = value; value = null
       cb(null, _value)
     } else
-      cb(true)
+      cb(value === null)
   }
 }
