[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(!Array.isArray(array))
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array && !array.length)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:7:43
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(abort) return abortCb(cb, abort, () => {})
       return cb(true)
     }

[Survived] PrecomputedMutator
sources/values.js:8:17
   if(!array)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
+      return cb(!array[i++])
     }
   if(!Array.isArray(array))

[Killed] PrecomputedMutator
sources/values.js:10:6
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(Object.isArray(array))
     array = Object.keys(array).map(function (k) {
       return array[k]
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(Object.keys(array)).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:11:25
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
+    array = Object.keys(Object.values(array)).map(function (k) {
       return array[k]
     })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(!onAbort)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sources/values.js:16:8
     })
   var i = 0
   return function (abort, cb) {
-    if(abort)
+    if(abort || null)
       return abortCb(cb, abort, onAbort)
     if(i >= array.length)

[Killed] PrecomputedMutator
sources/values.js:17:22
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb => cb, abort, onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:17:26
   var i = 0
   return function (abort, cb) {
     if(abort)
-      return abortCb(cb, abort, onAbort)
+      return abortCb(cb, abortCb(cb, null, onAbort), onAbort)
     if(i >= array.length)
       cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:18:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
+    if(i !== array.length)
       cb(true)
     else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
sources/values.js:21:7
     if(i >= array.length)
       cb(true)
     else
-      cb(null, array[i++])
+      cb(array.length)
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
