[Killed] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map[0] === undefined) return id
   map = prop(map)
   var busy = false, abortCb, aborted
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:8:14
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop(map = function () {})
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:8:14
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop(!map)
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:12:26
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(aborted) return abort(aborted)
       if(abort) {
         aborted = abort
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:15:12
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
+        if(true) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:18:14
         if(!busy) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
-          cb(abort)
+          cb(abort())
         })
         else read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:22:14
         })
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
+          if(busy || abort) abortCb = cb
           else cb(abort)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:23:19
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
           if(busy) abortCb = cb
-          else cb(abort)
+          else cb(error)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:28:19
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(end) aborted(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(1) cb(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/test/async-map.js:34
    if(!end) throw new Error('expected read to end')
             ^

[Killed] PrecomputedMutator
throughs/async-map.js:29:19
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(aborted = true) cb(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:29:28
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(aborted) `{abortCb}`(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb(true)
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:36:28
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb && null(aborted)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:34
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(err) next (NaN, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:23
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(true) next (err, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:23
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else cb(1, data)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:39:29
                 abortCb && abortCb(aborted)
               }
               else if(err) next (err, cb)
-              else cb(null, data)
+              else cb(null, data.length)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
