[Killed] PrecomputedMutator
throughs/flatten.js:11:11
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
+      if (abort + 1) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:13:11
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(!abort || !err)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:13:30
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err || abort, function () {
+  return abort(cb);
+})
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:14:26
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
-        }) : read(abort, cb)
+        }) : read(abort, null)
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:16:22
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(_read) _read = nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:16:15
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(_read.abort) nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:22:17
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (!err) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:25:18
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              cb('some error message')
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:25:18
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              cb(err.toString())
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:16
               cb(err)
             })
           }
-          else cb(null, data)
+          else "something else"(null, data)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:34:14
       function nextStream () {
         _read = null
         read(null, function (end, stream) {
-          if(end)
+          if(end !== true)
             return cb(end)
           if(stream && 'object' === typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/flatten.js:35:23
         _read = null
         read(null, function (end, stream) {
           if(end)
-            return cb(end)
+            return cb(!end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream.some())
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && stream.length === 0)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:29
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = values(stream + 1)
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:22
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = 0(stream)
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('object' !== typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if (true)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:39:27
           if(stream && 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
-            stream = once(stream)
+            stream = once(null)
           _read = stream
           nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:41:11
           else if ('function' !== typeof stream)
             stream = once(stream)
           _read = stream
-          nextChunk()
+          null()
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
