[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(mapper = null) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(prop(mapper) == null) return id
   mapper = prop(mapper)
   return function (read) {

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop = "something else"(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/throughs/map.js:56
                                                                                                                                                                                                                     ^

[Killed] PrecomputedMutator
throughs/map.js:8:12
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = read = "something else"(mapper)
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/throughs/map.js:56
                                           ^

[Killed] PrecomputedMutator
throughs/map.js:13:23
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? mapper * 2(data) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:13:30
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? mapper(undefined) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:16:23
         data = !end ? mapper(data) : null
         } catch (err) {
           return read(err, function () {
-            return cb(err)
+            return cb('')
           })
         }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
