[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if('boolean' === typeof test) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(test < 0) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(err !== true)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(err === false)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:24:42
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && !end) last ? terminate(end) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:25:40
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(ended = end) read(ended, cb(true))
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:30:16
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            cb(ended == false)
           }
           else if(!test(data)) {

[Killed] PrecomputedMutator
throughs/take.js:32:20
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(!test == false(data)) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:34:29
           }
           else if(!test(data)) {
             ended = true
-            last ? cb(null, data) : terminate(cb)
+            last ? cb(null, "data") : terminate(cb)
           }
           else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:13
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            cb(data, null)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
