[Killed] PrecomputedMutator
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(!a || onEnd) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd ? null : abort(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:10:5
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd ? abort : null(abort === true ? null : abort)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end !== true) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] PrecomputedMutator
throughs/through.js:15:20
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end) once(0)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Killed] PrecomputedMutator
throughs/through.js:17:12
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(end === false) op && op(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:17:24
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) op && op && false(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:19:9
       return read(end, function (end, data) {
         if(!end) op && op(data)
         else once(end)
-        cb(end, data)
+        cb + 1(end, data)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox8867822/throughs/through.js:63
