[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (result[country] == null) Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (typeof result[country] === 'undefined') Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/build-timezone.js:30:28
-     const hours = Math.floor(offset / 60);
+     const hours = Math.floor(offset % 60 + offset / 60);

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(min / 2))}`;

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== 0) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:18:27
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(Object.assign({}, timezones), options);

[Survived] PrecomputedMutator
src/index.js:23:25
-     return deliverCountry(countries[id], options);
+     return deliverCountry(countries[id.toUpperCase()], options);

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (typeof timezones[name] === 'undefined') memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name.split(' ').join('_')));

[Survived] PrecomputedMutator
src/index.js:54:19
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId.toString(), options);

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (deprecated !== void 0) return tzs;

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (tzs[key].deprecated != true) Object.assign(prev, { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:64:51
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key + 1]: tzs[key]
+   });
