[Survived] PrecomputedMutator
lib/request.js:6:19
-     const request = url.trimLeft().startsWith('https') ? https : http;
+     const request = url.includes('https') ? https : http;

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + 'apstest'))

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + 'test'))

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('Invalid options'));

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest && options.dest !== "path/to/file") {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (typeof options.dest !== "string") {

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new TypeError('The options.dest is not a string'));

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (!options.dest.match(/\.[^.]+$/)) {

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(decodeURI(pathname));

[Survived] PrecomputedMutator
index.js:20:22
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest, decodeURIComponent(pathname));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!!path.isAbsolute(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.slice(1))) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace('\\', ''))) {

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(path.dirname(options.dest) + path.sep + path.basename(options.dest));

[Survived] PrecomputedMutator
index.js:25:33
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve("", options.dest);

[Survived] PrecomputedMutator
index.js:25:44
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(__dirname, decodeURIComponent(options.dest));

[Survived] PrecomputedMutator
index.js:28:18
-     return request(options);
+     return request({
+     ...options,
+     extname: '.txt'
+   });
