[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude === NaN || longitude === NaN) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (longitude < -90 || longitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude <= -180 || longitude >= 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -180 || longitude > 180 || Math.abs(longitude) > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (!point.type && point.coordinates.length === 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!point.coordinates || point.coordinates.length < 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates.slice(1)) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:76:33
-       return this.fromLngLatArray(point.coordinates);
+       return this.fromLngLatArray(point.coordinates.concat([0]));

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!object) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (object.hasOwnProperty('type')) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (object.latitude === undefined || object.longitude === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (object['latitude'] === undefined || object['longitude'] === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:106:36
-       const b = cos(point1Rad) * cos(point2Rad) * cos(a);
+       const b = cos(point1Rad) * cos(point2Rad * -1) * cos(a);

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:124:29
-       const y = sin(Δλ) * cos(φ2);
+       const y = sin(Δλ) * cos(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:125:49
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ1) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:59
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(-Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(2 * distance) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance - 1) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(bearing * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(bearing / 2);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(Math.PI);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(Number.MAX_VALUE);

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ + Math.PI), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(2 * θ), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(Math.abs(θ)), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(sinθ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, x + 1);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(-λ2) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(λ2 * 2) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance * 0.5, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing * -1);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance - 1, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance + 1, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(null, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, null);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(5, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, coordinate2);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.x + point.y);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.radius * this.distance, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.distance * Math.PI, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, NaN);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.toString());

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.valueOf());

[Survived] PrecomputedMutator
src/geo-point.ts:297:39
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => Number(input.toFixed(precision));

[Survived] PrecomputedMutator
src/geo-point.ts:297:50
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(Math.abs(precision)));

[Survived] PrecomputedMutator
src/geo-point.ts:297:64
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(Math.floor(precision)));

[Survived] PrecomputedMutator
src/geo-point.ts:297:64
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(Math.round(precision)));

[Survived] PrecomputedMutator
src/geo-point.ts:297:64
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(Math.ceil(precision)));

[Survived] PrecomputedMutator
src/geo-point.ts:299:55
-       return new GeoPoint(adjust(this.latitude), adjust(this.longitude));
+       return new GeoPoint(adjust(this.latitude), adjust(this.longitude !== 0 ? this.longitude : this.latitude));
