[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : 'foo')

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.replacer)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : 42)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : options.split('\n'))

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, {
+     mode: '0666'
+   })

[Survived] PrecomputedMutator
index.js:51:24
-       content = stripBom(content)
+       content = stripBom(stripBom(fs.readFileSync(file, options)))

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, {
+     foo: 'bar'
+   })

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, '')

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, 42)

[Survived] PrecomputedMutator
utils.js:5:29
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/\n/g, EOF) + EOF

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (typeof content !== 'string') content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, ' ')

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, '' + ' ')
