[Survived] PrecomputedMutator
src/build-country.js:5:7
-     if (!name) return null;
+     if (!Boolean(name)) return null;

[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (!data.timezones[name]) return null;

[Survived] PrecomputedMutator
src/build-timezone.js:30:28
-     const hours = Math.floor(offset / 60);
+     const hours = Math.floor(Math.floor(offset / 60));

[Survived] PrecomputedMutator
src/build-timezone.js:30:28
-     const hours = Math.floor(offset / 60);
+     const hours = Math.floor(Math.round(offset / 60));

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(min * 2))}`;

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== countries.length) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:81
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getCountryForTimezone);

[Survived] PrecomputedMutator
src/index.js:18:38
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, {
+     ...options,
+     undefined
+   });

[Survived] PrecomputedMutator
src/index.js:18:38
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones, {
+     ...options,
+     foo: 'bar'
+   });

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, 1));

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (timezones[name] == null) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, "false"));

[Survived] PrecomputedMutator
src/index.js:32:41
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name, "true"));

[Survived] PrecomputedMutator
src/index.js:54:30
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId.toUpperCase(), options);

[Survived] PrecomputedMutator
src/index.js:54:41
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId, options && {
+     ...options,
+     countryId: '1234'
+   });
