[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (!a || typeof a !== 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (a !== Object(a)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (typeof b === 'undefined') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (!Object.keys(b).length) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (a[key] === undefined || b[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:34:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(attributes).reverse()).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:34:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(attributes).sort()).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (a.constructor.name !== 'Object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (b == null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (b === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (b && typeof b !== 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:47:36
-       const attributes = Object.keys(a)
+       const attributes = Object.keys(a || b)

[Survived] PrecomputedMutator
src/AttributeMap.ts:47:36
-       const attributes = Object.keys(a)
+       const attributes = Object.keys(a ? a : b)

[Survived] PrecomputedMutator
src/AttributeMap.ts:82:9
-       if (typeof a !== 'object') {
+       if (a == null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (b !== Object(b)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(b).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(undefined); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(Infinity); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:23:7
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b !== 'object' && b !== null) {

[Survived] PrecomputedMutator
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (arg !== 'string' && arg.length === 0) {

[Survived] PrecomputedMutator
src/Delta.ts:74:9
-       if (typeof arg === 'string' && arg.length === 0) {
+       if (arg === 'string' || arg.length === 0) {

[Survived] PrecomputedMutator
src/Delta.ts:89:9
-       if (length <= 0) {
+       if (length == 0) {

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes !== lastOp.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes !== null && typeof newOp.attributes === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes === null || typeof newOp.attributes === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes && typeof newOp.attributes === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:160:7
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(index, -index, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:167:9
-       if (lastOp && typeof lastOp.retain === 'number' && !lastOp.attributes) {
+       if (lastOp != null && typeof lastOp.retain === 'number' && !lastOp.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:199:39
-       return this.ops.reduce(predicate, initialValue);
+       return this.ops.reduce(predicate, initialValue = 0);

[Survived] PrecomputedMutator
src/Delta.ts:225:11
-         if (index < start) {
+         if (start > index) {

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes == null && Math.random() < 0.5

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes == null && typeof firstOther.insert === 'object'

[Survived] PrecomputedMutator
src/Delta.ts:255:24
-           otherIter.next(firstOther.retain - firstLeft);
+           otherIter.next(Math.abs(firstOther.retain - firstLeft));

[Survived] PrecomputedMutator
src/Delta.ts:265:33
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(1, otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:268:13
-           if (otherOp.retain) {
+           if (otherOp.retain + 1) {

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[0].insert, newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[0].retain, newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(this.ops[this.ops.length - 2], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(this.ops[0], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:21
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(other.ops[0], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.splice(1));

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.concat().slice(1));

[Survived] PrecomputedMutator
src/Delta.ts:334:36
-         delta.ops = delta.ops.concat(other.ops.slice(1));
+         delta.ops = delta.ops.concat(other.ops.slice(1).concat());

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.length);

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(strings[1].length);

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(thisIter.length);

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), 1);

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(opLength * 2));

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(opLength + 1));

[Survived] PrecomputedMutator
src/Delta.ts:368:24
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.ceil(length, thisIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:368:33
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(1, thisIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:370:29
-               retDelta.delete(opLength);
+               retDelta.delete(length);

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.hasNext() % 2 == 1) {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.attributes || true) {

[Survived] PrecomputedMutator
src/Delta.ts:480:42
-         return this.transformPosition(arg, priority);
+         return this.transformPosition(arg, priority && 1);

[Survived] PrecomputedMutator
src/Delta.ts:491:22
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(0)));

[Survived] PrecomputedMutator
src/Delta.ts:491:22
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(2)));

[Survived] PrecomputedMutator
src/Delta.ts:516:43
-               const embedType = Object.keys(thisData)[0];
+               const embedType = Object.keys(thisData || 0)[0];

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if (handler.property = true) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (module.exports == 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (module.exports instanceof Object) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.insert === 'number') {

[Survived] PrecomputedMutator
src/OpIterator.ts:19:9
-       if (!length) {
+       if (!length > 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.offset == 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:95:29
-         return this.ops.slice(this.index);
+         return this.ops.slice(this.index - this.offset);
