[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest, {
+     format: 'utf8'
+   }))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + 'something'))

[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (typeof options.url !== 'string') {

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.dest is undefined'));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('The options.dest is not a directory'));

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(url.pathname);

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(pathname);

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(options.url.split('/').pop());

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.dirname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.basename(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest + 1)) {
