[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, {
+     encoding: 'utf8'
+   })

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, {
+     throws: false
+   })

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow === true) {

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow ? true : false) {

[Survived] PrecomputedMutator
index.js:66:25
-     const str = stringify(obj, options)
+     const str = stringify({
+     ...obj
+   }, options)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await fs.writeFileSync(file, str, options)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await _fs.writeFileSync(file, str, options)

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.flag)

[Survived] PrecomputedMutator
index.js:71:44
-   const writeFile = universalify.fromPromise(_writeFile)
+   const writeFile = universalify.fromPromise(_writeFile.bind(null))

[Survived] PrecomputedMutator
index.js:76:15
-     const str = stringify(obj, options)
+     const str = stringify(obj, {
+     ...options,
+     encoding: "base64"
+   })

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, "utf8")

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, null)

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, 'foo')

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.toString('utf8')[0]) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:23
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(Buffer.from(content))) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:26
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/\ufeff/, '')
