[Survived] PrecomputedMutator
src/matcher.ts:15:20
-       if (spec.match(/^\//) === null) {
+       if (spec.match(/^[/]/) === null) {

[Survived] PrecomputedMutator
src/matcher.ts:26:9
-       if (spec.match(/[^/]:|:\/|:$/) !== null) {
+       if (spec.match(/:$/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:29:9
-       if (spec.match(/^.+\/$/) !== null) {
+       if (spec.match(/^.+\/$/)?.length > 0) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('|')) {

[Survived] PrecomputedMutator
src/matcher.ts:92:44
-     for (const part of spec.split('/').slice(1).reverse()) {
+     for (const part of spec.split('/').slice("1.1".match(/\d+/)[0]).reverse()) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:[a-zA-Z]+/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:115:26
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([.*$])/g, '\\$1')}`)

[Survived] PrecomputedMutator
src/matcher.ts:115:39
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([e.$])/g, '\\$1')}`)

[Survived] PrecomputedMutator
src/matcher.ts:115:39
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([.$])/i, '\\$1')}`)

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of Object.values(verbs)) {

[Survived] PrecomputedMutator
src/rule.ts:69:27
-         for (let index = 0; index < count; index++) {
+         for (let index = 0; index - count; index++) {
