[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (options.url === null) {

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.url is not a valid URL'));

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest || options.dest.length === 0) {

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (path.extname(options.dest) === '') {

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname(options.dest.split('/').pop())) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(pathname.split('/').pop());

[Survived] PrecomputedMutator
index.js:18:31
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURI(basename);

[Survived] PrecomputedMutator
index.js:18:50
-         const decodedBasename = decodeURIComponent(basename);
+         const decodedBasename = decodeURIComponent(basename.toLowerCase());

[Survived] PrecomputedMutator
index.js:20:46
-         options.dest = path.join(options.dest, decodedBasename);
+         options.dest = path.join(options.dest, decodedBasename.toLowerCase());

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.dest) && path.isAbsolute(options.url)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace(/^/, ''))) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace(/^/, 'foo'))) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.replace(/^/, 'bar'))) {
