[Survived] PrecomputedMutator
sinks/drain.js:27:23
-                 else if(end && end !== true) {
+                 else if(end && end !== end) {

[Survived] PrecomputedMutator
sinks/drain.js:28:30
-                   console.warn(doneLackingErr)
+                   console.warn(doneLackingErr.name)

[Survived] PrecomputedMutator
sinks/drain.js:34:35
-                 read(abort || true, done || function () {})
+                 read(abort || true, done || function () {
+     throw new Error('done callback not called');
+   })

[Survived] PrecomputedMutator
sinks/drain.js:52:8
-       if(read) return read(abort, cb || function () {})
+       if(read(null, cb || function () {})) return read(abort, cb || function () {})

[Survived] PrecomputedMutator
sinks/drain.js:52:33
-       if(read) return read(abort, cb || function () {})
+       if(read) return read(abort, cb || function (err) {
+     console.error(err);
+   })

[Survived] PrecomputedMutator
sinks/find.js:12:17
-       test = prop(test) || id
+       test = prop(test || false) || id

[Survived] PrecomputedMutator
sinks/reduce.js:16:24
-           if(end) return cb(end === true ? null : end)
+           if(end) return 0(end === true ? null : end)

[Survived] PrecomputedMutator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end === false ? acc : null)

[Survived] PrecomputedMutator
sources/count.js:6:8
-       if(end) return cb && cb(end)
+       if(end * 2) return cb && cb(end)

[Survived] PrecomputedMutator
sources/once.js:7:22
-         return abortCb(cb, abort, onAbort)
+         return abortCb(abortCb(abort, abort, onAbort), abort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort || onAbort, onAbort)

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort ? onAbort : null, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort && false) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:24
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort, null)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort || onAbort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:36
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort ? onAbort : null, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:43
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb, abort, onAbort.call(null))

[Survived] PrecomputedMutator
sources/values.js:10:21
-     if(!Array.isArray(array))
+     if(!Array.isArray(array.length / 2))

[Survived] PrecomputedMutator
sources/values.js:17:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort || onAbort, onAbort)

[Survived] PrecomputedMutator
throughs/async-map.js:7:6
-     if(!map) return id
+     if(map.size === 0) return id

[Survived] PrecomputedMutator
throughs/async-map.js:12:29
-         if(aborted) return cb(aborted)
+         if(aborted) return cb("aborted")

[Survived] PrecomputedMutator
throughs/async-map.js:23:19
-             else cb(abort)
+             else cb(new Error('abort'))

[Survived] PrecomputedMutator
throughs/async-map.js:28:14
-             if(end) cb(end)
+             if(end !== null && end !== undefined) cb(end)

[Survived] PrecomputedMutator
throughs/async-map.js:29:19
-             else if(aborted) cb(aborted)
+             else if(aborted && !busy) cb(aborted)

[Survived] PrecomputedMutator
throughs/async-map.js:29:19
-             else if(aborted) cb(aborted)
+             else if(aborted || busy) cb(aborted)

[Survived] PrecomputedMutator
throughs/async-map.js:34:18
-                 if(aborted) {
+                 if(aborted && !busy) {

[Survived] PrecomputedMutator
throughs/async-map.js:34:18
-                 if(aborted) {
+                 if(aborted || busy) {

[Survived] PrecomputedMutator
throughs/async-map.js:38:23
-                 else if(err) next (err, cb)
+                 else if(err && err.message) next (err, cb)

[Survived] PrecomputedMutator
throughs/async-map.js:38:23
-                 else if(err) next (err, cb)
+                 else if(err instanceof Error) next (err, cb)

[Survived] PrecomputedMutator
throughs/filter-not.js:7:17
-     test = tester(test)
+     test = tester(test || true)

[Survived] PrecomputedMutator
throughs/filter-not.js:8:48
-     return filter(function (data) { return !test(data) })
+     return filter(function (data) { return !test(data.slice(0, 1)) })

[Survived] PrecomputedMutator
throughs/filter.js:7:17
-     test = tester(test)
+     test = tester(test || test(data))

[Survived] PrecomputedMutator
throughs/filter.js:15:23
-             if(!end && !test(data))
+             if(!end && !test || false(data))

[Survived] PrecomputedMutator
throughs/flatten.js:13:11
-             read(err || abort, cb)
+             read(err ? abort : null, cb)

[Survived] PrecomputedMutator
throughs/flatten.js:13:16
-             read(err || abort, cb)
+             read(!err || abort, cb)

[Survived] PrecomputedMutator
throughs/flatten.js:21:15
-             if (err) {
+             if (err !== null) {

[Survived] PrecomputedMutator
throughs/map.js:7:6
-     if(!mapper) return id
+     if(mapper === undefined) return id

[Survived] PrecomputedMutator
throughs/take.js:24:51
-         if(ended && !end) last ? terminate(cb) : cb(ended)
+         if(ended && !end) last ? terminate(cb) : cb(ended || end)

[Survived] PrecomputedMutator
throughs/take.js:25:15
-         else if(ended = end) read(ended, cb)
+         else if(ended = end || false) read(ended, cb)

[Survived] PrecomputedMutator
throughs/take.js:25:33
-         else if(ended = end) read(ended, cb)
+         else if(ended = end) read(end || !ended, cb)

[Survived] PrecomputedMutator
throughs/take.js:30:16
-               cb(ended)
+               cb(ended && !end)

[Survived] PrecomputedMutator
throughs/take.js:32:20
-             else if(!test(data)) {
+             else if(!test || false(data)) {

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end && !onEnd) once(end)

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end || onEnd) once(end)

[Survived] PrecomputedMutator
throughs/through.js:15:10
-         if(end) once(end)
+         if(end !== onEnd) once(end)

[Survived] PrecomputedMutator
throughs/through.js:15:20
-         if(end) once(end)
+         if(end) once(end || abort)

[Survived] PrecomputedMutator
throughs/through.js:18:19
-           else once(end)
+           else once(end || true)

[Survived] PrecomputedMutator
throughs/through.js:18:19
-           else once(end)
+           else once(end && onEnd)

[Survived] PrecomputedMutator
util/abort-cb.js:2:6
-     cb(abort)
+     cb(abort || null)

[Survived] PrecomputedMutator
util/abort-cb.js:3:22
-     onAbort && onAbort(abort === true ? null: abort)
+     onAbort && onAbort(abort === true ? null : abort)

[Survived] PrecomputedMutator
util/prop.js:6:42
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data[key + 1]); return v && v[0] }

[Survived] PrecomputedMutator
util/tester.js:8:42
-       ? function (data) { return test.test(data) }
+       ? function (data) { return test.test(data.split('')) }

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref[3])

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[4], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:27:27
-           return pull.apply(null, ref)
+           return pull.apply(NaN, ref)

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === 'object' && s.constructor !== Object) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === 'object' && s.constructor === Array) {
