[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (b === null || b === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:23:13
-           if (attributes[key] != null) {
+           if (attributes[key] !== undefined && attributes[key] !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (typeof b !== 'object' && typeof b !== 'function') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:50:13
-           if (!isEqual(a[key], b[key])) {
+           if (!isEqual(a[key], b[key]) && a[key] !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (b === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:88:9
-       if (!priority) {
+       if (!priority && b) {

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes === null

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft && thisIter.peekLength() > 0 && thisIter.peekLength() < firstLeft

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
+           otherIter.peekLength() === 'insert' &&

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], delta.ops[delta.ops.length - 2])

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], delta.ops[delta.ops.length - 1])

[Survived] PrecomputedMutator
src/Delta.ts:346:15
-             if (op.insert != null) {
+             if (op.insert != null && op.insert !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:346:15
-             if (op.insert != null) {
+             if (op.insert != null && op.insert !== undefined && op.insert !== '') {

[Survived] PrecomputedMutator
src/Delta.ts:368:41
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, thisIter.peekLength() - 1);

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain && op.attributes && true) {

[Survived] PrecomputedMutator
src/Delta.ts:463:42
-           const handler = Delta.getHandler(embedType);
+           const handler = Delta.getHandler(embedType.toLowerCase());

[Survived] PrecomputedMutator
src/Delta.ts:479:9
-       if (typeof arg === 'number') {
+       if (arg.constructor === Number) {

[Survived] PrecomputedMutator
src/Delta.ts:479:9
-       if (typeof arg === 'number') {
+       if (Object.prototype.toString.call(arg) === '[object Number]') {

[Survived] PrecomputedMutator
src/Delta.ts:495:33
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(Math.min(thisIter.peekLength(), otherIter.peekLength()), otherIter.peekLength());

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             typeof nextOp.retain === 'object' && nextOp.retain !== null

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           typeof op.retain === 'number' || typeof op.retain === 'object' && op.retain !== null || typeof op.retain === 'string' && op.retain.length > 0

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           typeof op.retain === 'number' || typeof op.retain === 'object' && op.retain !== null || typeof op.retain === 'function' && op.retain.length > 0
