[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude === undefined || longitude === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 90 || latitude === 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type !== 'Point' || !Array.isArray(point.coordinates) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates') || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:76:33
-       return this.fromLngLatArray(point.coordinates);
+       return this.fromLngLatArray(point.coordinates.concat([0, 0]));

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (!object.hasOwnProperty('latitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:12
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return Math.acos(r > 1 ? 1 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 1 ? 0 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing) * 2);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing) - 180);

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing * 2));

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(θ - 180);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y * cosθ, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y * sinθ, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, x * cosφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, x * sinφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:185:72
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2.0, zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, bearing - 180);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude, point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.latitude + point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude + point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.longitude, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, point.longitude + 1);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.longitude + point.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.longitude, point);
