[Survived] PrecomputedMutator
src/build-country.js:33:11
-         if (tz.r === undefined) result[country].current.push(id);
+         if (tz.r === undefined || tz.r === null) result[country].current.push(id);

[Survived] PrecomputedMutator
src/build-timezone.js:14:21
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isFinite(tz.d) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(offset % 60)}`;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(timezones).filter(key => key.startsWith('UTC')).length).length;

[Survived] PrecomputedMutator
src/index.js:43:32
-     const timezone = getTimezone(tzName) || {};
+     const timezone = getTimezone(tzName.split(' ').join('_')) || {};

[Survived] PrecomputedMutator
src/index.js:45:42
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options.deprecated = !options.deprecated));

[Survived] PrecomputedMutator
src/index.js:49:18
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options, undefined);

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated === true) Object.assign(prev, { [key]: tzs[key] });
