[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, options.encoding)

[Survived] PrecomputedMutator
index.js:19:46
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile.bind(fs))(file, options)

[Survived] PrecomputedMutator
index.js:19:46
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile.bind(null))(file, options)

[Survived] PrecomputedMutator
index.js:19:59
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file.toString(), options)

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, null)

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, {})

[Survived] PrecomputedMutator
index.js:19:65
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await universalify.fromCallback(fs.readFile)(file, undefined)

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : undefined)

[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : {})

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : undefined)

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : {})

[Survived] PrecomputedMutator
index.js:25:28
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options ? options.reviver : function () {})

[Survived] PrecomputedMutator
index.js:27:9
-       if (shouldThrow) {
+       if (shouldThrow || false) {

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.encoding)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.throws)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.reviver)

[Survived] PrecomputedMutator
index.js:50:35
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file.toString(), options)

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.encoding)

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.throws)

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, options.reviver)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.encoding)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.encoding, options.flag)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow || false) {

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.encoding)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.throws)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, options.reviver)

[Survived] PrecomputedMutator
index.js:68:35
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile.bind(fs))(file, str, options)

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, null)

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {})

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, undefined)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.encoding)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.throws)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.reviver)

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.encoding)

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.throws)

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options.reviver)

[Survived] PrecomputedMutator
utils.js:5:10
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replaceAll(/\n/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:5:22
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\r\n]+/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content) && content.length > 0) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content) || content.length > 0) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:23
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content.slice(1))) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/g, '')

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/i, '')

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/gm, '')

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, ' ')
