[Survived] PrecomputedMutator
q.js:501:9
-       if (value instanceof Promise) {
+       if (value.constructor === Promise) {

[Survived] PrecomputedMutator
q.js:697:9
-       if (typeof resolver !== "function") {
+       if (resolver !== "object") {
