[Survived] PrecomputedMutator
complex.js:490:38
-                 return new Complex(0, -Math.pow(b, z['re']));
+                 return new Complex(0, -Math.pow(b, z['re'] - 1));

[Survived] PrecomputedMutator
complex.js:816:13
-           if (b === -1) {
+           if (b === -1.0) {
