[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.dest) && path.extname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.isAbsolute(options.dest) || path.extname(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.split('/').pop())) {
