[Survived] PrecomputedMutator
index.js:11:7
-     if (typeof options === 'string') {
+     if (options.constructor === String) {

[Survived] PrecomputedMutator
index.js:27:9
-       if (shouldThrow) {
+       if (shouldThrow === true) {

[Survived] PrecomputedMutator
index.js:27:9
-       if (shouldThrow) {
+       if (shouldThrow && typeof shouldThrow === 'boolean') {

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, {})

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.throws)

[Survived] PrecomputedMutator
index.js:52:12
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content, options.reviver, options.flag)

[Survived] PrecomputedMutator
index.js:52:23
-       return JSON.parse(content, options.reviver)
+       return JSON.parse(content.replace(/^/, ''), options.reviver)

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (shouldThrow && typeof shouldThrow === 'boolean') {

[Survived] PrecomputedMutator
index.js:76:15
-     const str = stringify(obj, options)
+     const str = stringify(obj, options, null)

[Survived] PrecomputedMutator
index.js:76:15
-     const str = stringify(obj, options)
+     const str = stringify(obj, options, {})

[Survived] PrecomputedMutator
index.js:76:15
-     const str = stringify(obj, options)
+     const str = stringify(obj, options, undefined)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, 'utf8')

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, 'base64')

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, options, 'hex')

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, undefined)

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, {})

[Survived] PrecomputedMutator
utils.js:3:15
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(obj, replacer, spaces, "foo")

[Survived] PrecomputedMutator
utils.js:11:37
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF/, '\t')
