[Killed] PrecomputedMutator
index.js:14:14
 for(var k in sources)
   exports[k] = sources[k]
 
-for(var k in throughs)
+for(var k in throughs.map(function (through) {
+  return through.isBuggy;
+}))
   exports[k] = throughs[k]
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7673559/test/abort-stalled.js:65
test('through', pull.through())
                     ^

[Killed] PrecomputedMutator
index.js:17:1
 for(var k in throughs)
   exports[k] = throughs[k]
 
-for(var k in sinks)
-  exports[k] = sinks[k]
+for (var k in sinks.length) exports[k] = sinks[k];
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7673559/test/abort-stalled.js:54
      pull.drain(function (e) {
           ^
