[Killed] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args !== null) {
         throw new TypeError("partial sink should only be called once!")
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (args == undefined) {
         throw new TypeError("partial sink should only be called once!")
       }

[Survived] PrecomputedMutator
pull.js:20:15
       args = null
 
       // Prioritize common case of small number of pulls.
-      switch (length) {
+      switch (length + 1) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])

[Killed] PrecomputedMutator
pull.js:22:27
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2: return pull(function () {}, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
pull.js:24:27
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4: return pull(undefined, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)

[Survived] PrecomputedMutator
pull.js:26:21
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.unshift(null)
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:26:9
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
-        ref.unshift(read)
+        ref.shift(read)
         return pull.apply(null, ref)
       }

[Survived] PrecomputedMutator
pull.js:27:16
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply({}, ref)
       }
     }

[Survived] PrecomputedMutator
pull.js:27:33
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:
         ref.unshift(read)
-        return pull.apply(null, ref)
+        return pull.apply(null, ref.map(function (x) {
+  return x;
+}))
       }
     }

[Killed] PrecomputedMutator
pull.js:41:16
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
-      read = s(read)
+      read = s(null)
     } else if (s && typeof s === 'object') {
       s.sink(read)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7673559/sinks/drain.js:70
        read(null, function (end, data) {
        ^

[Survived] PrecomputedMutator
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && (typeof s === 'function' || typeof s === 'object')) {
       s.sink(read)
       read = s.source

[Survived] PrecomputedMutator
pull.js:43:14
     if (typeof s === 'function') {
       read = s(read)
     } else if (s && typeof s === 'object') {
-      s.sink(read)
+      s.sink({})
       read = s.source
     }
