[Survived] PrecomputedMutator
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (done === null) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Survived] PrecomputedMutator
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(null) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop

[Killed] PrecomputedMutator
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done(end === true ? end : null)) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/drain.js:27:23
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
+              else if(end && end !== null) {
                 console.warn(doneLackingErr)
                 throw end

[Survived] PrecomputedMutator
sinks/drain.js:28:30
               loop = false
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {
-                console.warn(doneLackingErr)
+                console.warn(doneLackingErr = new Error('no done callback supplied'))
                 throw end
               }

[Timeout] PrecomputedMutator
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(cbed && !cbed) {
             loop = false
             return

[Killed] PrecomputedMutator
sinks/drain.js:52:33
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort, null)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
