[Killed] PrecomputedMutator
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(cb && typeof cb === 'function') cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (arguments.length === 1)
     return function (source) {
       source(null, function (end, data) {
