[Killed] PrecomputedMutator
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map !== null) return id
   map = prop(map)
   var busy = false, abortCb, aborted
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:8:14
 
 module.exports = function asyncMap (map) {
   if(!map) return id
-  map = prop(map)
+  map = prop(map(data, function (err, data) {
+  if (aborted) {
+    cb(aborted);
+    abortCb && abortCb(aborted);
+  } else if (err) next(err, cb);else cb(null, data);
+}))
   var busy = false, abortCb, aborted
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:13:10
   return function (read) {
     return function next (abort, cb) {
       if(aborted) return cb(aborted)
-      if(abort) {
+      if(abort && !busy) {
         aborted = abort
         if(!busy) read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/async-map.js:13:10
   return function (read) {
     return function next (abort, cb) {
       if(aborted) return cb(aborted)
-      if(abort) {
+      if(abort || busy) {
         aborted = abort
         if(!busy) read(abort, function (err) {

[Killed] PrecomputedMutator
throughs/async-map.js:15:12
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
+        if(aborted) read(abort, function (err) {
           //incase the source has already ended normally,
           //we should pass our own error.
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:29:19
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(aborted || true) cb(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(null) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:35:20
             map(data, function (err, data) {
               busy = false
               if(aborted) {
-                cb(aborted)
+                cb(new Error('aborted'))
                 abortCb && abortCb(aborted)
               }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/async-map.js:38:28
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(err) null (err, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
