[Killed] PrecomputedMutator
throughs/flatten.js:13:30
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err || abort, undefined)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:17:12
         }) : read(abort, cb)
       }
       else if(_read) nextChunk()
-      else nextStream()
+      else nextChunk()
 
       function nextChunk () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:17:12
         }) : read(abort, cb)
       }
       else if(_read) nextChunk()
-      else nextStream()
+      else null()
 
       function nextChunk () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:21:15
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
+          if (err || err.message) {
             if (err === true) nextStream()
             else read(true, function(abortErr) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] PrecomputedMutator
throughs/flatten.js:21:15
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
+          if (err && err.message) {
             if (err === true) nextStream()
             else read(true, function(abortErr) {

[Killed] PrecomputedMutator
throughs/flatten.js:25:15
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              null(err)
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:25:18
             if (err === true) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
-              cb(err)
+              cb(new Error('some error message'))
             })
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:28:25
               cb(err)
             })
           }
-          else cb(null, data)
+          else cb(null, NaN)
         })
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:34:14
       function nextStream () {
         _read = null
         read(null, function (end, stream) {
-          if(end)
+          if(end || stream)
             return cb(end)
           if(stream && 'object' === typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'object' === typeof stream && stream.length < 0)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:37:29
           if(end)
             return cb(end)
           if(stream && 'object' === typeof stream)
-            stream = values(stream)
+            stream = values(stream.pipe(null))
           else if ('function' !== typeof stream)
             stream = once(stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/flatten.js:39:22
           if(stream && 'object' === typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
-            stream = once(stream)
+            stream = undefined(stream)
           _read = stream
           nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
