[Killed] PrecomputedMutator
throughs/map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function map (mapper) {
-  if(!mapper) return id
+  if(!mapper()) return id
   mapper = prop(mapper)
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(mapper(null))
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:8:17
 
 module.exports = function map (mapper) {
   if(!mapper) return id
-  mapper = prop(mapper)
+  mapper = prop(mapper(undefined))
   return function (read) {
     return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/map.js:13:23
     return function (abort, cb) {
       read(abort, function (end, data) {
         try {
-        data = !end ? mapper(data) : null
+        data = !end ? null(data) : null
         } catch (err) {
           return read(err, function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
