[Killed] PrecomputedMutator
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(ended = !ended) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] PrecomputedMutator
throughs/take.js:30:16
         read(null, function (end, data) {
           if(ended = ended || end) {
             //last ? terminate(cb) :
-            cb(ended)
+            cb(ended || end)
           }
           else if(!test(data)) {

[Killed] PrecomputedMutator
throughs/take.js:32:19
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(test(data) || false) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/take.js:37:13
             last ? cb(null, data) : terminate(cb)
           }
           else
-            cb(null, data)
+            0(null, data)
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
