[Killed] PrecomputedMutator
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end && abort) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7673559/throughs/through.js:60
                                           ^

[Killed] PrecomputedMutator
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(end || abort) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:17:24
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) op && op + 1(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:17:12
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(end) op && op(data)
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/through.js:18:14
       if(end) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)
-        else once(end)
+        else null(end)
         cb(end, data)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/home/runner/work/llm-mutation-testing/llm-mutation-testing/pull-stream/.stryker-tmp/sandbox7673559/throughs/through.js:62
