[Killed] PrecomputedMutator
throughs/unique.js:9:16
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop(field.toString()) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:9:16
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop(field.call(this)) || id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field(undefined)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] PrecomputedMutator
throughs/unique.js:12:21
   field = prop(field) || id
   var seen = {}
   return filter(function (data) {
-    var key = field(data)
+    var key = field(null)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
