[Timeout] PrecomputedMutator
util/tester.js:8:42
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) { return test.test({}) }
     : prop (test) || id
   )
