[Survived] PrecomputedMutator
lib/dirty/dirty.js:31:7
-         this._data.set(key, val);
+         this._data.set(key, val);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:31:7
-         this._data.set(key, val);
+         this._data.set(key, val, undefined);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:31:7
-         this._data.set(key, val);
+         this._data.set(key, val, null);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:34:35
-         const cbs = this._queue.get(key) || [];
+         const cbs = this._queue.get('') || [];

[Survived] PrecomputedMutator
lib/dirty/dirty.js:69:5
-       for (const [key, val] of this._data) {
-         if (fn(key, val) === false) break;
-       }
+       for (const [key, val, extra] of this._data) {
+     if (fn(key, val) === false) break;
+   }

[Survived] PrecomputedMutator
lib/dirty/dirty.js:69:5
-       for (const [key, val] of this._data) {
-         if (fn(key, val) === false) break;
-       }
+       for (const [key, val, ...rest] of this._data) {
+     if (fn(key, val) === false) break;
+   }

[Survived] PrecomputedMutator
lib/dirty/dirty.js:88:7
-         this.once('drain', () => this.close());
+         this.once('drain', () => this.emit('drain', this));

[Survived] PrecomputedMutator
lib/dirty/dirty.js:152:13
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
+               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer.replace(/\n/g, '')}`));

[Survived] PrecomputedMutator
lib/dirty/dirty.js:152:32
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
+               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer.slice(1)}`));

[Survived] PrecomputedMutator
lib/dirty/dirty.js:152:32
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
+               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer.replace(/\n/g, '')}`));
