[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap || {}) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap || buildTimezonesMap(data)) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(min / 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.ceil(min / 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.round(min / 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(Math.ceil(input));

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(Math.round(input));

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options, {
+     country: null
+   }) });

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, {
+     deprecated: true
+   }));

[Survived] PrecomputedMutator
src/index.js:22:38
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!countries[id]) memoizeCountry(buildCountry(data, id, {
+     deprecated: false
+   }));

[Survived] PrecomputedMutator
src/index.js:45:28
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, {
+     ...options,
+     allTimezones: true
+   }));

[Survived] PrecomputedMutator
src/index.js:54:19
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId, options, {});

[Survived] PrecomputedMutator
src/index.js:54:19
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId, options, undefined);

[Survived] PrecomputedMutator
src/index.js:70:7
-     if (!country) return null;
+     if (country === null || country === undefined) return null;
