[Survived] PrecomputedMutator
src/matcher.ts:93:13
-       switch (part) {
+       switch (part.replace(/([.$])/g, '\\$1')) {

[Survived] PrecomputedMutator
src/policymap.ts:30:9
-         ? policy.query(path, verb, ctx)
+         ? policy.query(path, verb, ctx, null)

[Survived] PrecomputedMutator
src/policymap.ts:41:9
-         ? policy.matches(path, ctx)
+         ? policy.matches(path, ctx)

[Survived] PrecomputedMutator
src/policymap.ts:41:9
-         ? policy.matches(path, ctx)
+         ? policy.matches(path, ctx, null)

[Survived] PrecomputedMutator
src/rule.ts:35:24
-       for (const verb of verbs) {
+       for (const verb of verbs.map(verb => verb)) {

[Survived] PrecomputedMutator
src/rule.ts:66:11
-         if (ctx === undefined) {
+         if (ctx === undefined || ctx === null) {
