[Survived] PrecomputedMutator
src/AttributeMap.ts:82:9
-       if (typeof a !== 'object') {
+       if (a === null || a === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'number' && firstOther.attributes === undefined

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
-           thisIter.peekLength() <= firstLeft
+           thisIter.peekType() === 'insert' && thisIter.peekLength() <= firstLeft

[Survived] PrecomputedMutator
src/Delta.ts:265:24
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(Math.min(thisIter.peekLength(), otherIter.peekLength()));

[Survived] PrecomputedMutator
src/Delta.ts:265:33
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(Math.min(thisIter.peekLength(), otherIter.peekLength()), otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], delta.ops[0])

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (this.ops.length === other.ops.length && this.ops.every((op, i) => op === other.ops[i])) {

[Survived] PrecomputedMutator
src/Delta.ts:346:15
-             if (op.insert != null) {
+             if (op.insert != undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:355:24
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], -1);

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(length);

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(0));

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(null));

[Survived] PrecomputedMutator
src/Delta.ts:369:27
-               thisIter.next(opLength);
+               thisIter.next(-1);

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.hasNext() && iter.peekType() === 'insert') {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain ? op.attributes : false) {

[Survived] PrecomputedMutator
src/Delta.ts:465:41
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData.slice(0), baseOpData) },

[Survived] PrecomputedMutator
src/Delta.ts:465:41
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData.concat(), baseOpData) },

[Survived] PrecomputedMutator
src/Delta.ts:465:49
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData.slice(0, 1)) },

[Survived] PrecomputedMutator
src/Delta.ts:465:49
-             { [embedType]: handler.invert(opData, baseOpData) },
+             { [embedType]: handler.invert(opData, baseOpData.slice(0, 2)) },

[Survived] PrecomputedMutator
src/Delta.ts:480:37
-         return this.transformPosition(arg, priority);
+         return this.transformPosition(arg.valueOf(), priority);

[Survived] PrecomputedMutator
src/Delta.ts:491:22
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(3)));

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               thisData !== null && otherData !== null && typeof thisData === 'object' && typeof otherData === 'object'

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'object' && op.retain !== null && op.retain !== undefined) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'object' && op.retain !== null && op.retain !== undefined && op.retain !== 'string') {
