[Survived] PrecomputedMutator
src/policymap.ts:12:26
-       for (const policy of policies) {
+       for (const policy of policies.slice()) {

[Survived] PrecomputedMutator
src/policymap.ts:41:9
-         ? policy.matches(path, ctx)
+         ? policy.matches(path, ctx, undefined)
