[Survived] PrecomputedMutator
src/build-timezone.js:14:38
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isInteger(tz.d + 1) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.floor(min))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(-input);

[Survived] PrecomputedMutator
src/index.js:54:19
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId, options, null);

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: tzs[key].deprecated ? null : tzs[key]
+   });
