[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude === null || longitude === null) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude > 90 || latitude === 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (!point.hasOwnProperty('type')) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (point.coordinates.length < 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:32
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('longitude') || !object.hasOwnProperty('longitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:70
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('latitude')) {

[Survived] PrecomputedMutator
src/geo-point.ts:125:19
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ2) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:126:15
-       const θ = atan2(y, x);
+       const θ = Math.atan2(y, x);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing) + 180);

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(bearing + 180));

[Survived] PrecomputedMutator
src/geo-point.ts:151:33
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = sin(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(θ + Math.PI);

[Survived] PrecomputedMutator
src/geo-point.ts:154:21
-       const φ2 = asin(sinφ2);
+       const φ2 = asin(sinφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(λ1) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance * 2, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, -distance, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, -bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, this);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, null);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.longitude, point.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(null, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, point.longitude);
