[Survived] PrecomputedMutator
src/build-country.js:29:9
-       if (!countries) return result;
+       if (!Array.isArray(countries)) return result;

[Survived] PrecomputedMutator
src/build-country.js:32:11
-         if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+         if (!Object.keys(result).includes(country)) Object.assign(result, { [country]: { current: [], all: [] } });

[Survived] PrecomputedMutator
src/build-country.js:33:11
-         if (tz.r === undefined) result[country].current.push(id);
+         if (tz.a === undefined) result[country].current.push(id);

[Survived] PrecomputedMutator
src/build-timezone.js:14:38
-     const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
+     const dstOffset = Number.isInteger(tz.d + 10) ? tz.d : utcOffset;

[Survived] PrecomputedMutator
src/build-timezone.js:25:7
-     if (timezone.r) result.deprecated = true;
+     if (timezone.a) result.deprecated = true;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(input * -1);

[Survived] PrecomputedMutator
src/index.js:5:36
-   const totalTimezones = Object.keys(data.timezones).length;
+   const totalTimezones = Object.keys(Object.values(data.timezones)).length;

[Survived] PrecomputedMutator
src/index.js:12:32
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, {
+     [id]: getCountry(id, options) || {}
+   });

[Survived] PrecomputedMutator
src/index.js:12:40
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id.toUpperCase(), options) });

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!Object.keys(countries).includes(id)) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!timezones[name] && timezones[name] !== null) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(data.timezones).filter(tz => tz.startsWith('A')).length).length;

[Survived] PrecomputedMutator
src/index.js:39:35
-     memoizedTimezones = Object.keys(timezone).length;
+     memoizedTimezones = Object.keys(Object.keys(data.timezones).map(tz => tz.toUpperCase()).length).length;

[Survived] PrecomputedMutator
src/index.js:55:7
-     if (!country) return null;
+     if (!country || country.timezones.length === 0) return null;

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (deprecated != null) return tzs;

[Survived] PrecomputedMutator
src/index.js:70:7
-     if (!country) return null;
+     if (!country || country.id === '') return null;
