[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (typeof a === 'string') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:20:32
-       let attributes = cloneDeep(b);
+       let attributes = cloneDeep(b || {});

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:5
-       for (const key in a) {
-         if (a[key] !== undefined && b[key] === undefined) {
-           attributes[key] = a[key];
-         }
-       }
+       for (const key of Object.keys(a)) {
+     if (a[key] !== undefined && b[key] === undefined) {
+       attributes[key] = a[key];
+     }
+   }

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:5
-       for (const key in a) {
-         if (a[key] !== undefined && b[key] === undefined) {
-           attributes[key] = a[key];
-         }
-       }
+       for (const key in {
+     ...a,
+     ...b
+   }) {
+     if (a[key] !== undefined && b[key] === undefined) {
+       attributes[key] = a[key];
+     }
+   }

[Survived] PrecomputedMutator
src/AttributeMap.ts:70:11
-         if (attr[key] !== base[key] && base[key] === undefined) {
+         if (attr[key] === undefined || base[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:88:9
-       if (!priority) {
+       if (!priority && priority !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(String.fromCharCode(65)); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:23:7
-     if (typeof b !== 'object' || b === null) {
+     if (typeof b === 'string') {

[Survived] PrecomputedMutator
src/Delta.ts:141:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes != null) {

[Survived] PrecomputedMutator
src/Delta.ts:146:11
-             typeof newOp.retain === 'number' &&
-             typeof lastOp.retain === 'number'
+             newOp.retain > 0 && lastOp.retain > 0

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.attributes != null) {

[Survived] PrecomputedMutator
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (index < this.ops.length - 1) {

[Survived] PrecomputedMutator
src/Delta.ts:182:25
-       return this.ops.map(predicate);
+       return this.ops.map(predicate.bind(this));

[Survived] PrecomputedMutator
src/Delta.ts:199:12
-       return this.ops.reduce(predicate, initialValue);
+       return this.ops.reduce(predicate, initialValue * 2);

[Survived] PrecomputedMutator
src/Delta.ts:199:12
-       return this.ops.reduce(predicate, initialValue);
+       return this.ops.reduce(predicate, 0);

[Survived] PrecomputedMutator
src/Delta.ts:228:28
-           nextOp = iter.next(end - index);
+           nextOp = iter.next(Math.max(0, end - index));

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther != null && typeof firstOther.retain === 'string' && firstOther.attributes == null

[Survived] PrecomputedMutator
src/Delta.ts:248:9
-           thisIter.peekType() === 'insert' &&
+           otherIter.peekType() === 'insert' &&

[Survived] PrecomputedMutator
src/Delta.ts:252:18
-           ops.push(thisIter.next());
+           ops.push(thisIter.next(0));

[Survived] PrecomputedMutator
src/Delta.ts:261:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(1));

[Survived] PrecomputedMutator
src/Delta.ts:263:20
-           delta.push(thisIter.next());
+           delta.push(thisIter.next(1));

[Survived] PrecomputedMutator
src/Delta.ts:270:15
-             if (typeof thisOp.retain === 'number') {
+             if (thisOp.retain > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:275:19
-                 if (thisOp.retain == null) {
+                 if (thisOp.retain == undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               !otherIter.hasNext() && !isEqual(delta.ops[delta.ops.length - 1], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(newOp.attributes, delta.ops[delta.ops.length - 1].attributes)

[Survived] PrecomputedMutator
src/Delta.ts:333:18
-         delta.push(other.ops[0]);
+         delta.push(other.ops[0] || {});

[Survived] PrecomputedMutator
src/Delta.ts:355:24
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], 0);

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], 0);

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], undefined);

[Survived] PrecomputedMutator
src/Delta.ts:360:14
-         while (length > 0) {
+         while (length !== 0) {

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(thisIter.peekLength() + 1);

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(Math.max(otherIter.peekLength(), length));

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), otherIter.peekLength() + 1);

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(length));

[Survived] PrecomputedMutator
src/Delta.ts:365:42
-               retDelta.push(otherIter.next(opLength));
+               retDelta.push(otherIter.next(otherIter.peekLength() + 1));

[Survived] PrecomputedMutator
src/Delta.ts:378:42
-               const thisOp = thisIter.next(opLength);
+               const thisOp = thisIter.next(length);

[Survived] PrecomputedMutator
src/Delta.ts:420:19
-           line.push(iter.next(index));
+           line.push(iter.next(1));

[Survived] PrecomputedMutator
src/Delta.ts:420:29
-           line.push(iter.next(index));
+           line.push(iter.next(i + 1));

[Survived] PrecomputedMutator
src/Delta.ts:422:39
-           if (predicate(line, iter.next(1).attributes || {}, i) === false) {
+           if (predicate(line, iter.next(1 + i).attributes || {}, i) === false) {

[Survived] PrecomputedMutator
src/Delta.ts:438:25
-           inverted.delete(Op.length(op));
+           inverted.delete(op.insert.length);

[Survived] PrecomputedMutator
src/Delta.ts:446:15
-             if (op.delete) {
+             if (op.retain === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.attributes && op.retain) {

[Survived] PrecomputedMutator
src/Delta.ts:451:35
-                 AttributeMap.invert(op.attributes, baseOp.attributes),
+                 AttributeMap.invert(op.attributes || {}, baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:466:31
-             AttributeMap.invert(op.attributes, baseOp.attributes),
+             AttributeMap.invert(op.attributes || {}, baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(1)));

[Survived] PrecomputedMutator
src/Delta.ts:493:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(2));

[Survived] PrecomputedMutator
src/Delta.ts:493:20
-           delta.push(otherIter.next());
+           delta.push(otherIter.next(0));

[Survived] PrecomputedMutator
src/Delta.ts:516:43
-               const embedType = Object.keys(thisData)[0];
+               const embedType = Object.keys(otherData)[0];

[Survived] PrecomputedMutator
src/Delta.ts:517:43
-               if (embedType === Object.keys(otherData)[0]) {
+               if (embedType === Object.keys(thisData)[0]) {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (typeof op.retain === 'number' && op.retain > 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:40:13
-           if (typeof nextOp.retain === 'number') {
+           if (nextOp.retain > 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:48:20
-           } else if (typeof nextOp.insert === 'string') {
+           } else if (nextOp.insert.length > 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:66:9
-       if (this.ops[this.index]) {
+       if (this.ops[this.index] || null) {

[Survived] PrecomputedMutator
src/OpIterator.ts:68:24
-         return Op.length(this.ops[this.index]) - this.offset;
+         return Op.length(this.ops[this.index] || {
+     insert: ''
+   }) - this.offset;

[Survived] PrecomputedMutator
src/OpIterator.ts:92:9
-       if (!this.hasNext()) {
+       if (this.index === this.ops.length) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.index === this.ops.length) {
