[Survived] PrecomputedMutator
lib/request.js:6:19
-     const request = url.trimLeft().startsWith('https') ? https : http;
+     const request = url.toLowerCase().startsWith('https') ? https : http;

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(res.pipe(createWriteStream(dest, {
+     flags: 'a'
+   })))

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(res.pipe(createWriteStream(dest, {
+     encoding: 'utf8'
+   })))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream('wrong_destination.txt'))

[Survived] PrecomputedMutator
lib/request.js:19:34
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest + '.bak'))

[Survived] PrecomputedMutator
lib/request.js:23:33
-       .on('timeout', () => reject(new TimeoutError()))
+       .on('timeout', () => reject(reject(new TimeoutError('Timeout occurred'))))

[Survived] PrecomputedMutator
index.js:5:7
-     if (!options.url) {
+     if (!options.url && options.url !== '') {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (!options.dest && options.dest !== '') {

[Survived] PrecomputedMutator
index.js:9:7
-     if (!options.dest) {
+     if (options.dest == null) {

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(new Error('Destination is not provided'));

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(Promise.resolve('No destination provided'));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!options.dest.startsWith('/')) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest + 'extra')) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(path.join(options.dest, 'dummy'))) {

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(options.dest);

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.relative(__dirname, options.dest);
