[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude < 0 && longitude < 0) {

[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (typeof latitude === 'string' || typeof longitude === 'string') {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude <= -90 || latitude >= 90) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -360 || longitude > 360) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (latitude < -180 || latitude > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (typeof point === 'string') {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (Array.isArray(point)) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject({
+     type: 'Point'
+   })) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type === undefined || point.coordinates === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.type && !point.coordinates) {

[Survived] PrecomputedMutator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (point.type === 'Point' && point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point.type === undefined) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates) && point.coordinates.length === 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (typeof object === 'string') {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.latitude && !object.longitude) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (object.hasOwnProperty('lat') || object.hasOwnProperty('long')) {

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r > 2 ? 2 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r === 1 ? 0 : r) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Math.abs(bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:144:30
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Number(coordinate.longitude));

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(cos(φ1 + 1));

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(0), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(0);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(sin(θ));

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(0), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(cosφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(0);

[Survived] PrecomputedMutator
src/geo-point.ts:154:21
-       const φ2 = asin(sinφ2);
+       const φ2 = asin(sinφ1 + sinδ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:27
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(0, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, cosθ);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, sinφ1);

[Survived] PrecomputedMutator
src/geo-point.ts:159:30
-       const latitude = rad2deg(φ2);
+       const latitude = rad2deg(φ1 + δ);

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance + 1000, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:12
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, -bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(point1, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, this.latitude);

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(new GeoPoint(0, 0));

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance({
+     latitude: this.latitude + 1,
+     longitude: this.longitude + 1
+   });

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this.latitude * 2, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, this);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, new GeoPoint(this.latitude + 1, this.longitude + 1));

[Survived] PrecomputedMutator
src/geo-point.ts:272:28
-       return GeoPoint.toTile(this, zoom);
+       return GeoPoint.toTile({
+     longitude: this.longitude,
+     latitude: this.latitude
+   }, zoom);

[Survived] PrecomputedMutator
src/geo-point.ts:272:28
-       return GeoPoint.toTile(this, zoom);
+       return GeoPoint.toTile(new GeoPoint(this.latitude, this.longitude), zoom);

[Survived] PrecomputedMutator
src/geo-point.ts:297:64
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(input.toFixed(Math.abs(precision)));

[Survived] PrecomputedMutator
src/geo-point.ts:299:55
-       return new GeoPoint(adjust(this.latitude), adjust(this.longitude));
+       return new GeoPoint(adjust(this.latitude), adjust(Math.abs(this.longitude)));
