[Survived] PrecomputedMutator
index.js:25:11
-       obj = JSON.parse(data, options ? options.reviver : null)
+       obj = JSON.parse(data, options.reviver || null)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {
+     encoding: 'utf8'
+   })

[Survived] PrecomputedMutator
index.js:68:35
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.appendFile)(file, str, options)

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, 'utf8')

[Survived] PrecomputedMutator
index.js:68:60
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {
+     mode: 0o666
+   })

[Survived] PrecomputedMutator
index.js:76:25
-     const str = stringify(obj, options)
+     const str = stringify({
+     ...obj
+   }, options)

[Survived] PrecomputedMutator
index.js:78:10
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, {
+     ...options,
+     encoding: 'utf8'
+   })

[Survived] PrecomputedMutator
index.js:78:38
-     return fs.writeFileSync(file, str, options)
+     return fs.writeFileSync(file, str, {
+     encoding: 'utf8'
+   })

[Survived] PrecomputedMutator
utils.js:3:30
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify({
+     ...obj
+   }, replacer, spaces)

[Survived] PrecomputedMutator
utils.js:11:26
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^\uFEFF\s*/, '')
