[Survived] PrecomputedMutator
src/AttributeMap.ts:21:9
-       if (!keepNull) {
+       if (!keepNull && true) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:29:5
-       for (const key in a) {
-         if (a[key] !== undefined && b[key] === undefined) {
-           attributes[key] = a[key];
-         }
-       }
+       for (const key in {
+     ...a
+   }) {
+     if (a[key] !== undefined && b[key] === undefined) {
+       attributes[key] = a[key];
+     }
+   }

[Survived] PrecomputedMutator
src/AttributeMap.ts:88:9
-       if (!priority) {
+       if (!priority && a !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(a).length > 0 ? attributes : null).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.keys(b).length > 0 ? attributes : attributes).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:51:9
-       if (!handler) {
+       if (!this.handlers[embedType]) {

[Survived] PrecomputedMutator
src/Delta.ts:204:11
-         if (elem.insert) {
+         if (elem.insert && elem.insert.length) {

[Survived] PrecomputedMutator
src/Delta.ts:265:33
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(Math.max(thisIter.peekLength(), 0), otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:265:56
-           const length = Math.min(thisIter.peekLength(), otherIter.peekLength());
+           const length = Math.min(thisIter.peekLength(), 1);

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(newOp, delta.ops[0])

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(newOp, null)

[Survived] PrecomputedMutator
src/Delta.ts:313:33
-               return delta.concat(rest).chop();
+               return delta.concat(new Delta(thisIter.rest()).concat(new Delta(otherIter.rest()))).chop();

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], -1);

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(thisIter.peekLength() + 1, length);

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.peekType() === 'insert') {

[Survived] PrecomputedMutator
src/Delta.ts:451:35
-                 AttributeMap.invert(op.attributes, baseOp.attributes),
+                 AttributeMap.invert({
+     ...op.attributes
+   }, baseOp.attributes),

[Survived] PrecomputedMutator
src/Delta.ts:498:13
-           if (thisOp.delete) {
+           if (thisOp.retain === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:518:48
-                 const handler = Delta.getHandler(embedType);
+                 const handler = Delta.getHandler(Object.keys(otherData)[0]);

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (module.exports === null) {

[Survived] PrecomputedMutator
src/OpIterator.ts:76:9
-       if (op) {
+       if (typeof op === 'object') {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.index > 0) {

[Survived] PrecomputedMutator
src/OpIterator.ts:100:35
-         const rest = this.ops.slice(this.index);
+         const rest = this.ops.slice(this.index + this.offset);
