[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones - memoizedTimezones !== 0) Object.keys(data.timezones).forEach(getTimezone);
