[Survived] PrecomputedMutator
lib/dirty/dirty.js:34:35
-         const cbs = this._queue.get(key) || [];
+         const cbs = this._queue.get(this._data.get(key)) || [];

[Survived] PrecomputedMutator
lib/dirty/dirty.js:35:24
-         if (cb) cbs.push(cb);
+         if (cb) cbs.push(() => cb(null));

[Survived] PrecomputedMutator
lib/dirty/dirty.js:36:7
-         this._queue.set(key, cbs);
+         this._queue['set'](key, cbs);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:186:38
-         const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
+         const data = `${JSON.stringify({
+     key,
+     val: this._data.has(key) ? this._data.get(key) : undefined
+   })}\n`;
