[Survived] PrecomputedMutator
src/geo-point.ts:121:24
-       const Δλ = deg2rad(point2.longitude - point1.longitude);
+       const Δλ = deg2rad(-point1.longitude + point2.longitude);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(Math.cos(Math.PI / 2));

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(Math.sin(Number(distance) / radius)), cosδ = cos(δ);
