[Survived] PrecomputedMutator
index.js:66:25
-     const str = stringify(obj, options)
+     const str = stringify(obj.toJSON ? obj.toJSON() : obj, options)

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, {
+     writeFile: fs.writeFile
+   })
