[Survived] PrecomputedMutator
index.js:16:1
-   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+   addRule(/[^aeiou]y$|quy$/i, function (w) {
+     return w.slice(0, -1) + 'ies';
+   })

[Survived] PrecomputedMutator
index.js:16:9
-   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+   addRule(/[^aeiou]y$|quy?$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|ss$/i, function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|s$/i, function (w) {
+     return w + (w.endsWith('e') ? '' : 'e') + 's';
+   })

[Survived] PrecomputedMutator
index.js:19:9
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|[^aeiou]ch$|s$/i, function(w) { return w + 'es' })

[Survived] PrecomputedMutator
index.js:22:50
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function (w) {
+     return w.slice(0, -2) + 'i';
+   });

[Survived] PrecomputedMutator
index.js:22:80
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(w.substr(w.length - 1, 1) === 'y' ? w.slice(0, -1) + 'ies' : w + 'es', w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:23:9
-   addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+   addRule(/thes|cris/i, function(w) { return w.substr(0, w.length - 2) + 'es' });

[Survived] PrecomputedMutator
index.js:23:27
-   addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+   addRule(/thesis|crisis/i, function (w) {
+     return w.slice(0, -2) + 'es';
+   });

[Survived] PrecomputedMutator
index.js:23:57
-   addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+   addRule(/thesis|crisis/i, function(w) { return w.substr(w.substr(1, w.length - 2), w.length - 2) + 'es' });

[Survived] PrecomputedMutator
index.js:24:9
-   addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+   addRule(/appendix|index|testis/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });

[Survived] PrecomputedMutator
index.js:24:28
-   addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+   addRule(/appendix|index/i, function (w) {
+     return w.slice(0, -2) + 'ices';
+   });

[Survived] PrecomputedMutator
index.js:24:58
-   addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+   addRule(/appendix|index/i, function(w) { return w.substr(w.slice(-2), w.length - 2) + 'ices' });

[Survived] PrecomputedMutator
index.js:27:9
-   addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
+   addRule(/[aeiou]o/i, function(w) { return w + 's' });

[Survived] PrecomputedMutator
index.js:27:9
-   addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
+   addRule(/[aeiouy]o/.test, function(w) { return w + 's' });

[Survived] PrecomputedMutator
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if ('dwarf' in ['dwarf', 'roof']) {

[Survived] PrecomputedMutator
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if (['dwarf', 'roof'].includes(w)) {

[Survived] PrecomputedMutator
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if (w.toLowerCase() === 'dwarf' || w.toLowerCase() === 'roof') {

[Survived] PrecomputedMutator
index.js:36:20
-     return w.replace(regex, 'ves')
+     return w.replace(/fe?$/i, 'ves')

[Survived] PrecomputedMutator
index.js:36:20
-     return w.replace(regex, 'ves')
+     return w.replace(new RegExp('fe?$', 'i'), 'ves')

[Survived] PrecomputedMutator
index.js:39:1
-   addRule('criterion', 'criteria')
+   addRule(/criterion$/i, 'criteria')

[Survived] PrecomputedMutator
index.js:39:9
-   addRule('criterion', 'criteria')
+   addRule(/criterion/i, 'criteria')

[Survived] PrecomputedMutator
index.js:39:22
-   addRule('criterion', 'criteria')
+   addRule('criterion', () => 'criteria')

[Survived] PrecomputedMutator
index.js:40:1
-   addRule('bacterium', 'bacteria')
+   addRule('bacteria', 'bacterium')

[Survived] PrecomputedMutator
index.js:40:1
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', function (w) {
+     return w + 'a';
+   })

[Survived] PrecomputedMutator
index.js:40:1
-   addRule('bacterium', 'bacteria')
+   addRule(/[^aeiou]a$|qua$/i, function (w) {
+     return w.substr(0, w.length - 1) + 'ae';
+   })

[Survived] PrecomputedMutator
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', 'bacteriums')

[Survived] PrecomputedMutator
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', function (w) {
+     return w + 'a';
+   })

[Survived] PrecomputedMutator
index.js:40:22
-   addRule('bacterium', 'bacteria')
+   addRule('bacterium', function (w) {
+     return w.toUpperCase() + 'S';
+   })

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('cell', 'cells')

[Survived] PrecomputedMutator
index.js:42:9
-   addRule('cello', 'cellos')
+   addRule(function (w) {
+     return w + 's';
+   }, 'cellos')

[Survived] PrecomputedMutator
index.js:42:18
-   addRule('cello', 'cellos')
+   addRule('cello', 'cell')

[Survived] PrecomputedMutator
index.js:42:18
-   addRule('cello', 'cellos')
+   addRule('cello', function () {
+     return 'cell';
+   })

[Survived] PrecomputedMutator
index.js:43:9
-   addRule('die', 'dice')
+   addRule('dice' && 'die', 'dice')

[Survived] PrecomputedMutator
index.js:43:9
-   addRule('die', 'dice')
+   addRule('dice' ? 'die' : 'six', 'dice')

[Survived] PrecomputedMutator
index.js:43:16
-   addRule('die', 'dice')
+   addRule('die', () => 'dice')

[Survived] PrecomputedMutator
index.js:45:18
-   addRule('mouse', 'mice')
+   addRule('mouse', () => 'mice')

[Survived] PrecomputedMutator
index.js:47:1
-   addRule('chilli', 'chillies')
+   addRule('chilli', function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:49:1
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?mAN$/i, function (w) {
+     return w.replace(/a/, 'e');
+   })

[Survived] PrecomputedMutator
index.js:49:1
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?man$/i, function (w) {
+     return w.replace('a', 'e');
+   })

[Survived] PrecomputedMutator
index.js:49:26
-   addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+   addRule(/^(?:wo)?man$/i, function (w) {
+     return w.replace(/a/g, 'e');
+   })

[Survived] PrecomputedMutator
index.js:63:53
-   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games.concat('notgames'), illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})

[Survived] PrecomputedMutator
index.js:63:82
-   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+   addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('||') + ')s\\b', 'i'), function(w) { return w})

[Survived] PrecomputedMutator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 1 || num === null) {

[Survived] PrecomputedMutator
index.js:76:7
-     if (num !== 1 || num === undefined) {
+     if (num !== 0 || num === undefined) {

[Survived] PrecomputedMutator
index.js:80:11
-         if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+         if (rule[0] instanceof RegExp && rule[0].test(word)) {

[Survived] PrecomputedMutator
index.js:80:16
-         if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+         if (type(rule['0']) === 'RegExp' && rule[0].test(word)) {

[Survived] PrecomputedMutator
index.js:80:41
-         if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+         if (type(rule[0]) === 'RegExp' && rule[0].exec(word)) {

[Survived] PrecomputedMutator
index.js:81:47
-           return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
+           return type(rule[1]) === 'Function' ? rule[2] || rule[1](word, rule[0]) : rule[1]

[Survived] PrecomputedMutator
index.js:83:16
-         if (type(rule[0]) === 'String' && rule[0] === word) {
+         if (type(rule['0']) === 'String' && rule[0] === word) {

[Survived] PrecomputedMutator
index.js:84:16
-           return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+           return rule[0].constructor(rule[1]) === 'Function' ? rule[1](word) : rule[1]

[Survived] PrecomputedMutator
index.js:103:7
-     if (String.prototype.plural === undefined) {
+     if (true) {

[Survived] PrecomputedMutator
index.js:105:21
-         return plural(this, num)
+         return plural(Math, num)

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, num + 1)

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, Math.floor(num))
