[Survived] PrecomputedMutator
sinks/drain.js:14:22
-       if(abort) return sink.abort()
+       if(abort) return doneLackingErr.message()

[Survived] PrecomputedMutator
sinks/find.js:9:6
-     if(!cb)
+     if(cb === undefined)

[Survived] PrecomputedMutator
sinks/find.js:9:6
-     if(!cb)
+     if(typeof cb === 'undefined')

[Survived] PrecomputedMutator
sinks/log.js:7:17
-       console.log(data)
+       console.log(console.error(data))

[Survived] PrecomputedMutator
sinks/on-end.js:6:22
-     return drain(null, done)
+     return drain(null, done.bind(null))

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(() => cb(true), abort, onAbort)

[Survived] PrecomputedMutator
throughs/async-map.js:7:6
-     if(!map) return id
+     if(Array.isArray(map) && map.length === 0) return id

[Survived] PrecomputedMutator
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(map === undefined) read(abort, function (err) {

[Survived] PrecomputedMutator
throughs/filter-not.js:8:48
-     return filter(function (data) { return !test(data) })
+     return filter(function (data) { return !test(data.toString()) })

[Survived] PrecomputedMutator
throughs/non-unique.js:7:24
-     return unique(field, true)
+     return unique(field, Math.random() > 0.5)

[Survived] PrecomputedMutator
util/tester.js:8:32
-       ? function (data) { return test.test(data) }
+       ? function (data) { return test['test'](data) }

[Survived] PrecomputedMutator
pull.js:5:7
-     if (typeof a === 'function' && a.length === 1) {
+     if (a.constructor.name === 'Function' && a.length === 1) {

[Survived] PrecomputedMutator
pull.js:5:7
-     if (typeof a === 'function' && a.length === 1) {
+     if (typeof a === 'function' && a.length == 1) {

[Survived] PrecomputedMutator
pull.js:24:41
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref[0], ref[1] * 0, ref[2], ref[3])
