[Survived] PrecomputedMutator
complex.js:41:51
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(Math.random()) + Math.exp(-x)) * 0.5;

[Survived] PrecomputedMutator
complex.js:45:47
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? x : (Math.exp(0) - Math.exp(-x)) * 0.5;

[Survived] PrecomputedMutator
complex.js:45:47
-       return Math.abs(x) < 1e-9 ? x : (Math.exp(x) - Math.exp(-x)) * 0.5;
+       return Math.abs(x) < 1e-9 ? x : (Math.exp(1) - Math.exp(-x)) * 0.5;

[Survived] PrecomputedMutator
complex.js:96:9
-       if (a < 3000 && b < 3000) {
+       if (a < 2999 && b < 2999) {

[Survived] PrecomputedMutator
complex.js:96:9
-       if (a < 3000 && b < 3000) {
+       if (a > -3000 && b > -3000) {

[Survived] PrecomputedMutator
complex.js:204:41
-               z['im'] = a['r'] * Math.sin(a['phi']);
+               z['im'] = a['r'] * Math.sin(1 * a['phi']);

[Survived] PrecomputedMutator
complex.js:222:15
-             if (tokens === null) {
+             if (typeof tokens === 'undefined') {

[Survived] PrecomputedMutator
complex.js:416:11
-         if (this['isInfinite']() || z['isZero']()) {
+         if (!this['isFinite']()) {

[Survived] PrecomputedMutator
complex.js:421:11
-         if (this['isZero']() || z['isInfinite']()) {
+         if (this['re'] === Infinity) {

[Survived] PrecomputedMutator
complex.js:421:11
-         if (this['isZero']() || z['isInfinite']()) {
+         if (z['isZero']() || this['isInfinite']()) {

[Survived] PrecomputedMutator
complex.js:437:11
-         if (Math.abs(c) < Math.abs(d)) {
+         if (Math.abs(c) < Math.abs(d.valueOf())) {

[Survived] PrecomputedMutator
complex.js:437:34
-         if (Math.abs(c) < Math.abs(d)) {
+         if (Math.abs(c) < Math.abs(-d)) {

[Survived] PrecomputedMutator
complex.js:476:13
-           if (b === 0 && a > 0) {
+           if (b == 0 && a > 0) {

[Survived] PrecomputedMutator
complex.js:476:13
-           if (b === 0 && a > 0) {
+           if (b === 0 && a >= 0) {

[Survived] PrecomputedMutator
complex.js:486:49
-                 return new Complex(0, Math.pow(b, z['re']));
+                 return new Complex(0, Math.pow(b, 1));

[Survived] PrecomputedMutator
complex.js:488:44
-                 return new Complex(-Math.pow(b, z['re']), 0);
+                 return new Complex(-Math.pow(this['im'], z['re']), 0);

[Survived] PrecomputedMutator
complex.js:519:17
-         var loh = logHypot(a, b);
+         var loh = logHypot(this['im'], this['re']);

[Survived] PrecomputedMutator
complex.js:552:11
-         if (a <= 0) {
+         if (a < Number.EPSILON) {

[Survived] PrecomputedMutator
complex.js:727:50
-         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(2 * a);
+         var d = 0.5 * cosh(2 * b) + 0.5 * Math.cos(Math.cos(this['im']));

[Survived] PrecomputedMutator
complex.js:731:23
-           Math.sin(a) * sinh(b) / d);
+           Math.sin(a) * -sinh(b) / d);

[Survived] PrecomputedMutator
complex.js:843:42
-           return new Complex(Math.atan2(1, a), 0);
+           return new Complex(Math.atan2(1, Math.random()), 0);

[Survived] PrecomputedMutator
complex.js:921:14
-           sinh(a) * Math.cos(b),
+           sinh(this['re'] * this['re']) * Math.cos(b),

[Survived] PrecomputedMutator
complex.js:992:19
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 * sinh(this['re']) * Math.cos(b) / d,

[Survived] PrecomputedMutator
complex.js:992:33
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 * sinh(a) * Math.cos(this['im'] * 2) / d,

[Survived] PrecomputedMutator
complex.js:993:18
-           2 * cosh(a) * Math.sin(b) / d);
+           2 * cosh(Math.exp(a)) * Math.sin(b) / d);

[Survived] PrecomputedMutator
complex.js:993:23
-           2 * cosh(a) * Math.sin(b) / d);
+           2 * cosh(a) * 0 * Math.sin(b) / d);

[Survived] PrecomputedMutator
complex.js:1010:32
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) * Math.cos(1 / b) / d,

[Survived] PrecomputedMutator
complex.js:1010:32
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) * Math.cos(Math.cos(2 * a)) / d,

[Survived] PrecomputedMutator
complex.js:1010:32
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) * Math.cos(this.re) / d,

[Survived] PrecomputedMutator
complex.js:1026:17
-         var res = this['asin']();
+         var res = Math.asin();

[Survived] PrecomputedMutator
complex.js:1085:26
-         x['re'] = logHypot(x['re'], x['im']) / 2;
+         x['re'] = logHypot(Math.abs(x['re']), x['im']) / 2;

[Survived] PrecomputedMutator
complex.js:1087:11
-         if (noIM) {
+         if (x['im'] = 0) {

[Survived] PrecomputedMutator
complex.js:1183:11
-         if (this['isZero']()) {
+         if (Object.values(this).every(val => val === 0)) {

[Survived] PrecomputedMutator
complex.js:1254:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, places || NaN);
