[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(Math.abs(offset) % 60)}`;

[Survived] PrecomputedMutator
src/index.js:23:40
-     return deliverCountry(countries[id], options);
+     return deliverCountry(countries[id], options || {});

[Survived] PrecomputedMutator
src/index.js:49:50
-     const [main] = getCountriesForTimezone(tzName, options);
+     const [main] = getCountriesForTimezone(tzName, options || {});

[Survived] PrecomputedMutator
src/index.js:54:41
-     const country = getCountry(countryId, options);
+     const country = getCountry(countryId, options || {});
