[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (Object.keys(a).length === 0) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:21:9
-       if (!keepNull) {
+       if (keepNull === false) {

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(String.fromCharCode(Math.floor(Math.random() * 10))); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(String.fromCharCode(65535)); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:305:22
-             delta.push(newOp);
+             delta.push(Object.assign({}, newOp));

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(Infinity, length);

[Survived] PrecomputedMutator
src/Delta.ts:408:11
-         if (iter.peekType() !== 'insert') {
+         if (iter.peekType() !== 'insert' && iter.peekType() !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:429:9
-       if (line.length() > 0) {
+       if (line.constructor.prototype.length.call(line) > 0) {
