[Survived] PrecomputedMutator
lib/dirty/dirty.js:113:15
-             if (err.code === 'ENOENT') {
+             if (err.message.includes('ENOENT')) {

[Survived] PrecomputedMutator
lib/dirty/dirty.js:113:15
-             if (err.code === 'ENOENT') {
+             if (err instanceof Error && err.code === 'ENOENT') {

[Survived] PrecomputedMutator
lib/dirty/dirty.js:142:17
-               if (row.val === undefined) {
+               if ('undefined' === typeof row.val) {

[Survived] PrecomputedMutator
lib/dirty/dirty.js:145:39
-                 this._data.set(row.key, row.val);
+                 this._data.set(row.key, row.val || '');

[Survived] PrecomputedMutator
lib/dirty/dirty.js:168:11
-         if (!this._queue.size) {
+         if (!this._queue.length) {

[Survived] PrecomputedMutator
lib/dirty/dirty.js:182:9
-       if (!this._queue.size || this._waitForDrain) return;
+       if (this._queue.length === 0 && this._waitForDrain) return;

[Survived] PrecomputedMutator
lib/dirty/dirty.js:189:51
-           if (!cbs.length && err != null) this.emit('error', err);
+           if (!cbs.length && err != null) this.emit('warn', err);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:189:51
-           if (!cbs.length && err != null) this.emit('error', err);
+           if (!cbs.length && err != null) this.emit(() => {}, err);

[Survived] PrecomputedMutator
lib/dirty/dirty.js:190:65
-           if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
+           if (--this._inFlightWrites <= 0 && !this._waitForDrain) this._writeStream.emit('drain');
