[Survived] PrecomputedMutator
index.js:19:20
-     let data = await universalify.fromCallback(fs.readFile)(file, options)
+     let data = await fs.readFileSync(file, options)

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, {})

[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, () => {})

[Survived] PrecomputedMutator
index.js:50:41
-       let content = fs.readFileSync(file, options)
+       let content = fs.readFileSync(file, this)

[Survived] PrecomputedMutator
index.js:51:24
-       content = stripBom(content)
+       content = stripBom(fs.readFileSync(file, options))

[Survived] PrecomputedMutator
index.js:54:9
-       if (shouldThrow) {
+       if (options.throws !== undefined ? options.throws : true) {

[Survived] PrecomputedMutator
index.js:68:9
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(fs.writeFile)(file, str, _fs)

[Survived] PrecomputedMutator
index.js:68:35
-     await universalify.fromCallback(fs.writeFile)(file, str, options)
+     await universalify.fromCallback(_fs.writeFile)(file, str, options)

[Survived] PrecomputedMutator
utils.js:3:30
-     const str = JSON.stringify(obj, replacer, spaces)
+     const str = JSON.stringify(Object.assign({}, obj), replacer, spaces)

[Survived] PrecomputedMutator
utils.js:5:10
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/[\n\r]/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content.constructor === Buffer) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (global.Buffer.isBuffer(content)) content = content.toString('utf8')

[Survived] PrecomputedMutator
utils.js:10:60
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (Buffer.isBuffer(content)) content = content.toString(undefined)

[Survived] PrecomputedMutator
utils.js:11:10
-     return content.replace(/^\uFEFF/, '')
+     return content.replace(/^[\uFEFF]/, '')
