[Survived] PrecomputedMutator
index.js:23:57
-   addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+   addRule(/thesis|crisis/i, function(w) { return w.substr(plural, w.length - 2) + 'es' });

[Survived] PrecomputedMutator
index.js:33:7
-     if (w === 'dwarf' || w === 'roof') {
+     if (w in {
+     dwarf: 1,
+     roof: 1
+   }) {

[Survived] PrecomputedMutator
index.js:47:19
-   addRule('chilli', 'chillies')
+   addRule('chilli', function (w) {
+     return w + 'es';
+   })

[Survived] PrecomputedMutator
index.js:105:21
-         return plural(this, num)
+         return plural(0, num)
