[Survived] PrecomputedMutator
sinks/find.js:15:8
-       if(test(data)) {
+       if(test && test(data)) {

[Survived] PrecomputedMutator
sinks/on-end.js:6:16
-     return drain(null, done)
+     return drain(done, done)

[Survived] PrecomputedMutator
sources/infinite.js:5:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(1 / (end || 1))

[Survived] PrecomputedMutator
sources/infinite.js:5:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(end && end.toString())

[Survived] PrecomputedMutator
sources/once.js:7:14
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb(null, value))

[Survived] PrecomputedMutator
sources/once.js:7:33
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, abort, value)

[Survived] PrecomputedMutator
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(i > array.length) return abortCb(cb, abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb.apply(null, [true]), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:7:32
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(abort) return abortCb(cb(null, true), abort, onAbort)

[Survived] PrecomputedMutator
sources/values.js:8:14
-         return cb(true)
+         return false(true)

[Survived] PrecomputedMutator
throughs/filter-not.js:8:17
-     return filter(function (data) { return !test(data) })
+     return filter(data => !test(data + 1))

[Survived] PrecomputedMutator
throughs/filter.js:7:17
-     test = tester(test)
+     test = tester(test || function () {})

[Survived] PrecomputedMutator
throughs/filter.js:11:13
-         while(loop) {
+         while(loop && true) {

[Survived] PrecomputedMutator
throughs/filter.js:16:46
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(false, cb)

[Survived] PrecomputedMutator
throughs/filter.js:16:51
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, cb(true, data))

[Survived] PrecomputedMutator
throughs/filter.js:16:51
-               return sync ? loop = true : next(end, cb)
+               return sync ? loop = true : next(end, function () {
+     cb(end, data);
+   })

[Survived] PrecomputedMutator
throughs/flatten.js:36:14
-             if(stream && 'object' === typeof stream)
+             if(stream !== null && 'object' === typeof stream)

[Survived] PrecomputedMutator
throughs/flatten.js:36:14
-             if(stream && 'object' === typeof stream)
+             if(stream instanceof Array && 'object' === typeof stream)

[Survived] PrecomputedMutator
throughs/map.js:7:6
-     if(!mapper) return id
+     if(mapper.valueOf() === 0) return id

[Survived] PrecomputedMutator
throughs/map.js:7:6
-     if(!mapper) return id
+     if(!mapper.constructor.name) return id

[Survived] PrecomputedMutator
throughs/map.js:8:17
-     mapper = prop(mapper)
+     mapper = prop(mapper === null ? function () {} : mapper)

[Survived] PrecomputedMutator
throughs/map.js:8:17
-     mapper = prop(mapper)
+     mapper = prop(mapper || id)

[Survived] PrecomputedMutator
throughs/take.js:28:14
-             if(ended = ended || end) {
+             if(ended = end || false) {

[Survived] PrecomputedMutator
throughs/take.js:32:19
-             else if(!test(data)) {
+             else if(!test.call(this, data)) {

[Survived] PrecomputedMutator
throughs/through.js:17:27
-           if(!end) op && op(data)
+           if(!end) op && op(this)

[Survived] PrecomputedMutator
throughs/through.js:18:19
-           else once(end)
+           else once(cb)

[Survived] PrecomputedMutator
throughs/through.js:19:9
-           cb(end, data)
+           cb(end, data, null)

[Survived] PrecomputedMutator
util/prop.js:6:33
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = 1(data); return v && v[0] }

[Survived] PrecomputedMutator
pull.js:7:20
-       for(var i = 0; i < length; i++)
+       for(var i = 0; i < length + 1; i++)

[Survived] PrecomputedMutator
pull.js:20:15
-         switch (length) {
+         switch (i) {

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(ref.slice(0, 4).join(','))

[Survived] PrecomputedMutator
pull.js:24:22
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(ref.filter(function (_, i) {
+     return i < 4;
+   }).map(function (e) {
+     return e;
+   }))

[Survived] PrecomputedMutator
pull.js:24:33
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4: return pull(read, ref.shift(), ref[1], ref[2], ref[3])

[Survived] PrecomputedMutator
pull.js:40:9
-       if (typeof s === 'function') {
+       if ('function' === typeof s) {

[Survived] PrecomputedMutator
pull.js:40:9
-       if (typeof s === 'function') {
+       if (s && s.constructor.name === 'Function') {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s.prototype === 'object') {
