[Survived] PrecomputedMutator
lib/ZipAFolder.ts:114:13
-           if (!zipAFolderOptions?.customWriteStream && targetFilePath) {
+           if (!zipAFolderOptions?.['customWriteStream'] && targetFilePath) {

[Survived] PrecomputedMutator
lib/ZipAFolder.ts:143:17
-               if (isGlob(src)) {
+               if (typeof src === 'string' && src.includes('*')) {
