[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (data.timezones.length !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
