[Survived] PrecomputedMutator
src/AttributeMap.ts:14:9
-       if (typeof a !== 'object') {
+       if (Array.isArray(a)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:17:9
-       if (typeof b !== 'object') {
+       if (Array.isArray(b)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:20:32
-       let attributes = cloneDeep(b);
+       let attributes = cloneDeep(Object.assign({}, a, b));

[Survived] PrecomputedMutator
src/AttributeMap.ts:22:32
-         attributes = Object.keys(attributes).reduce<AttributeMap>((copy, key) => {
+         attributes = Object.keys(Object.assign({}, b)).reduce<AttributeMap>((copy, key) => {

[Survived] PrecomputedMutator
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (a[key] !== null && b[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (a.hasOwnProperty(key) && b[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:30:11
-         if (a[key] !== undefined && b[key] === undefined) {
+         if (key in a && b[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (Array.isArray(a)) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:44:9
-       if (typeof b !== 'object') {
+       if (typeof b !== 'object' && b !== null) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:48:27
-         .concat(Object.keys(b))
+         .concat(Object.keys(b || []))

[Survived] PrecomputedMutator
src/AttributeMap.ts:70:11
-         if (attr[key] !== base[key] && base[key] === undefined) {
+         if (attr[key] !== undefined && base[key] === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:85:9
-       if (typeof b !== 'object') {
+       if (b === undefined || typeof b !== 'object') {

[Survived] PrecomputedMutator
src/AttributeMap.ts:97:24
-       return Object.keys(attributes).length > 0 ? attributes : undefined;
+       return Object.keys(Object.assign({}, b)).length > 0 ? attributes : undefined;

[Survived] PrecomputedMutator
src/Delta.ts:8:24
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCodePoint(0); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(String.fromCharCode(Math.floor(Math.random() * 256))); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:8:44
-   const NULL_CHARACTER = String.fromCharCode(0); // Placeholder char for embed in diff()
+   const NULL_CHARACTER = String.fromCharCode(String.fromCharCode(0x7F)); // Placeholder char for embed in diff()

[Survived] PrecomputedMutator
src/Delta.ts:20:7
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' && a !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:20:7
-     if (typeof a !== 'object' || a === null) {
+     if (typeof a !== 'object' || a === true) {

[Survived] PrecomputedMutator
src/Delta.ts:29:63
-         `embed types not matched: ${embedType} != ${Object.keys(b)[0]}`,
+         `embed types not matched: ${embedType} != ${Object.keys(JSON.parse(JSON.stringify(b)))[0]}`,

[Survived] PrecomputedMutator
src/Delta.ts:51:9
-       if (!handler) {
+       if (typeof handler === 'undefined') {

[Survived] PrecomputedMutator
src/Delta.ts:60:9
-       if (Array.isArray(ops)) {
+       if (ops instanceof Array) {

[Survived] PrecomputedMutator
src/Delta.ts:62:16
-       } else if (ops != null && Array.isArray(ops.ops)) {
+       } else if (ops !== undefined && Array.isArray(ops.ops)) {

[Survived] PrecomputedMutator
src/Delta.ts:135:11
-         if (isEqual(newOp.attributes, lastOp.attributes)) {
+         if (JSON.stringify(newOp.attributes) === JSON.stringify(lastOp.attributes)) {

[Survived] PrecomputedMutator
src/Delta.ts:135:11
-         if (isEqual(newOp.attributes, lastOp.attributes)) {
+         if (isEqual(lastOp.attributes, newOp.attributes)) {

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (typeof newOp.attributes !== 'undefined') {

[Survived] PrecomputedMutator
src/Delta.ts:157:9
-       if (index === this.ops.length) {
+       if (index >= this.ops.length) {

[Survived] PrecomputedMutator
src/Delta.ts:160:7
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(index, '0', newOp);

[Survived] PrecomputedMutator
src/Delta.ts:160:7
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(index, -1, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:160:23
-         this.ops.splice(index, 0, newOp);
+         this.ops.splice(-1, 0, newOp);

[Survived] PrecomputedMutator
src/Delta.ts:178:22
-       this.ops.forEach(predicate);
+       this.ops.forEach((op, index) => predicate(op));

[Survived] PrecomputedMutator
src/Delta.ts:189:32
-         const target = predicate(op) ? passed : failed;
+         const target = predicate(op || {}) ? passed : failed;

[Survived] PrecomputedMutator
src/Delta.ts:204:11
-         if (elem.insert) {
+         if (elem['insert']) {

[Survived] PrecomputedMutator
src/Delta.ts:223:12
-       while (index < end && iter.hasNext()) {
+       while (index < end && iter.peek() !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:226:28
-           nextOp = iter.next(start - index);
+           nextOp = iter.next(Math.abs(start - index));

[Survived] PrecomputedMutator
src/Delta.ts:242:7
-         firstOther != null &&
-         typeof firstOther.retain === 'number' &&
-         firstOther.attributes == null
+         firstOther?.retain !== undefined && firstOther.attributes === null

[Survived] PrecomputedMutator
src/Delta.ts:259:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (thisIter.peek() !== null || otherIter.peek() !== null) {

[Survived] PrecomputedMutator
src/Delta.ts:259:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (thisIter.peekType() !== undefined || otherIter.peekType() !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:259:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (thisIter.peekLength() > 0 || otherIter.peekLength() > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:263:20
-           delta.push(thisIter.next());
+           delta.push(thisIter.next(0));

[Survived] PrecomputedMutator
src/Delta.ts:268:13
-           if (otherOp.retain) {
+           if (otherOp.retain || 0) {

[Survived] PrecomputedMutator
src/Delta.ts:274:17
-               if (typeof otherOp.retain === 'number') {
+               if (otherOp.retain > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:275:19
-                 if (thisOp.retain == null) {
+                 if (thisOp.retain === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:275:19
-                 if (thisOp.retain == null) {
+                 if (typeof thisOp.retain === 'undefined') {

[Survived] PrecomputedMutator
src/Delta.ts:275:19
-                 if (thisOp.retain == null) {
+                 if (!thisOp.hasOwnProperty('retain')) {

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               thisIter.hasNext() && isEqual(delta.ops[delta.ops.length - 2], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(newOp, delta.ops[delta.ops.length - 1])

[Survived] PrecomputedMutator
src/Delta.ts:310:13
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[Math.floor(Math.random() * delta.ops.length)], newOp)

[Survived] PrecomputedMutator
src/Delta.ts:310:54
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], {})

[Survived] PrecomputedMutator
src/Delta.ts:310:54
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], null)

[Survived] PrecomputedMutator
src/Delta.ts:310:54
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               isEqual(delta.ops[delta.ops.length - 1], thisOp)

[Survived] PrecomputedMutator
src/Delta.ts:331:29
-       const delta = new Delta(this.ops.slice());
+       const delta = new Delta(this.ops.concat());

[Survived] PrecomputedMutator
src/Delta.ts:332:9
-       if (other.ops.length > 0) {
+       if (other.ops.length >= 1) {

[Survived] PrecomputedMutator
src/Delta.ts:332:9
-       if (other.ops.length > 0) {
+       if (other.ops.length !== 0) {

[Survived] PrecomputedMutator
src/Delta.ts:332:9
-       if (other.ops.length > 0) {
+       if (Array.isArray(other.ops) && other.ops.length > 0) {

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (this.ops[0] === other.ops[0]) {

[Survived] PrecomputedMutator
src/Delta.ts:340:9
-       if (this.ops === other.ops) {
+       if (JSON.stringify(this.ops) === JSON.stringify(other.ops)) {

[Survived] PrecomputedMutator
src/Delta.ts:355:29
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(''.concat(strings[0]), strings[1], cursor);

[Survived] PrecomputedMutator
src/Delta.ts:355:53
-       const diffResult = diff(strings[0], strings[1], cursor);
+       const diffResult = diff(strings[0], strings[1], null);

[Survived] PrecomputedMutator
src/Delta.ts:360:14
-         while (length > 0) {
+         while (length >= 1) {

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:364:24
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(thisIter.peekLength(), length);

[Survived] PrecomputedMutator
src/Delta.ts:364:33
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(thisIter.peekLength(), length);

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), thisIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:364:57
-               opLength = Math.min(otherIter.peekLength(), length);
+               opLength = Math.min(otherIter.peekLength(), Infinity);

[Survived] PrecomputedMutator
src/Delta.ts:368:24
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(1);

[Survived] PrecomputedMutator
src/Delta.ts:368:41
-               opLength = Math.min(length, thisIter.peekLength());
+               opLength = Math.min(length, 100);

[Survived] PrecomputedMutator
src/Delta.ts:378:42
-               const thisOp = thisIter.next(opLength);
+               const thisOp = thisIter.next(Math.max(length, 1));

[Survived] PrecomputedMutator
src/Delta.ts:378:42
-               const thisOp = thisIter.next(opLength);
+               const thisOp = thisIter.next(otherIter.peekLength());

[Survived] PrecomputedMutator
src/Delta.ts:380:25
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert || '', otherOp.insert)) {

[Survived] PrecomputedMutator
src/Delta.ts:380:40
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert || '')) {

[Survived] PrecomputedMutator
src/Delta.ts:380:40
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.insert ?? '<REPLACEMENT_VALUE>')) {

[Survived] PrecomputedMutator
src/Delta.ts:380:40
-               if (isEqual(thisOp.insert, otherOp.insert)) {
+               if (isEqual(thisOp.insert, otherOp.hasOwnProperty('insert') ? otherOp.insert : '<REPLACEMENT_VALUE>')) {

[Survived] PrecomputedMutator
src/Delta.ts:386:15
-                 retDelta.push(otherOp).delete(opLength);
+                 retDelta['push'](otherOp).delete(opLength);

[Survived] PrecomputedMutator
src/Delta.ts:407:12
-       while (iter.hasNext()) {
+       while (iter.peek() !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:417:11
-         if (index < 0) {
+         if (index <= -1) {

[Survived] PrecomputedMutator
src/Delta.ts:418:19
-           line.push(iter.next());
+           line.push(iter.next(1));

[Survived] PrecomputedMutator
src/Delta.ts:437:11
-         if (op.insert) {
+         if (op.insert || '') {

[Survived] PrecomputedMutator
src/Delta.ts:439:18
-         } else if (typeof op.retain === 'number' && op.attributes == null) {
+         } else if (typeof op.retain === 'number' && op.attributes === undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:440:25
-           inverted.retain(op.retain);
+           inverted.retain(op.retain || 0);

[Survived] PrecomputedMutator
src/Delta.ts:440:25
-           inverted.retain(op.retain);
+           inverted.retain(op.retain ?? 0);

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain && op.attributes || {}) {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.retain !== undefined && op.attributes) {

[Survived] PrecomputedMutator
src/Delta.ts:448:22
-             } else if (op.retain && op.attributes) {
+             } else if (op.attributes || op.retain) {

[Survived] PrecomputedMutator
src/Delta.ts:450:25
-                 Op.length(baseOp),
+                 Op.length(Object.assign({}, baseOp)),

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (op.retain !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:456:18
-         } else if (typeof op.retain === 'object' && op.retain !== null) {
+         } else if (op.retain && typeof op.retain === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:486:12
-       while (thisIter.hasNext() || otherIter.hasNext()) {
+       while (otherIter.peek() !== undefined) {

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter.next(0)));

[Survived] PrecomputedMutator
src/Delta.ts:491:32
-           delta.retain(Op.length(thisIter.next()));
+           delta.retain(Op.length(thisIter['next']()));

[Survived] PrecomputedMutator
src/Delta.ts:511:13
-               typeof thisData === 'object' &&
-               thisData !== null &&
-               typeof otherData === 'object' &&
-               otherData !== null
+               Object.keys(thisData).length > 0 && Object.keys(otherData).length > 0

[Survived] PrecomputedMutator
src/Delta.ts:516:43
-               const embedType = Object.keys(thisData)[0];
+               const embedType = Object.keys(thisData || {})[0];

[Survived] PrecomputedMutator
src/Delta.ts:550:12
-       while (thisIter.hasNext() && offset <= index) {
+       while (thisIter.peekLength() > 0 && offset <= index) {

[Survived] PrecomputedMutator
src/Delta.ts:557:18
-         } else if (nextType === 'insert' && (offset < index || !priority)) {
+         } else if (nextType === 'insert' && (offset + 1 < index || !priority)) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (typeof global === 'object') {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (global.module !== undefined) {

[Survived] PrecomputedMutator
src/Op.ts:16:16
-       } else if (typeof op.retain === 'number') {
+       } else if (op.hasOwnProperty('retain') && typeof op.retain === 'number') {

[Survived] PrecomputedMutator
src/Op.ts:18:16
-       } else if (typeof op.retain === 'object' && op.retain !== null) {
+       } else if (op.retain !== undefined) {

[Survived] PrecomputedMutator
src/OpIterator.ts:37:13
-           if (nextOp.attributes) {
+           if (nextOp['attributes']) {

[Survived] PrecomputedMutator
src/OpIterator.ts:37:13
-           if (nextOp.attributes) {
+           if (nextOp.hasOwnProperty('attributes')) {

[Survived] PrecomputedMutator
src/OpIterator.ts:37:13
-           if (nextOp.attributes) {
+           if (Reflect.get(nextOp, 'attributes')) {

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             nextOp.hasOwnProperty('retain')

[Survived] PrecomputedMutator
src/OpIterator.ts:43:11
-             typeof nextOp.retain === 'object' &&
-             nextOp.retain !== null
+             nextOp.retain !== undefined

[Survived] PrecomputedMutator
src/OpIterator.ts:49:55
-             retOp.insert = nextOp.insert.substr(offset, length);
+             retOp.insert = nextOp.insert.substr(offset, Math.min(nextOp.insert.length - offset, length));

[Survived] PrecomputedMutator
src/OpIterator.ts:80:9
-           typeof op.retain === 'number' ||
-           (typeof op.retain === 'object' && op.retain !== null)
+           op.retain !== undefined

[Survived] PrecomputedMutator
src/OpIterator.ts:92:9
-       if (!this.hasNext()) {
+       if (this.index >= this.ops.length) {

[Survived] PrecomputedMutator
src/OpIterator.ts:94:16
-       } else if (this.offset === 0) {
+       } else if (this.index.offset) {

[Survived] PrecomputedMutator
src/OpIterator.ts:95:14
-         return this.ops.slice(this.index);
+         return this.ops.splice(this.index);

[Survived] PrecomputedMutator
src/OpIterator.ts:100:35
-         const rest = this.ops.slice(this.index);
+         const rest = this.ops.slice(index + 1);

[Survived] PrecomputedMutator
src/OpIterator.ts:103:28
-         return [next].concat(rest);
+         return [next].concat(this.ops.slice(this.index + 1));

[Survived] PrecomputedMutator
src/OpIterator.ts:103:28
-         return [next].concat(rest);
+         return [next].concat(this.ops.filter(op => op !== this.ops[this.index]));
