[Survived] PrecomputedMutator
lib/request.js:10:11
-         if (res.statusCode !== 200) {
+         if (res.statusCode > 299) {

[Survived] PrecomputedMutator
lib/request.js:12:9
-           res.resume();
+           res.destroy();

[Survived] PrecomputedMutator
lib/request.js:12:9
-           res.resume();
+           res.unpipe();

[Survived] PrecomputedMutator
lib/request.js:19:16
-         res.pipe(createWriteStream(dest))
+         res.pipe(createWriteStream(dest).destroy())

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(new Error('The options.url is missing'));

[Survived] PrecomputedMutator
index.js:6:27
-       return Promise.reject(new Error('The options.url is required'));
+       return Promise.reject(true);

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject('An error occurred');

[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject(null);

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (!options.dest.includes('.')) {

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (options.dest.split('.').length === 1) {

[Survived] PrecomputedMutator
index.js:14:23
-       if (!path.extname(options.dest)) {
+       if (!path.extname('./' + options.dest)) {

[Survived] PrecomputedMutator
index.js:17:38
-         const basename = path.basename(pathname);
+         const basename = path.basename(path.basename(pathname));

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (options.dest === '') {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.win32.isAbsolute(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:7
-     if (!path.isAbsolute(options.dest)) {
+     if (path.relative(__dirname, options.dest) === '') {

[Survived] PrecomputedMutator
index.js:24:8
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.basename(options.dest)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(path.resolve(options.dest))) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(__dirname + '/' + options.dest)) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest.toString())) {

[Survived] PrecomputedMutator
index.js:25:20
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.join(__dirname, options.dest);

[Survived] PrecomputedMutator
index.js:25:33
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve('./', options.dest);

[Survived] PrecomputedMutator
index.js:25:44
-       options.dest = path.resolve(__dirname, options.dest);
+       options.dest = path.resolve(__dirname, options.dest + '/');

[Survived] PrecomputedMutator
index.js:28:18
-     return request(options);
+     return request(options || {});

[Survived] PrecomputedMutator
index.js:28:18
-     return request(options);
+     return request(Object.assign({}, options));
