[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray([1, 2]) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(Math.acos(r > 1 ? 1 : r) * 6371392.896);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this.calculateDistance(point));

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(0, point);
