[Survived] PrecomputedMutator
pull.js:38:3
-     for (var i = 1; i < length; i++) {
-       var s = arguments[i]
-       if (typeof s === 'function') {
-         read = s(read)
-       } else if (s && typeof s === 'object') {
-         s.sink(read)
-         read = s.source
-       }
-     }
+     for (let i = 1; i < length; i++) {
+     var s = arguments[i];
+     if (typeof s === 'function') {
+       read = s(read);
+     } else if (s && typeof s === 'object') {
+       s.sink(read);
+       read = s.source;
+     }
+   }

[Survived] PrecomputedMutator
pull.js:38:19
-     for (var i = 1; i < length; i++) {
+     for (var i = 1; i in arguments; i++) {

[Survived] PrecomputedMutator
pull.js:40:9
-       if (typeof s === 'function') {
+       if (s instanceof Function) {

[Survived] PrecomputedMutator
pull.js:40:9
-       if (typeof s === 'function') {
+       if (s.constructor === Function) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if ('s' in window) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s instanceof Object) {

[Survived] PrecomputedMutator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (Array.isArray(s)) {

[Survived] PrecomputedMutator
pull.js:43:7
-         s.sink(read)
+         s.source(read)

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(null)

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(123)

[Survived] PrecomputedMutator
pull.js:43:14
-         s.sink(read)
+         s.sink(this)
