[Survived] PrecomputedMutator
src/matcher.ts:115:39
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([.$]|[+*])/g, '\\$1')}`)

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.filter(rule => true)) {

[Survived] PrecomputedMutator
src/rule.ts:50:9
-       if (this.matches(path, ctx) && verb in this.verbs) {
+       if (this.matches(path, ctx) && Object.keys(this.verbs).includes(verb)) {

[Survived] PrecomputedMutator
src/rule.ts:69:27
-         for (let index = 0; index < count; index++) {
+         for (let index = 0; index in this.regex.props; index++) {

[Survived] PrecomputedMutator
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (match[index + 1] !== ctx[this.regex.props[index]]) {
