[Survived] PrecomputedMutator
complex.js:41:12
-       return Math.abs(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;
+       return Infinity(x) < 1e-9 ? 1 - x : (Math.exp(x) + Math.exp(-x)) * 0.5;

[Survived] PrecomputedMutator
complex.js:122:23
-       var _a = Math.abs(a);
+       var _a = Math.abs(Math.abs(a));

[Survived] PrecomputedMutator
complex.js:129:9
-       if (b === 0) {
+       if (Math.abs(b) < Number.EPSILON) {

[Survived] PrecomputedMutator
complex.js:232:24
-               } else if (c === '+') {
+               } else if (c.charCodeAt(0) === 43) {

[Survived] PrecomputedMutator
complex.js:239:17
-                   parser_exit();
+                   1 / 0();

[Survived] PrecomputedMutator
complex.js:358:11
-         if (this['isInfinite']() && z['isInfinite']()) {
+         if (this['isInfinite']() && z.isInfinite()) {

[Survived] PrecomputedMutator
complex.js:358:11
-         if (this['isInfinite']() && z['isInfinite']()) {
+         if (this.isInfinite() && z.isInfinite()) {

[Survived] PrecomputedMutator
complex.js:387:11
-         if (this['isInfinite']() || z['isInfinite']()) {
+         if (this['re'] === Infinity || z['re'] === Infinity || this['im'] === Infinity || z['im'] === Infinity) {

[Survived] PrecomputedMutator
complex.js:437:11
-         if (Math.abs(c) < Math.abs(d)) {
+         if (Math.abs(c) < Math.abs(d) || Math.abs(c) === Math.abs(d)) {

[Survived] PrecomputedMutator
complex.js:437:20
-         if (Math.abs(c) < Math.abs(d)) {
+         if (Math.abs(0) < Math.abs(d)) {

[Survived] PrecomputedMutator
complex.js:482:19
-             switch ((z['re'] % 4 + 4) % 4) {
+             switch ((z['re'] % 8 + 4) % 4) {

[Survived] PrecomputedMutator
complex.js:518:28
-         var arg = Math.atan2(b, a);
+         var arg = Math.atan2(this['im'], a);

[Survived] PrecomputedMutator
complex.js:543:13
-           if (b === 0) {
+           if (Object.is(b, 0)) {

[Survived] PrecomputedMutator
complex.js:547:30
-           re = 0.5 * Math.sqrt(2.0 * (r + a));
+           re = 0.5 * Math.sqrt(2.0 * Math.abs(r + a));

[Survived] PrecomputedMutator
complex.js:894:11
-         if (a === 0 && b === 0) {
+         if (a * b === 0) {

[Survived] PrecomputedMutator
complex.js:953:20
-         var d = cosh(a) + Math.cos(b);
+         var d = cosh(this['re'] + 1) + Math.cos(b);

[Survived] PrecomputedMutator
complex.js:956:14
-           sinh(a) / d,
+           sinh(this['re'] + 1) / d,

[Survived] PrecomputedMutator
complex.js:992:14
-           -2 * sinh(a) * Math.cos(b) / d,
+           -2 * Math.sin(a) * Math.cos(b) / d,

[Survived] PrecomputedMutator
complex.js:1007:38
-         var d = Math.cos(2 * b) + cosh(2 * a);
+         var d = Math.cos(2 * b) + cosh(this['re'] + this['re']);

[Survived] PrecomputedMutator
complex.js:1010:23
-           2 * cosh(a) * Math.cos(b) / d,
+           2 * cosh(a) * this['re'](b) / d,

[Survived] PrecomputedMutator
complex.js:1105:11
-         if (a === 0 && b === 0) {
+         if (a === 0 && Math.abs(b) < Number.EPSILON) {

[Survived] PrecomputedMutator
complex.js:1226:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, places === undefined ? 0 : places);

[Survived] PrecomputedMutator
complex.js:1226:29
-         places = Math.pow(10, places || 0);
+         places = Math.pow(10, places || null);

[Survived] PrecomputedMutator
complex.js:1272:23
-         return Math.abs(z['re'] - this['re']) <= Complex['EPSILON'] &&
+         return Math.abs(this['re'] - z['re']) <= Complex['EPSILON'] &&

[Survived] PrecomputedMutator
complex.js:1297:11
-         if (this['isNaN']()) {
+         if (Number.isNaN(this.re) && Number.isNaN(this.im)) {
