[Survived] PrecomputedMutator
src/build-country.js:5:7
-     if (!name) return null;
+     if (typeof name === 'undefined') return null;

[Survived] PrecomputedMutator
src/build-country.js:5:7
-     if (!name) return null;
+     if (!data.countries[id]) return null;

[Survived] PrecomputedMutator
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (timezonesMap === undefined) timezonesMap = buildTimezonesMap(data);

[Survived] PrecomputedMutator
src/build-country.js:23:22
-     return Object.keys(data.timezones).reduce((result, id) => {
+     return Object.keys(data['timezones']).reduce((result, id) => {

[Survived] PrecomputedMutator
src/build-country.js:23:22
-     return Object.keys(data.timezones).reduce((result, id) => {
+     return Object.keys(data.timezones || {}).reduce((result, id) => {

[Survived] PrecomputedMutator
src/build-country.js:23:22
-     return Object.keys(data.timezones).reduce((result, id) => {
+     return Object.keys(data['timezone' + 's']).reduce((result, id) => {

[Survived] PrecomputedMutator
src/build-timezone.js:3:7
-     if (!timezone) return null;
+     if (typeof timezone === 'undefined') return null;

[Survived] PrecomputedMutator
src/build-timezone.js:20:32
-       utcOffsetStr: getOffsetStr(utcOffset),
+       utcOffsetStr: getOffsetStr(1 * utcOffset),

[Survived] PrecomputedMutator
src/build-timezone.js:25:7
-     if (timezone.r) result.deprecated = true;
+     if (timezone.hasOwnProperty('r')) result.deprecated = true;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(60 * Math.floor(min / 60))}`;

[Survived] PrecomputedMutator
src/build-timezone.js:34:50
-     return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+     return `${sign}${getNumStr(hours)}:${getNumStr(min + '')}`;

[Survived] PrecomputedMutator
src/build-timezone.js:38:24
-     const num = Math.abs(input);
+     const num = Math.abs(Math.floor(input));

[Survived] PrecomputedMutator
src/index.js:5:36
-   const totalTimezones = Object.keys(data.timezones).length;
+   const totalTimezones = Object.keys(data['timezones']).length;

[Survived] PrecomputedMutator
src/index.js:5:36
-   const totalTimezones = Object.keys(data.timezones).length;
+   const totalTimezones = Object.keys(data.timezones || {}).length;

[Survived] PrecomputedMutator
src/index.js:11:22
-     return Object.keys(data.countries).reduce((prev, id) => {
+     return Object.keys(data['countries']).reduce((prev, id) => {

[Survived] PrecomputedMutator
src/index.js:11:22
-     return Object.keys(data.countries).reduce((prev, id) => {
+     return Object.keys(data.countries || []).reduce((prev, id) => {

[Survived] PrecomputedMutator
src/index.js:12:26
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev || {}, { [id]: getCountry(id, options) });

[Survived] PrecomputedMutator
src/index.js:12:26
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev ? {
+     ...prev,
+     [id]: getCountry(id, options)
+   } : {
+     [id]: getCountry(id, options)
+   }, { [id]: getCountry(id, options) });

[Survived] PrecomputedMutator
src/index.js:12:55
-       return Object.assign(prev, { [id]: getCountry(id, options) });
+       return Object.assign(prev, { [id]: getCountry(id, options || {}) });

[Survived] PrecomputedMutator
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (data.timezones.length !== 0) Object.keys(data.timezones).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:57
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones) Object.keys(data['timezones']).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:17:57
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones || {}).forEach(getTimezone);

[Survived] PrecomputedMutator
src/index.js:18:27
-     return deliverTimezones(timezones, options);
+     return deliverTimezones(timezones || {}, options);

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (!Object.prototype.hasOwnProperty.call(countries, id)) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:22:7
-     if (!countries[id]) memoizeCountry(buildCountry(data, id));
+     if (countries.hasOwnProperty(id) === false) memoizeCountry(buildCountry(data, id));

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!(name in timezones)) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:32:7
-     if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+     if (!Object.prototype.hasOwnProperty.call(timezones, name)) memoizeTimezone(buildTimezone(data, name));

[Survived] PrecomputedMutator
src/index.js:37:7
-     if (!timezone) return;
+     if (timezone === null) return;

[Survived] PrecomputedMutator
src/index.js:45:42
-     return values.map((c) => getCountry(c, options));
+     return values.map((c) => getCountry(c, options || {}));

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if ('deprecated' in options) return tzs;

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (options.hasOwnProperty('deprecated')) return tzs;

[Survived] PrecomputedMutator
src/index.js:62:7
-     if (deprecated === true) return tzs;
+     if (Object.prototype.toString.call(options.deprecated) === '[object Boolean]' && options.deprecated) return tzs;

[Survived] PrecomputedMutator
src/index.js:63:22
-     return Object.keys(tzs).reduce((prev, key) => {
+     return Object.keys(Object.keys(tzs).reduce((obj, key) => {
+     obj[key] = tzs[key];
+     return obj;
+   }, {})).reduce((prev, key) => {

[Survived] PrecomputedMutator
src/index.js:64:9
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!Object.prototype.hasOwnProperty.call(tzs[key], 'deprecated')) Object.assign(prev, { [key]: tzs[key] });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: {
+       ...tzs[key]
+     }
+   });

[Survived] PrecomputedMutator
src/index.js:64:31
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev, {
+     [key]: getTimezone(tzs[key].name)
+   });

[Survived] PrecomputedMutator
src/index.js:70:7
-     if (!country) return null;
+     if (typeof country === 'undefined') return null;
