[Survived] PrecomputedMutator
crawler-url-parser.js:47:49
-   	let parsedUrl = URL.parse(currentUrlStr, true, true);
+   	let parsedUrl = URL.parse(currentUrlStr, true, URL.parse(currentUrlStr, true, false));

[Survived] PrecomputedMutator
crawler-url-parser.js:55:45
-   		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
+   		let parsedBaseUrl = URL.parse(baseUrlStr, URL.parse(baseUrlStr, true), true);

[Survived] PrecomputedMutator
crawler-url-parser.js:55:45
-   		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
+   		let parsedBaseUrl = URL.parse(baseUrlStr, URL.parse(baseUrlStr, true, false), true);

[Survived] PrecomputedMutator
crawler-url-parser.js:57:28
-   		ret.baseurl = URL.format(parsedBaseUrl);
+   		ret.baseurl = URL.format(Object.assign({}, parsedBaseUrl));

[Survived] PrecomputedMutator
crawler-url-parser.js:102:19
-   			if (urlMap.has(currentUrl.url)) {
+   			if (urlMap.has(currentUrl.__proto__.url)) {

[Survived] PrecomputedMutator
crawler-url-parser.js:104:10
-   				if (!tmpUrl.text.includes(text)) {
+   				if (!''.indexOf(text)) {

[Survived] PrecomputedMutator
crawler-url-parser.js:149:41
-   	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
+   	let linkurl_parts = linkurl_path.split("/".concat("")).filter(function (elem, index, array) {

[Survived] PrecomputedMutator
crawler-url-parser.js:165:30
-   			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+   			if (linkurl_path.includes(pageurl_path.concat())) return "sublevel";
