[Survived] PrecomputedMutator
src/AttributeMap.ts:41:9
-       if (typeof a !== 'object') {
+       if (a === undefined) {

[Survived] PrecomputedMutator
src/AttributeMap.ts:48:27
-         .concat(Object.keys(b))
+         .concat(Object.keys(b || {}))

[Survived] PrecomputedMutator
src/Delta.ts:135:19
-         if (isEqual(newOp.attributes, lastOp.attributes)) {
+         if (isEqual(newOp['attributes'], lastOp.attributes)) {

[Survived] PrecomputedMutator
src/Delta.ts:150:15
-             if (typeof newOp.attributes === 'object') {
+             if (newOp.hasOwnProperty('attributes')) {

[Survived] PrecomputedMutator
src/Delta.ts:267:25
-           const otherOp = otherIter.next(length);
+           const otherOp = otherIter['next'](length);

[Survived] PrecomputedMutator
src/Delta.ts:309:13
-               !otherIter.hasNext() &&
-               isEqual(delta.ops[delta.ops.length - 1], newOp)
+               !otherIter.hasNext() && isEqual(delta.ops[delta.ops.length - 1], otherIter.peek())

[Survived] PrecomputedMutator
src/Delta.ts:319:11
-             typeof otherOp.delete === 'number' &&
-             (typeof thisOp.retain === 'number' ||
-               (typeof thisOp.retain === 'object' && thisOp.retain !== null))
+             typeof thisOp.retain !== 'undefined'

[Survived] PrecomputedMutator
src/Delta.ts:519:19
-                 if (handler) {
+                 if ({}) {

[Survived] PrecomputedMutator
src/Delta.ts:570:5
-   if (typeof module === 'object') {
+   if (module && typeof module === 'object') {
