[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (latitude instanceof Number || longitude instanceof Number) {

[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (isNaN(latitude) || isNaN(longitude)) {

[Survived] PrecomputedMutator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude === -90 || latitude === 90) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude === -180 || longitude === 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -180 || longitude >= 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (Math.abs(longitude) > 180) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (typeof point !== 'object') {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (point === null) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (point.constructor.name !== 'Object') {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject(Object(point))) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject({
+     ...point
+   })) {

[Survived] PrecomputedMutator
src/geo-point.ts:60:19
-       if (!isObject(point)) {
+       if (!isObject(JSON.parse(JSON.stringify(point)))) {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (point['type'] !== 'Point') {

[Survived] PrecomputedMutator
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (Object.prototype.hasOwnProperty.call(point, 'type') && point['type'] !== 'Point') {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (Array.isArray(point.coordinates) && point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (typeof object !== 'object') {

[Survived] PrecomputedMutator
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (Object.prototype.toString.call(object) !== '[object Object]') {

[Survived] PrecomputedMutator
src/geo-point.ts:85:10
-       if (!isObject(object)) {
+       if (!input => typeof input === 'object'(object)) {

[Survived] PrecomputedMutator
src/geo-point.ts:85:19
-       if (!isObject(object)) {
+       if (!isObject([])) {

[Survived] PrecomputedMutator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (Object.keys(object).length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:107:15
-       const c = sin(point1Rad) * sin(point2Rad);
+       const c = Math.sin(point1Rad) * sin(point2Rad);

[Survived] PrecomputedMutator
src/geo-point.ts:107:32
-       const c = sin(point1Rad) * sin(point2Rad);
+       const c = sin(point1Rad) * Math.sin(point2Rad);

[Survived] PrecomputedMutator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(Math.abs(r)) * 6371392.896;

[Survived] PrecomputedMutator
src/geo-point.ts:120:55
-       const φ1 = deg2rad(point1.latitude), φ2 = deg2rad(point2.latitude);
+       const φ1 = deg2rad(point1.latitude), φ2 = deg2rad(point2['latitude']);

[Survived] PrecomputedMutator
src/geo-point.ts:121:24
-       const Δλ = deg2rad(point2.longitude - point1.longitude);
+       const Δλ = deg2rad(point2['longitude'] - point1['longitude']);

[Survived] PrecomputedMutator
src/geo-point.ts:124:15
-       const y = sin(Δλ) * cos(φ2);
+       const y = Math.sin(Δλ) * cos(φ2);

[Survived] PrecomputedMutator
src/geo-point.ts:124:25
-       const y = sin(Δλ) * cos(φ2);
+       const y = sin(Δλ) * Math.cos(φ2);

[Survived] PrecomputedMutator
src/geo-point.ts:125:15
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = Math.cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:25
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * Math.sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:35
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - Math.sin(φ1) * cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:45
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * Math.cos(φ2) * cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:125:55
-       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * cos(Δλ);
+       const x = cos(φ1) * sin(φ2) - sin(φ1) * cos(φ2) * Math.cos(Δλ);

[Survived] PrecomputedMutator
src/geo-point.ts:128:21
-       return (rad2deg(θ) + 360) % 360;
+       return (rad2deg(Math.atan(y / x)) + 360) % 360;

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance * 2) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:143:22
-       const δ = Number(distance) / radius; // angular distance in radians
+       const δ = Number(distance / radius) / radius; // angular distance in radians

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(1 * bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(parseFloat(bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:144:23
-       const θ = deg2rad(Number(bearing));
+       const θ = deg2rad(Math.floor(bearing));

[Survived] PrecomputedMutator
src/geo-point.ts:147:24
-       const λ1 = deg2rad(coordinate.longitude);
+       const λ1 = deg2rad(0);

[Survived] PrecomputedMutator
src/geo-point.ts:149:36
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = Math.cos(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:149:36
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = Math.acos(φ1);

[Survived] PrecomputedMutator
src/geo-point.ts:149:40
-       const sinφ1 = sin(φ1), cosφ1 = cos(φ1);
+       const sinφ1 = sin(φ1), cosφ1 = cos(1);

[Survived] PrecomputedMutator
src/geo-point.ts:150:18
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = Math.sin(δ), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(Math.sin(distance / radius)), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:22
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(distance / radius * Math.PI / 180), cosδ = cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:33
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = Math.cos(δ);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(1 / distance);

[Survived] PrecomputedMutator
src/geo-point.ts:150:37
-       const sinδ = sin(δ), cosδ = cos(δ);
+       const sinδ = sin(δ), cosδ = cos(Math.exp(-distance));

[Survived] PrecomputedMutator
src/geo-point.ts:151:22
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(Math.sin(θ + Math.PI)), cosθ = cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:33
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = Math.cos(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:33
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = Math.sin(θ);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(1);

[Survived] PrecomputedMutator
src/geo-point.ts:151:37
-       const sinθ = sin(θ), cosθ = cos(θ);
+       const sinθ = sin(θ), cosθ = cos(Math.random());

[Survived] PrecomputedMutator
src/geo-point.ts:154:16
-       const φ2 = asin(sinφ2);
+       const φ2 = Math.asin(sinφ2);

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(-y, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, 1 / x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:21
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + Math.atan(y, x);

[Survived] PrecomputedMutator
src/geo-point.ts:157:30
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 + atan2(y, 1);

[Survived] PrecomputedMutator
src/geo-point.ts:160:32
-       const longitude = (rad2deg(λ2) + 540) % 360 - 180; // normalise to −180..+180°
+       const longitude = (rad2deg(0) + 540) % 360 - 180; // normalise to −180..+180°

[Survived] PrecomputedMutator
src/geo-point.ts:185:15
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = parseInt((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:185:15
-       const x = Math.floor((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));
+       const x = Math.trunc((coordinate.longitude + 180) / 360 * Math.pow(2, zoom));

[Survived] PrecomputedMutator
src/geo-point.ts:186:101
-       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180)) / Math.PI) / 2 * Math.pow(
+       const y = Math.floor((1 - Math.log(Math.tan(coordinate.latitude * Math.PI / 180) + 1 / Math.cos(coordinate.latitude * Math.PI / 180.001)) / Math.PI) / 2 * Math.pow(

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, 0, bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:48
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, Math.random(), bearing);

[Survived] PrecomputedMutator
src/geo-point.ts:201:58
-       return GeoPoint.calculateDestination(this, distance, bearing);
+       return GeoPoint.calculateDestination(this, distance, 180);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(null);

[Survived] PrecomputedMutator
src/geo-point.ts:210:12
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing({
+     latitude: 0,
+     longitude: 0
+   });

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(new GeoPoint(0, 0), point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(null, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:38
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing({
+     latitude: 0,
+     longitude: 0
+   }, point);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, this);

[Survived] PrecomputedMutator
src/geo-point.ts:210:44
-       return GeoPoint.calculateBearing(this, point);
+       return GeoPoint.calculateBearing(this, new GeoPoint(0, 0));

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(0, point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(new GeoPoint(0, 0), point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:39
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(Math.random(), point);

[Survived] PrecomputedMutator
src/geo-point.ts:219:45
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance(this, new GeoPoint(0, 0));

[Survived] PrecomputedMutator
src/geo-point.ts:297:39
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => input => input * 1(input.toFixed(precision));

[Survived] PrecomputedMutator
src/geo-point.ts:297:50
-       const adjust = (input: number) => parseFloat(input.toFixed(precision));
+       const adjust = (input: number) => parseFloat(Math.round(input * Math.pow(10, precision)) / Math.pow(10, precision));
