[Survived] PrecomputedMutator
sources/infinite.js:5:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(generate(end))

[Survived] PrecomputedMutator
sources/infinite.js:6:21
-       return cb(null, generate())
+       return cb(null, Math.sqrt(generate()))

[Survived] PrecomputedMutator
sources/once.js:7:26
-         return abortCb(cb, abort, onAbort)
+         return abortCb(cb, 0, onAbort)

[Survived] PrecomputedMutator
sources/values.js:21:16
-         cb(null, array[i++])
+         cb(null, array.shift())

[Survived] PrecomputedMutator
throughs/async-map.js:39:29
-                 else cb(null, data)
+                 else cb(null, prop(data))

[Survived] PrecomputedMutator
throughs/map.js:8:17
-     mapper = prop(mapper)
+     mapper = prop(mapper ? mapper : id)

[Survived] PrecomputedMutator
throughs/through.js:18:19
-           else once(end)
+           else once(data)

[Survived] PrecomputedMutator
throughs/unique.js:9:16
-     field = prop(field) || id
+     field = prop(function () {
+     return field;
+   }()) || id

[Survived] PrecomputedMutator
throughs/unique.js:9:16
-     field = prop(field) || id
+     field = prop(Math.random() ? field : id) || id

[Survived] PrecomputedMutator
index.js:17:1
-   for(var k in sinks)
-     exports[k] = sinks[k]
+   for (let k in sinks) exports[k] = sinks[k];

[Survived] PrecomputedMutator
pull.js:21:22
-         case 1: return pull(read, ref[0])
+         case 1: return read.length(read, ref[0])

[Survived] PrecomputedMutator
pull.js:27:16
-           return pull.apply(null, ref)
+           return pull.apply([])

[Survived] PrecomputedMutator
pull.js:27:16
-           return pull.apply(null, ref)
+           return pull.apply(arguments)

[Survived] PrecomputedMutator
pull.js:27:33
-           return pull.apply(null, ref)
+           return pull.apply(null, [...ref])

[Survived] PrecomputedMutator
pull.js:27:33
-           return pull.apply(null, ref)
+           return pull.apply(null, Object.assign([], ref))
