[Survived] PrecomputedMutator
src/matcher.ts:92:22
-     for (const part of spec.split('/').slice(1).reverse()) {
+     for (const part of spec.split('/').slice(1, Infinity).reverse()) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (/:./.test(part)) {

[Survived] PrecomputedMutator
src/matcher.ts:115:39
-             parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
+             parts.push(`/${part.replace(/([\W])/g, '\\$1')}`)

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.slice()) {
