[Survived] PrecomputedMutator
src/index.js:64:45
-       if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+       if (!tzs[key].deprecated) Object.assign(prev || {}, { [key]: tzs[key] });
