[Survived] PrecomputedMutator
index.js:10:27
-       return Promise.reject(new Error('The options.dest is required'));
+       return Promise.reject('The options.dest is missing');

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (options.dest.includes('.') === false) {

[Survived] PrecomputedMutator
index.js:14:9
-       if (!path.extname(options.dest)) {
+       if (!path.basename(options.dest).includes('.')) {

[Survived] PrecomputedMutator
index.js:24:24
-     if (!path.isAbsolute(options.dest)) {
+     if (!path.isAbsolute(options.dest || '/tmp/image')) {
