[Survived] PrecomputedMutator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (typeof latitude !== 'number' || latitude.toString() === '[object Number]' || typeof longitude !== 'number' || longitude.toString() === '[object Number]') {

[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point['coordinates']) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:72:24
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates.slice()) || point.coordinates.length !== 2) {

[Survived] PrecomputedMutator
src/geo-point.ts:219:12
-       return GeoPoint.calculateDistance(this, point);
+       return GeoPoint.calculateDistance([this.latitude, this.longitude]);
