[Survived] PrecomputedMutator
index.js:50:19
-       let content = fs.readFileSync(file, options)
+       let content = _fs.readFileSync(file, options)

[Survived] PrecomputedMutator
utils.js:5:22
-     return str.replace(/\n/g, EOL) + EOF
+     return str.replace(/(\r\n|\n)/g, EOL) + EOF

[Survived] PrecomputedMutator
utils.js:10:7
-     if (Buffer.isBuffer(content)) content = content.toString('utf8')
+     if (content && Buffer.isBuffer(content)) content = content.toString('utf8')
