[Survived] PrecomputedMutator
index.js:16:59
-   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+   addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(null, w.length - 1) + 'ies' })

[Survived] PrecomputedMutator
index.js:19:1
-   addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+   addRule(/x$|ch$|s$/i, function (w) {
+     return w + (w.endsWith('s') ? '' : 'es');
+   })

[Survived] PrecomputedMutator
index.js:22:9
-   addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+   addRule(/nucleus|syllabus|focus|fungus|cactus|[^aeiouy]i$/i, function(w) { return w.substr(0, w.length - 2) + 'i' });

[Survived] PrecomputedMutator
index.js:24:58
-   addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+   addRule(/appendix|index/i, function(w) { return w.substr('ve', w.length - 2) + 'ices' });

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('cellos', 'cell')

[Survived] PrecomputedMutator
index.js:42:1
-   addRule('cello', 'cellos')
+   addRule('cellular', 'cellules')

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, Math.random())

[Survived] PrecomputedMutator
index.js:105:27
-         return plural(this, num)
+         return plural(this, this)
