[Survived] PrecomputedMutator
sources/count.js:6:29
-       if(end) return cb && cb(end)
+       if(end) return cb && cb(Math.random())

[Survived] PrecomputedMutator
throughs/async-map.js:28:22
-             if(end) cb(end)
+             if(end) cb(new Error('This is a bug'))

[Survived] PrecomputedMutator
throughs/through.js:18:19
-           else once(end)
+           else once({})

[Survived] PrecomputedMutator
throughs/through.js:19:9
-           cb(end, data)
+           cb(end, data, 1)

[Survived] PrecomputedMutator
pull.js:5:7
-     if (typeof a === 'function' && a.length === 1) {
+     if ('function' === typeof a && a.length === 1) {

[Survived] PrecomputedMutator
pull.js:21:33
-         case 1: return pull(read, ref[0])
+         case 1: return pull(read, ref.length = 0)

[Survived] PrecomputedMutator
pull.js:26:21
-           ref.unshift(read)
+           ref.unshift(arguments[0])
