[Survived] PrecomputedMutator
src/matcher.ts:15:9
-       if (spec.match(/^\//) === null) {
+       if (spec.startsWith('/') === false) {

[Survived] PrecomputedMutator
src/matcher.ts:39:46
-       if (string.length > 1 && string.endsWith('/')) {
+       if (string.length > 1 && string.endsWith('./')) {

[Survived] PrecomputedMutator
src/matcher.ts:65:11
-         if (final && opt && min < 1) {
+         if (final && opt && min === 0) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.search(/:.+/) > -1) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (/:.+/.test(part)) {

[Survived] PrecomputedMutator
src/matcher.ts:111:13
-           if (part.match(/:.+/) !== null) {
+           if (part.includes(':')) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:.*/) !== null) {

[Survived] PrecomputedMutator
src/matcher.ts:111:24
-           if (part.match(/:.+/) !== null) {
+           if (part.match(/:[a-zA-Z0-9_]+/) !== null) {

[Survived] PrecomputedMutator
src/policy.ts:32:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.slice()) {

[Survived] PrecomputedMutator
src/policy.ts:32:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.concat()) {

[Survived] PrecomputedMutator
src/policy.ts:33:19
-         const res = rule.query(path, verb, ctx)
+         const res = rule.query(path, verb, Object.assign({}, ctx))

[Survived] PrecomputedMutator
src/policy.ts:33:19
-         const res = rule.query(path, verb, ctx)
+         const res = rule['query'](path, verb, ctx)

[Survived] PrecomputedMutator
src/policy.ts:48:24
-       for (const rule of this.rules) {
+       for (const rule of this.rules.slice(0)) {

[Survived] PrecomputedMutator
src/policy.ts:49:11
-         if (rule.matches(path, ctx)) {
+         if (rule['matches'](path, ctx)) {

[Survived] PrecomputedMutator
src/policymap.ts:7:24
-       super(policies.map((policy) => [policy.name, policy]))
+       super(policies.map(policy => [policy.name, policy, policy.name]))

[Survived] PrecomputedMutator
src/rule.ts:60:30
-       const match = path.match(this.regex)
+       const match = path.match(this.regex.source)

[Survived] PrecomputedMutator
src/rule.ts:61:9
-       if (match === null) {
+       if (this.regex.test(path) === false) {

[Survived] PrecomputedMutator
src/rule.ts:69:42
-         for (let index = 0; index < count; index++) {
+         for (let index = 0; index < count; index += 1) {

[Survived] PrecomputedMutator
src/rule.ts:71:13
-           if (prop === undefined || match[index + 1] !== prop) {
+           if (match[index + 1] !== undefined && match[index + 1] !== prop) {

[Survived] PrecomputedMutator
src/rule.ts:83:24
-       for (const verb in this.verbs) {
+       for (const verb in Object.keys(this.verbs).reduce((obj, key) => {
+     obj[key] = this.verbs[key];
+     return obj;
+   }, {})) {

[Survived] PrecomputedMutator
src/rule.ts:83:24
-       for (const verb in this.verbs) {
+       for (const verb in JSON.parse(JSON.stringify(this.verbs))) {
