[Survived] ArrayDeclaration
src/build-country.js:12:33
-       timezones: tzMap.current || [],
+       timezones: tzMap.current || ["Stryker was here"],

[Survived] ArrayDeclaration
src/build-country.js:13:32
-       allTimezones: tzMap.all || [],
+       allTimezones: tzMap.all || ["Stryker was here"],

[Survived] ConditionalExpression
src/build-country.js:18:7
-     if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+     if (true) timezonesMap = buildTimezonesMap(data);

[Survived] ConditionalExpression
src/index.js:17:7
-     if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+     if (true) Object.keys(data.timezones).forEach(getTimezone);

[Survived] ArrayDeclaration
src/index.js:56:39
-     const values = country.timezones || [];
+     const values = country.timezones || ["Stryker was here"];

[Survived] ObjectLiteral
src/index.js:77:16
-   export default {
-     getCountry,
-     getTimezone,
-     getAllCountries,
-     getAllTimezones,
-     getTimezonesForCountry,
-     getCountriesForTimezone,
-     getCountryForTimezone,
-   };
+   export default {};
