[Survived] ObjectLiteral
crawler-url-parser.js:5:34
-   const result_normalize_options = {
-   	removeDirectoryIndex: true,
-   	removeTrailingSlash: true,
-   	stripWWW: true,
-   	stripFragment: true,
-   	normalizeHttps: false,
-   	normalizeProtocol: true,
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
-   }
+   const result_normalize_options = {}

[Survived] BooleanLiteral
crawler-url-parser.js:6:24
-   	removeDirectoryIndex: true,
+   	removeDirectoryIndex: false,

[Survived] BooleanLiteral
crawler-url-parser.js:7:23
-   	removeTrailingSlash: true,
+   	removeTrailingSlash: false,

[Survived] BooleanLiteral
crawler-url-parser.js:8:12
-   	stripWWW: true,
+   	stripWWW: false,

[Survived] BooleanLiteral
crawler-url-parser.js:9:17
-   	stripFragment: true,
+   	stripFragment: false,

[Survived] BooleanLiteral
crawler-url-parser.js:10:18
-   	normalizeHttps: false,
+   	normalizeHttps: true,

[Survived] BooleanLiteral
crawler-url-parser.js:11:21
-   	normalizeProtocol: true,
+   	normalizeProtocol: false,

[Survived] ArrayDeclaration
crawler-url-parser.js:12:25
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
+   	removeQueryParameters: []

[Survived] Regex
crawler-url-parser.js:12:26
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
+   	removeQueryParameters: [/utm_\w+/i, 'ref']

[Survived] Regex
crawler-url-parser.js:12:26
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
+   	removeQueryParameters: [/^utm_\w/i, 'ref']

[Survived] Regex
crawler-url-parser.js:12:26
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
+   	removeQueryParameters: [/^utm_\W+/i, 'ref']

[Survived] StringLiteral
crawler-url-parser.js:12:39
-   	removeQueryParameters: [/^utm_\w+/i, 'ref']
+   	removeQueryParameters: [/^utm_\w+/i, ""]

[Survived] ObjectLiteral
crawler-url-parser.js:20:12
-   	let ret = {
-   		url: null,
-   		baseurl: null,
-   		protocol: null,
-   		host: null,
-   		domain: null,
-   		subdomain: null,
-   		path: null,
-   		search: null,
-   		querycount: 0
-   	}
+   	let ret = {}

[Survived] StringLiteral
crawler-url-parser.js:35:49
-   	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
+   	currentUrlStr = currentUrlStr.replace(/^\/\//, "");

[Survived] Regex
crawler-url-parser.js:36:40
-   	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+   	currentUrlStr = currentUrlStr.replace(/#.*/, '');

[Survived] Regex
crawler-url-parser.js:36:40
-   	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+   	currentUrlStr = currentUrlStr.replace(/#.$/, '');

[Survived] Regex
crawler-url-parser.js:40:35
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/#.*/, '');

[Survived] Regex
crawler-url-parser.js:40:35
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/#.$/, '');

[Survived] StringLiteral
crawler-url-parser.js:40:43
-   		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
+   		baseUrlStr = baseUrlStr.replace(/#.*$/, "Stryker was here!");

[Survived] Regex
crawler-url-parser.js:42:8
-   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+   		if (!/^\.*\/|(?!localhost)\w+:/.test(currentUrlStr)) {

[Survived] Regex
crawler-url-parser.js:42:8
-   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+   		if (!/^\.*\/|^(?=localhost)\w+:/.test(currentUrlStr)) {

[Survived] Regex
crawler-url-parser.js:42:8
-   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+   		if (!/^\.*\/|^(?!localhost)\w:/.test(currentUrlStr)) {

[Survived] Regex
crawler-url-parser.js:42:8
-   		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+   		if (!/^\.*\/|^(?!localhost)\W+:/.test(currentUrlStr)) {

[Survived] Regex
crawler-url-parser.js:43:42
-   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+   			currentUrlStr = currentUrlStr.replace(/(?!(?:\w+:)?\/\/)/, 'http://');

[Survived] Regex
crawler-url-parser.js:43:42
-   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)\/\/)/, 'http://');

[Survived] Regex
crawler-url-parser.js:43:42
-   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w:)?\/\/)/, 'http://');

[Survived] Regex
crawler-url-parser.js:43:42
-   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+   			currentUrlStr = currentUrlStr.replace(/^(?!(?:\W+:)?\/\/)/, 'http://');

[Survived] ConditionalExpression
crawler-url-parser.js:54:6
-   	if (parsedUrl.host == null && baseUrlStr) {
+   	if (true && baseUrlStr) {

[Survived] ConditionalExpression
crawler-url-parser.js:87:10
-   	let $ = typeof data === "string" ? cheerio.load(data) : data;
+   	let $ = true ? cheerio.load(data) : data;

[Survived] MethodExpression
crawler-url-parser.js:95:14
-   		let text = $(this).text().trim();
+   		let text = $(this).text();

[Survived] ConditionalExpression
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (false) return;

[Survived] LogicalOperator
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if ((typeof href == "undefined" || href.length < 3) && /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] ConditionalExpression
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (false || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] LogicalOperator
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" && href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] ConditionalExpression
crawler-url-parser.js:97:7
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (false || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] StringLiteral
crawler-url-parser.js:97:22
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] ConditionalExpression
crawler-url-parser.js:97:37
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || false || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] EqualityOperator
crawler-url-parser.js:97:37
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || href.length <= 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] Regex
crawler-url-parser.js:97:56
-   		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+   		if (typeof href == "undefined" || href.length < 3 || /(javascript|mailto:|ftp:)/ig.test(href)) return;

[Survived] ConditionalExpression
crawler-url-parser.js:102:8
-   			if (urlMap.has(currentUrl.url)) {
+   			if (false) {

[Survived] BlockStatement
crawler-url-parser.js:102:36
-   			if (urlMap.has(currentUrl.url)) {
-   				let tmpUrl = urlMap.get(currentUrl.url);
-   				if (!tmpUrl.text.includes(text)) {
-   					tmpUrl.text = `${tmpUrl.text} ${text}`;
-   				}
-   			} else {
+   			if (urlMap.has(currentUrl.url)) {} else {

[Survived] ConditionalExpression
crawler-url-parser.js:104:9
-   				if (!tmpUrl.text.includes(text)) {
+   				if (true) {

[Survived] ConditionalExpression
crawler-url-parser.js:104:9
-   				if (!tmpUrl.text.includes(text)) {
+   				if (false) {

[Survived] BlockStatement
crawler-url-parser.js:104:38
-   				if (!tmpUrl.text.includes(text)) {
-   					tmpUrl.text = `${tmpUrl.text} ${text}`;
-   				}
+   				if (!tmpUrl.text.includes(text)) {}

[Survived] StringLiteral
crawler-url-parser.js:105:20
-   					tmpUrl.text = `${tmpUrl.text} ${text}`;
+   					tmpUrl.text = ``;

[Survived] ConditionalExpression
crawler-url-parser.js:108:23
-   				currentUrl.text = text == null ? "" : text;
+   				currentUrl.text = true ? "" : text;

[Survived] ConditionalExpression
crawler-url-parser.js:108:23
-   				currentUrl.text = text == null ? "" : text;
+   				currentUrl.text = false ? "" : text;

[Survived] EqualityOperator
crawler-url-parser.js:108:23
-   				currentUrl.text = text == null ? "" : text;
+   				currentUrl.text = text != null ? "" : text;

[Survived] StringLiteral
crawler-url-parser.js:108:38
-   				currentUrl.text = text == null ? "" : text;
+   				currentUrl.text = text == null ? "Stryker was here!" : text;

[Survived] StringLiteral
crawler-url-parser.js:144:51
-   	let linkurl_path = linkurl.path ? linkurl.path : "";
+   	let linkurl_path = linkurl.path ? linkurl.path : "Stryker was here!";

[Survived] StringLiteral
crawler-url-parser.js:145:51
-   	let pageurl_path = pageurl.path ? pageurl.path : "";
+   	let pageurl_path = pageurl.path ? pageurl.path : "Stryker was here!";

[Survived] Regex
crawler-url-parser.js:146:38
-   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:146:71
-   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+/, '/');

[Survived] Regex
crawler-url-parser.js:146:71
-   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]$/, '/');

[Survived] Regex
crawler-url-parser.js:146:71
-   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[^a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:147:38
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:147:38
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:147:38
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[^a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:147:71
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+/, '/');

[Survived] Regex
crawler-url-parser.js:147:71
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]$/, '/');

[Survived] Regex
crawler-url-parser.js:147:71
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[^a-z]+$/, '/');

[Survived] StringLiteral
crawler-url-parser.js:147:93
-   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+   	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, "");

[Survived] Regex
crawler-url-parser.js:161:57
-   			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+   			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[^\/]?$/, "");

[Survived] Regex
crawler-url-parser.js:162:57
-   			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+   			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[^\/]?$/, "");

[Survived] ConditionalExpression
crawler-url-parser.js:163:8
-   			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+   			if (true) return "samelevel"

[Survived] ConditionalExpression
crawler-url-parser.js:166:14
-   		} else if (part_count_diff == -1) {
+   		} else if (true) {

[Survived] EqualityOperator
crawler-url-parser.js:172:7
-   		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+   		if (linkurl_subdomain_len <= pageurl_subdomain_len) return "updomain";

[Survived] ConditionalExpression
crawler-url-parser.js:185:5
-   if (!module.parent) {
+   if (false) {

[Survived] BlockStatement
crawler-url-parser.js:185:21
-   if (!module.parent) {
-   	console.log("for testing purpose");
-   	//getlevel("www.domain.com/aaa/bbb/","www.domain.com/aaa/bbb/ccc");
-   	//let res1 = getlevel("sub.domain.com/aaa/bbb/","sub.domain.com/aaa/bbb/ccc");
-   	//let res2 = getlevel("sub.domain.com/aaa/bbb/ccc/ddd","sub.domain.com/aaa/bbb/ccc");
-   	//let res3 = getlevel("sub.domain.com/aaa/bbb/eee","sub.domain.com/aaa/bbb/ccc");
-   	//debugger;
-   	//let res = parse("ddd","http://www.stackoverflow.com/aaa/bbb/ccc/");
-   	//let page = 'http://journals.tubitak.gov.tr/';
-   	//let link = 'http://journals.tubitak.gov.tr/genel/telifhakki.pdf';
-   	//let res = gettype(link, page);
-   	//debugger
-   	//res = gettype(page, link);
-   	//debugger
-   	//process.exit();
-   	let url = "https ://www.npmjs.com/package/electron-window-manager";
-   	let res = parse(url);
-   	debugger;
-   }
+   if (!module.parent) {}

[Survived] StringLiteral
crawler-url-parser.js:186:14
-   	console.log("for testing purpose");
+   	console.log("");

[Survived] StringLiteral
crawler-url-parser.js:204:12
-   	let url = "https ://www.npmjs.com/package/electron-window-manager";
+   	let url = "";
