[Survived] BooleanLiteral
lib/dirty/dirty.js:70:28
-         if (fn(key, val) === false) break;
+         if (fn(key, val) === true) break;

[Survived] ConditionalExpression
lib/dirty/dirty.js:87:9
-       if (this._queue.size || this._inFlightWrites > 0) {
+       if (false) {

[Survived] ConditionalExpression
lib/dirty/dirty.js:87:29
-       if (this._queue.size || this._inFlightWrites > 0) {
+       if (this._queue.size || false) {

[Survived] BlockStatement
lib/dirty/dirty.js:87:55
-       if (this._queue.size || this._inFlightWrites > 0) {
-         this.once('drain', () => this.close());
-         return;
-       }
+       if (this._queue.size || this._inFlightWrites > 0) {}

[Survived] StringLiteral
lib/dirty/dirty.js:88:17
-         this.once('drain', () => this.close());
+         this.once("", () => this.close());

[Survived] ArrowFunction
lib/dirty/dirty.js:88:26
-         this.once('drain', () => this.close());
+         this.once('drain', () => undefined);

[Survived] ConditionalExpression
lib/dirty/dirty.js:91:9
-       if (this._readStream) this._readStream.destroy();
+       if (false) this._readStream.destroy();

[Survived] ConditionalExpression
lib/dirty/dirty.js:92:9
-       if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
+       if (true) this._writeStream.end(() => this._writeStream.destroy());

[Survived] ArrowFunction
lib/dirty/dirty.js:92:50
-       if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
+       if (this._writeStream) this._writeStream.end(() => undefined);

[Survived] ObjectLiteral
lib/dirty/dirty.js:106:55
-       this._readStream = fs.createReadStream(this.path, {
-         encoding: 'utf-8',
-         flags: 'r',
-       });
+       this._readStream = fs.createReadStream(this.path, {});

[Survived] StringLiteral
lib/dirty/dirty.js:107:17
-         encoding: 'utf-8',
+         encoding: "",

[Survived] ConditionalExpression
lib/dirty/dirty.js:113:15
-             if (err.code === 'ENOENT') {
+             if (true) {

[Survived] StringLiteral
lib/dirty/dirty.js:118:21
-             this.emit('error', err);
+             this.emit("", err);

[Survived] ConditionalExpression
lib/dirty/dirty.js:122:15
-             if (chunk.lastIndexOf('\n') === -1) return;
+             if (false) return;

[Survived] StringLiteral
lib/dirty/dirty.js:122:33
-             if (chunk.lastIndexOf('\n') === -1) return;
+             if (chunk.lastIndexOf("") === -1) return;

[Survived] UnaryOperator
lib/dirty/dirty.js:122:43
-             if (chunk.lastIndexOf('\n') === -1) return;
+             if (chunk.lastIndexOf('\n') === +1) return;

[Survived] ConditionalExpression
lib/dirty/dirty.js:126:17
-               if (!rowStr) {
+               if (false) {

[Survived] BlockStatement
lib/dirty/dirty.js:126:26
-               if (!rowStr) {
-                 this.emit('error', new Error('Empty lines never appear in a healthy database'));
-                 return;
-               }
+               if (!rowStr) {}

[Survived] StringLiteral
lib/dirty/dirty.js:127:25
-                 this.emit('error', new Error('Empty lines never appear in a healthy database'));
+                 this.emit("", new Error('Empty lines never appear in a healthy database'));

[Survived] StringLiteral
lib/dirty/dirty.js:127:44
-                 this.emit('error', new Error('Empty lines never appear in a healthy database'));
+                 this.emit('error', new Error(""));

[Survived] ConditionalExpression
lib/dirty/dirty.js:134:19
-                 if (!('key' in row)) {
+                 if (false) {

[Survived] BlockStatement
lib/dirty/dirty.js:134:36
-                 if (!('key' in row)) {
-                   throw new Error();
-                 }
+                 if (!('key' in row)) {}

[Survived] BlockStatement
lib/dirty/dirty.js:137:25
-               } catch (e) {
-                 this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
-                 return '';
-               }
+               } catch (e) {}

[Survived] StringLiteral
lib/dirty/dirty.js:138:25
-                 this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
+                 this.emit("", new Error(`Could not load corrupted row: ${rowStr}`));

[Survived] StringLiteral
lib/dirty/dirty.js:138:44
-                 this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
+                 this.emit('error', new Error(``));

[Survived] StringLiteral
lib/dirty/dirty.js:139:22
-                 return '';
+                 return "Stryker was here!";

[Survived] StringLiteral
lib/dirty/dirty.js:147:20
-               return '';
+               return "Stryker was here!";

[Survived] ConditionalExpression
lib/dirty/dirty.js:151:15
-             if (buffer.length) {
+             if (false) {

[Survived] BlockStatement
lib/dirty/dirty.js:151:30
-             if (buffer.length) {
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
-             }
+             if (buffer.length) {}

[Survived] StringLiteral
lib/dirty/dirty.js:152:23
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
+               this.emit("", new Error(`Corrupted row at the end of the db: ${buffer}`));

[Survived] StringLiteral
lib/dirty/dirty.js:152:42
-               this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
+               this.emit('error', new Error(``));

[Survived] StringLiteral
lib/dirty/dirty.js:156:13
-           .on('close', () => {
+           .on("", () => {

[Survived] BlockStatement
lib/dirty/dirty.js:156:28
-           .on('close', () => {
-             this._readStream = null;
-             this.emit('read_close');
-           });
+           .on('close', () => {});

[Survived] StringLiteral
lib/dirty/dirty.js:158:21
-             this.emit('read_close');
+             this.emit("");

[Survived] StringLiteral
lib/dirty/dirty.js:162:17
-         encoding: 'utf-8',
+         encoding: "",

[Survived] StringLiteral
lib/dirty/dirty.js:166:26
-       this._writeStream.on('drain', () => {
+       this._writeStream.on("", () => {

[Survived] BlockStatement
lib/dirty/dirty.js:166:41
-       this._writeStream.on('drain', () => {
-         this._waitForDrain = false;
-         if (!this._queue.size) {
-           if (this._inFlightWrites <= 0) this.emit('drain');
-         } else {
-           this._flush();
-         }
-       });
+       this._writeStream.on('drain', () => {});

[Survived] BooleanLiteral
lib/dirty/dirty.js:167:28
-         this._waitForDrain = false;
+         this._waitForDrain = true;

[Survived] BooleanLiteral
lib/dirty/dirty.js:168:11
-         if (!this._queue.size) {
+         if (this._queue.size) {

[Survived] ConditionalExpression
lib/dirty/dirty.js:168:11
-         if (!this._queue.size) {
+         if (true) {

[Survived] ConditionalExpression
lib/dirty/dirty.js:168:11
-         if (!this._queue.size) {
+         if (false) {

[Survived] BlockStatement
lib/dirty/dirty.js:168:30
-         if (!this._queue.size) {
-           if (this._inFlightWrites <= 0) this.emit('drain');
-         } else {
+         if (!this._queue.size) {} else {

[Survived] ConditionalExpression
lib/dirty/dirty.js:169:13
-           if (this._inFlightWrites <= 0) this.emit('drain');
+           if (true) this.emit('drain');

[Survived] ConditionalExpression
lib/dirty/dirty.js:169:13
-           if (this._inFlightWrites <= 0) this.emit('drain');
+           if (false) this.emit('drain');

[Survived] StringLiteral
lib/dirty/dirty.js:169:50
-           if (this._inFlightWrites <= 0) this.emit('drain');
+           if (this._inFlightWrites <= 0) this.emit("");

[Survived] BlockStatement
lib/dirty/dirty.js:170:14
-         } else {
-           this._flush();
-         }
+         } else {}

[Survived] ConditionalExpression
lib/dirty/dirty.js:182:9
-       if (!this._queue.size || this._waitForDrain) return;
+       if (false) return;

[Survived] LogicalOperator
lib/dirty/dirty.js:182:9
-       if (!this._queue.size || this._waitForDrain) return;
+       if (!this._queue.size && this._waitForDrain) return;

[Survived] ConditionalExpression
lib/dirty/dirty.js:189:13
-           if (!cbs.length && err != null) this.emit('error', err);
+           if (false) this.emit('error', err);

[Survived] StringLiteral
lib/dirty/dirty.js:189:51
-           if (!cbs.length && err != null) this.emit('error', err);
+           if (!cbs.length && err != null) this.emit("", err);

[Survived] ConditionalExpression
lib/dirty/dirty.js:193:11
-         if (this._waitForDrain) break;
+         if (true) break;
