[Survived] ConditionalExpression
src/geo-point.ts:11:29
-   const isObject = (input) => typeof input === 'object' && input !== null;
+   const isObject = (input) => true;

[Survived] LogicalOperator
src/geo-point.ts:11:29
-   const isObject = (input) => typeof input === 'object' && input !== null;
+   const isObject = (input) => typeof input === 'object' || input !== null;

[Survived] ConditionalExpression
src/geo-point.ts:11:29
-   const isObject = (input) => typeof input === 'object' && input !== null;
+   const isObject = (input) => true && input !== null;

[Survived] ConditionalExpression
src/geo-point.ts:11:58
-   const isObject = (input) => typeof input === 'object' && input !== null;
+   const isObject = (input) => typeof input === 'object' && true;

[Survived] ConditionalExpression
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (typeof latitude !== 'number' && typeof longitude !== 'number') {

[Survived] ConditionalExpression
src/geo-point.ts:38:9
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (false || typeof longitude !== 'number') {

[Survived] ConditionalExpression
src/geo-point.ts:38:41
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
+       if (typeof latitude !== 'number' || false) {

[Survived] BlockStatement
src/geo-point.ts:38:72
-       if (typeof latitude !== 'number' || typeof longitude !== 'number') {
-         throw new RangeError('Bad geo point arguments');
-       }
+       if (typeof latitude !== 'number' || typeof longitude !== 'number') {}

[Survived] StringLiteral
src/geo-point.ts:39:28
-         throw new RangeError('Bad geo point arguments');
+         throw new RangeError("");

[Survived] ConditionalExpression
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 && latitude > 90) {

[Survived] ConditionalExpression
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (false || latitude > 90) {

[Survived] EqualityOperator
src/geo-point.ts:42:9
-       if (latitude < -90 || latitude > 90) {
+       if (latitude <= -90 || latitude > 90) {

[Survived] ConditionalExpression
src/geo-point.ts:42:27
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || false) {

[Survived] EqualityOperator
src/geo-point.ts:42:27
-       if (latitude < -90 || latitude > 90) {
+       if (latitude < -90 || latitude >= 90) {

[Survived] BlockStatement
src/geo-point.ts:42:42
-       if (latitude < -90 || latitude > 90) {
-         throw new RangeError('bad latitude value');
-       }
+       if (latitude < -90 || latitude > 90) {}

[Survived] StringLiteral
src/geo-point.ts:43:28
-         throw new RangeError('bad latitude value');
+         throw new RangeError("");

[Survived] ConditionalExpression
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -180 && longitude > 180) {

[Survived] ConditionalExpression
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (false || longitude > 180) {

[Survived] EqualityOperator
src/geo-point.ts:46:9
-       if (longitude < -180 || longitude > 180) {
+       if (longitude <= -180 || longitude > 180) {

[Survived] ConditionalExpression
src/geo-point.ts:46:29
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -180 || false) {

[Survived] EqualityOperator
src/geo-point.ts:46:29
-       if (longitude < -180 || longitude > 180) {
+       if (longitude < -180 || longitude >= 180) {

[Survived] BlockStatement
src/geo-point.ts:46:46
-       if (longitude < -180 || longitude > 180) {
-         throw new RangeError('bad longitude value');
-       }
+       if (longitude < -180 || longitude > 180) {}

[Survived] StringLiteral
src/geo-point.ts:47:28
-         throw new RangeError('bad longitude value');
+         throw new RangeError("");

[Survived] ConditionalExpression
src/geo-point.ts:60:9
-       if (!isObject(point)) {
+       if (false) {

[Survived] BlockStatement
src/geo-point.ts:60:27
-       if (!isObject(point)) {
-         throw new TypeError('GeoPoint: Argument must be an object');
-       }
+       if (!isObject(point)) {}

[Survived] StringLiteral
src/geo-point.ts:61:27
-         throw new TypeError('GeoPoint: Argument must be an object');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:64:9
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
+       if (!point.hasOwnProperty('type') && !point.hasOwnProperty('coordinates')) {

[Survived] BlockStatement
src/geo-point.ts:64:80
-       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {
-         throw new TypeError('Object must have type and coordinates');
-       }
+       if (!point.hasOwnProperty('type') || !point.hasOwnProperty('coordinates')) {}

[Survived] StringLiteral
src/geo-point.ts:65:27
-         throw new TypeError('Object must have type and coordinates');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:68:9
-       if (point.type !== 'Point') {
+       if (false) {

[Survived] BlockStatement
src/geo-point.ts:68:33
-       if (point.type !== 'Point') {
-         throw new TypeError('The value of type should be \'Point\'');
-       }
+       if (point.type !== 'Point') {}

[Survived] StringLiteral
src/geo-point.ts:69:27
-         throw new TypeError('The value of type should be \'Point\'');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:72:9
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates) && point.coordinates.length !== 2) {

[Survived] ConditionalExpression
src/geo-point.ts:72:46
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
+       if (!Array.isArray(point.coordinates) || false) {

[Survived] BlockStatement
src/geo-point.ts:72:78
-       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {
-         throw new TypeError('coordinates must be an array and contain 2 elements');
-       }
+       if (!Array.isArray(point.coordinates) || point.coordinates.length !== 2) {}

[Survived] StringLiteral
src/geo-point.ts:73:27
-         throw new TypeError('coordinates must be an array and contain 2 elements');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:85:9
-       if (!isObject(object)) {
+       if (false) {

[Survived] BlockStatement
src/geo-point.ts:85:28
-       if (!isObject(object)) {
-         throw new TypeError('GeoPoint: Argument must be an object');
-       }
+       if (!isObject(object)) {}

[Survived] StringLiteral
src/geo-point.ts:86:27
-         throw new TypeError('GeoPoint: Argument must be an object');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (false) {

[Survived] LogicalOperator
src/geo-point.ts:89:9
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
+       if (!object.hasOwnProperty('latitude') && !object.hasOwnProperty('longitude')) {

[Survived] BlockStatement
src/geo-point.ts:89:84
-       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {
-         throw new TypeError('Object must have latitude and longitude');
-       }
+       if (!object.hasOwnProperty('latitude') || !object.hasOwnProperty('longitude')) {}

[Survived] StringLiteral
src/geo-point.ts:90:27
-         throw new TypeError('Object must have latitude and longitude');
+         throw new TypeError("");

[Survived] ConditionalExpression
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(false ? 1 : r) * 6371392.896;

[Survived] EqualityOperator
src/geo-point.ts:110:17
-       return acos(r > 1 ? 1 : r) * 6371392.896;
+       return acos(r >= 1 ? 1 : r) * 6371392.896;

[Survived] ArithmeticOperator
src/geo-point.ts:153:19
-       const sinφ2 = sinφ1 * cosδ + cosφ1 * sinδ * cosθ;
+       const sinφ2 = sinφ1 * cosδ - cosφ1 * sinδ * cosθ;

[Survived] ArithmeticOperator
src/geo-point.ts:153:19
-       const sinφ2 = sinφ1 * cosδ + cosφ1 * sinδ * cosθ;
+       const sinφ2 = sinφ1 / cosδ + cosφ1 * sinδ * cosθ;

[Survived] ArithmeticOperator
src/geo-point.ts:153:34
-       const sinφ2 = sinφ1 * cosδ + cosφ1 * sinδ * cosθ;
+       const sinφ2 = sinφ1 * cosδ + cosφ1 * sinδ / cosθ;

[Survived] ArithmeticOperator
src/geo-point.ts:155:15
-       const y = sinθ * sinδ * cosφ1;
+       const y = sinθ * sinδ / cosφ1;

[Survived] ArithmeticOperator
src/geo-point.ts:156:15
-       const x = cosδ - sinφ1 * sinφ2;
+       const x = cosδ + sinφ1 * sinφ2;

[Survived] ArithmeticOperator
src/geo-point.ts:156:22
-       const x = cosδ - sinφ1 * sinφ2;
+       const x = cosδ - sinφ1 / sinφ2;

[Survived] ArithmeticOperator
src/geo-point.ts:157:16
-       const λ2 = λ1 + atan2(y, x);
+       const λ2 = λ1 - atan2(y, x);

[Survived] BlockStatement
src/geo-point.ts:170:82
-     static fromLatLngArray(array: [latitude: number, longitude: number]): GeoPoint {
-       return new GeoPoint(array[0], array[1]);
-     }
+     static fromLatLngArray(array: [latitude: number, longitude: number]): GeoPoint {}

[Survived] BlockStatement
src/geo-point.ts:209:45
-     calculateBearing(point: GeoPoint): number {
-       return GeoPoint.calculateBearing(this, point);
-     }
+     calculateBearing(point: GeoPoint): number {}

[Survived] BlockStatement
src/geo-point.ts:218:46
-     calculateDistance(point: GeoPoint): number {
-       return GeoPoint.calculateDistance(this, point);
-     }
+     calculateDistance(point: GeoPoint): number {}
