[Survived] BooleanLiteral
sinks/drain.js:8:7
-     if (!done) {
+     if (done) {

[Survived] ConditionalExpression
sinks/drain.js:8:7
-     if (!done) {
+     if (true) {

[Survived] ConditionalExpression
sinks/drain.js:8:7
-     if (!done) {
+     if (false) {

[Survived] BlockStatement
sinks/drain.js:8:14
-     if (!done) {
-       doneLackingErr = new Error('no done callback supplied')
-     }
+     if (!done) {}

[Survived] StringLiteral
sinks/drain.js:9:32
-       doneLackingErr = new Error('no done callback supplied')
+       doneLackingErr = new Error("")

[Survived] ConditionalExpression
sinks/drain.js:14:8
-       if(abort) return sink.abort()
+       if(false) return sink.abort()

[Survived] BooleanLiteral
sinks/drain.js:19:33
-           var loop = true, cbed = false
+           var loop = true, cbed = true

[Survived] ConditionalExpression
sinks/drain.js:26:18
-                 if(done) done(end === true ? null : end)
+                 if(true) done(end === true ? null : end)

[Survived] ConditionalExpression
sinks/drain.js:27:23
-                 else if(end && end !== true) {
+                 else if(true) {

[Survived] ConditionalExpression
sinks/drain.js:27:23
-                 else if(end && end !== true) {
+                 else if(false) {

[Survived] LogicalOperator
sinks/drain.js:27:23
-                 else if(end && end !== true) {
+                 else if(end || end !== true) {

[Survived] ConditionalExpression
sinks/drain.js:27:30
-                 else if(end && end !== true) {
+                 else if(end && true) {

[Survived] EqualityOperator
sinks/drain.js:27:30
-                 else if(end && end !== true) {
+                 else if(end && end === true) {

[Survived] BooleanLiteral
sinks/drain.js:27:38
-                 else if(end && end !== true) {
+                 else if(end && end !== false) {

[Survived] BlockStatement
sinks/drain.js:27:44
-                 else if(end && end !== true) {
-                   console.warn(doneLackingErr)
-                   throw end
-                 }
+                 else if(end && end !== true) {}

[Survived] ConditionalExpression
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(true, done || function () {})

[Survived] ConditionalExpression
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(false, done || function () {})

[Survived] LogicalOperator
sinks/drain.js:34:20
-                 read(abort || true, done || function () {})
+                 read(abort && true, done || function () {})

[Survived] BooleanLiteral
sinks/drain.js:34:29
-                 read(abort || true, done || function () {})
+                 read(abort || false, done || function () {})

[Survived] ConditionalExpression
sinks/drain.js:49:8
-       if('function' == typeof err)
+       if(false)

[Survived] StringLiteral
sinks/drain.js:49:8
-       if('function' == typeof err)
+       if("" == typeof err)

[Survived] BooleanLiteral
sinks/drain.js:50:23
-         cb = err, err = true
+         cb = err, err = false

[Survived] ConditionalExpression
sinks/drain.js:52:8
-       if(read) return read(abort, cb || function () {})
+       if(true) return read(abort, cb || function () {})

[Survived] ConditionalExpression
sinks/drain.js:52:8
-       if(read) return read(abort, cb || function () {})
+       if(false) return read(abort, cb || function () {})

[Survived] ConditionalExpression
sinks/find.js:9:6
-     if(!cb)
+     if(false)

[Survived] ConditionalExpression
sinks/find.js:22:8
-       cb(err === true ? null : err, null)
+       cb(true ? null : err, null)

[Survived] ConditionalExpression
sinks/find.js:22:8
-       cb(err === true ? null : err, null)
+       cb(false ? null : err, null)

[Survived] EqualityOperator
sinks/find.js:22:8
-       cb(err === true ? null : err, null)
+       cb(err !== true ? null : err, null)

[Survived] BooleanLiteral
sinks/find.js:22:16
-       cb(err === true ? null : err, null)
+       cb(err === false ? null : err, null)

[Survived] BlockStatement
sinks/log.js:5:38
-   module.exports = function log (done) {
-     return drain(function (data) {
-       console.log(data)
-     }, done)
-   }
+   module.exports = function log (done) {}

[Survived] BlockStatement
sinks/log.js:6:32
-     return drain(function (data) {
-       console.log(data)
-     }, done)
+     return drain(function (data) {}, done)

[Survived] ConditionalExpression
sinks/reduce.js:12:7
-     if (arguments.length === 2)
+     if (false)

[Survived] ConditionalExpression
sinks/reduce.js:16:12
-           if(end) return cb(end === true ? null : end)
+           if(false) return cb(end === true ? null : end)

[Survived] ConditionalExpression
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(true ? null : end)

[Survived] ConditionalExpression
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(false ? null : end)

[Survived] EqualityOperator
sinks/reduce.js:16:27
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end !== true ? null : end)

[Survived] BooleanLiteral
sinks/reduce.js:16:35
-           if(end) return cb(end === true ? null : end)
+           if(end) return cb(end === false ? null : end)

[Survived] ConditionalExpression
sources/count.js:6:8
-       if(end) return cb && cb(end)
+       if(false) return cb && cb(end)

[Survived] ConditionalExpression
sources/infinite.js:5:8
-       if(end) return cb && cb(end)
+       if(false) return cb && cb(end)

[Survived] ConditionalExpression
sources/once.js:6:8
-       if(abort)
+       if(false)

[Survived] ConditionalExpression
sources/values.js:5:6
-     if(!array)
+     if(false)

[Survived] BlockStatement
sources/values.js:6:33
-       return function (abort, cb) {
-         if(abort) return abortCb(cb, abort, onAbort)
-         return cb(true)
-       }
+       return function (abort, cb) {}

[Survived] ConditionalExpression
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(true) return abortCb(cb, abort, onAbort)

[Survived] ConditionalExpression
sources/values.js:7:10
-         if(abort) return abortCb(cb, abort, onAbort)
+         if(false) return abortCb(cb, abort, onAbort)

[Survived] BooleanLiteral
sources/values.js:8:17
-         return cb(true)
+         return cb(false)

[Survived] ConditionalExpression
sources/values.js:10:6
-     if(!Array.isArray(array))
+     if(true)

[Survived] BlockStatement
throughs/async-map.js:3:17
-   function id (e) { return e }
+   function id (e) {}

[Survived] ConditionalExpression
throughs/async-map.js:7:6
-     if(!map) return id
+     if(false) return id

[Survived] ConditionalExpression
throughs/async-map.js:12:10
-         if(aborted) return cb(aborted)
+         if(false) return cb(aborted)

[Survived] ConditionalExpression
throughs/async-map.js:15:12
-           if(!busy) read(abort, function (err) {
+           if(false) read(abort, function (err) {

[Survived] BooleanLiteral
throughs/filter.js:13:16
-           sync = true
+           sync = false

[Survived] BooleanLiteral
throughs/filter.js:19:16
-           sync = false
+           sync = true

[Survived] LogicalOperator
throughs/flatten.js:13:16
-             read(err || abort, cb)
+             read(err && abort, cb)

[Survived] BlockStatement
throughs/map.js:3:17
-   function id (e) { return e }
+   function id (e) {}

[Survived] ConditionalExpression
throughs/map.js:7:6
-     if(!mapper) return id
+     if(false) return id

[Survived] BooleanLiteral
throughs/take.js:19:16
-           last = false; cb(err || true)
+           last = true; cb(err || true)

[Survived] ConditionalExpression
throughs/take.js:19:26
-           last = false; cb(err || true)
+           last = false; cb(true)

[Survived] LogicalOperator
throughs/take.js:19:26
-           last = false; cb(err || true)
+           last = false; cb(err && true)

[Survived] BooleanLiteral
throughs/take.js:19:33
-           last = false; cb(err || true)
+           last = false; cb(err || false)

[Survived] LogicalOperator
throughs/take.js:28:22
-             if(ended = ended || end) {
+             if(ended = ended && end) {

[Survived] BlockStatement
throughs/take.js:28:36
-             if(ended = ended || end) {
-               //last ? terminate(cb) :
-               cb(ended)
-             }
+             if(ended = ended || end) {}

[Survived] ConditionalExpression
throughs/through.js:10:11
-       onEnd(abort === true ? null : abort)
+       onEnd(true ? null : abort)

[Survived] ConditionalExpression
throughs/through.js:10:11
-       onEnd(abort === true ? null : abort)
+       onEnd(false ? null : abort)

[Survived] EqualityOperator
throughs/through.js:10:11
-       onEnd(abort === true ? null : abort)
+       onEnd(abort !== true ? null : abort)

[Survived] BooleanLiteral
throughs/through.js:10:21
-       onEnd(abort === true ? null : abort)
+       onEnd(abort === false ? null : abort)

[Survived] ConditionalExpression
throughs/through.js:15:10
-         if(end) once(end)
+         if(true) once(end)

[Survived] ConditionalExpression
throughs/through.js:15:10
-         if(end) once(end)
+         if(false) once(end)

[Survived] ConditionalExpression
util/prop.js:3:5
-       'string' == typeof key
+       false

[Survived] StringLiteral
util/prop.js:3:5
-       'string' == typeof key
+       "" == typeof key

[Survived] BlockStatement
util/prop.js:4:23
-       ? function (data) { return data[key] }
+       ? function (data) {}

[Survived] ConditionalExpression
util/prop.js:5:7
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : false //regexp

[Survived] LogicalOperator
util/prop.js:5:7
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : 'object' === typeof key || 'function' === typeof key.exec //regexp //regexp

[Survived] ConditionalExpression
util/prop.js:5:7
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : true && 'function' === typeof key.exec //regexp

[Survived] EqualityOperator
util/prop.js:5:7
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : 'object' !== typeof key && 'function' === typeof key.exec //regexp

[Survived] StringLiteral
util/prop.js:5:7
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : "" === typeof key && 'function' === typeof key.exec //regexp

[Survived] ConditionalExpression
util/prop.js:5:34
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : 'object' === typeof key && true //regexp

[Survived] EqualityOperator
util/prop.js:5:34
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : 'object' === typeof key && 'function' !== typeof key.exec //regexp

[Survived] StringLiteral
util/prop.js:5:34
-       : 'object' === typeof key && 'function' === typeof key.exec //regexp
+       : 'object' === typeof key && "" === typeof key.exec //regexp

[Survived] BlockStatement
util/prop.js:6:23
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) {}

[Survived] ConditionalExpression
util/prop.js:6:56
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data); return true }

[Survived] ConditionalExpression
util/prop.js:6:56
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data); return false }

[Survived] LogicalOperator
util/prop.js:6:56
-       ? function (data) { var v = key.exec(data); return v && v[0] }
+       ? function (data) { var v = key.exec(data); return v || v[0] }

[Survived] BlockStatement
util/tester.js:3:17
-   function id (e) { return e }
+   function id (e) {}

[Survived] ConditionalExpression
util/tester.js:7:5
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       false //regexp

[Survived] LogicalOperator
util/tester.js:7:5
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       'object' === typeof test || 'function' === typeof test.test //regexp //regexp

[Survived] ConditionalExpression
util/tester.js:7:5
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       true && 'function' === typeof test.test //regexp

[Survived] EqualityOperator
util/tester.js:7:5
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       'object' !== typeof test && 'function' === typeof test.test //regexp

[Survived] StringLiteral
util/tester.js:7:5
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       "" === typeof test && 'function' === typeof test.test //regexp

[Survived] ConditionalExpression
util/tester.js:7:33
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       'object' === typeof test && true //regexp

[Survived] EqualityOperator
util/tester.js:7:33
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       'object' === typeof test && 'function' !== typeof test.test //regexp

[Survived] StringLiteral
util/tester.js:7:33
-       'object' === typeof test && 'function' === typeof test.test //regexp
+       'object' === typeof test && "" === typeof test.test //regexp

[Survived] ConditionalExpression
pull.js:5:7
-     if (typeof a === 'function' && a.length === 1) {
+     if (true && a.length === 1) {

[Survived] ArrayDeclaration
pull.js:6:16
-       var args = new Array(length)
+       var args = new Array()

[Survived] EqualityOperator
pull.js:7:20
-       for(var i = 0; i < length; i++)
+       for(var i = 0; i <= length; i++)

[Survived] ConditionalExpression
pull.js:10:11
-         if (args == null) {
+         if (false) {

[Survived] BlockStatement
pull.js:10:25
-         if (args == null) {
-           throw new TypeError("partial sink should only be called once!")
-         }
+         if (args == null) {}

[Survived] StringLiteral
pull.js:11:29
-           throw new TypeError("partial sink should only be called once!")
+           throw new TypeError("")

[Survived] ConditionalExpression
pull.js:21:7
-         case 1: return pull(read, ref[0])
+         case 1:

[Survived] ConditionalExpression
pull.js:22:7
-         case 2: return pull(read, ref[0], ref[1])
+         case 2:

[Survived] ConditionalExpression
pull.js:23:7
-         case 3: return pull(read, ref[0], ref[1], ref[2])
+         case 3:

[Survived] ConditionalExpression
pull.js:24:7
-         case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+         case 4:

[Survived] ConditionalExpression
pull.js:25:7
-         default:
-           ref.unshift(read)
-           return pull.apply(null, ref)
+         default:

[Survived] ConditionalExpression
pull.js:34:7
-     if (read && typeof read.source === 'function') {
+     if (false) {

[Survived] StringLiteral
pull.js:34:38
-     if (read && typeof read.source === 'function') {
+     if (read && typeof read.source === "") {

[Survived] BlockStatement
pull.js:34:50
-     if (read && typeof read.source === 'function') {
-       read = read.source
-     }
+     if (read && typeof read.source === 'function') {}

[Survived] EqualityOperator
pull.js:38:19
-     for (var i = 1; i < length; i++) {
+     for (var i = 1; i <= length; i++) {

[Survived] ConditionalExpression
pull.js:40:9
-       if (typeof s === 'function') {
+       if (true) {

[Survived] ConditionalExpression
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (true) {

[Survived] ConditionalExpression
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (false) {

[Survived] LogicalOperator
pull.js:42:16
-       } else if (s && typeof s === 'object') {
+       } else if (s || typeof s === 'object') {

[Survived] ConditionalExpression
pull.js:42:21
-       } else if (s && typeof s === 'object') {
+       } else if (s && true) {

[Survived] EqualityOperator
pull.js:42:21
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s !== 'object') {

[Survived] StringLiteral
pull.js:42:34
-       } else if (s && typeof s === 'object') {
+       } else if (s && typeof s === "") {

[Survived] BlockStatement
pull.js:42:44
-       } else if (s && typeof s === 'object') {
-         s.sink(read)
-         read = s.source
-       }
+       } else if (s && typeof s === 'object') {}
