[Survived] ObjectLiteral
lib/ZipAFolder.ts:36:59
-           const o: ZipAFolderOptions = zipAFolderOptions || {
-               compression: COMPRESSION_LEVEL.high,
-           };
+           const o: ZipAFolderOptions = zipAFolderOptions || {};

[Survived] ConditionalExpression
lib/ZipAFolder.ts:40:13
-           if (o.compression === COMPRESSION_LEVEL.uncompressed) {
+           if (false) {

[Survived] BlockStatement
lib/ZipAFolder.ts:40:63
-           if (o.compression === COMPRESSION_LEVEL.uncompressed) {
-               await ZipAFolder.compress({src, targetFilePath: tarFilePath, format: 'tar', zipAFolderOptions});
-           } else {
+           if (o.compression === COMPRESSION_LEVEL.uncompressed) {} else {

[Survived] ObjectLiteral
lib/ZipAFolder.ts:70:59
-           const o: ZipAFolderOptions = zipAFolderOptions || {
-               compression: COMPRESSION_LEVEL.high,
-           };
+           const o: ZipAFolderOptions = zipAFolderOptions || {};

[Survived] ConditionalExpression
lib/ZipAFolder.ts:74:13
-           if (o.compression === COMPRESSION_LEVEL.uncompressed) {
+           if (false) {

[Survived] BlockStatement
lib/ZipAFolder.ts:74:63
-           if (o.compression === COMPRESSION_LEVEL.uncompressed) {
-               await ZipAFolder.compress({
-                   src,
-                   targetFilePath: zipFilePath,
-                   format: 'zip',
-                   zipAFolderOptions,
-                   archiverOptions: {
-                       store: true,
-                   },
-               });
-           } else {
+           if (o.compression === COMPRESSION_LEVEL.uncompressed) {} else {

[Survived] ObjectLiteral
lib/ZipAFolder.ts:80:34
-                   archiverOptions: {
-                       store: true,
-                   },
+                   archiverOptions: {},

[Survived] BooleanLiteral
lib/ZipAFolder.ts:81:28
-                       store: true,
+                       store: false,
